
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do bench_fn_sizes.do 

. * Benchmark FN at different sizes
. clear all

. set more off

. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. 
. di "{hline 50}"
--------------------------------------------------

. di "FN Solver Benchmark"
FN Solver Benchmark

. di "{hline 50}"
--------------------------------------------------

. 
. foreach n in 1000 5000 10000 {
  2.     clear
  3.     set seed 12345
  4.     set obs `n'
  5.     gen x1 = rnormal()
  6.     gen x2 = rnormal()
  7.     gen y = 1 + 2*x1 - x2 + rnormal()*2
  8. 
.     di _newline "N=`n'"
  9. 
.     timer clear 1
 10.     timer on 1
 11.     quietly qreg y x1 x2
 12.     timer off 1
 13.     matrix b1 = e(b)
 14. 
.     timer clear 2
 15.     timer on 2
 16.     quietly cqreg y x1 x2
 17.     timer off 2
 18.     matrix b2 = e(b)
 19. 
.     local diff = max(abs(b1[1,1]-b2[1,1]), abs(b1[1,2]-b2[1,2]), abs(b1[1,3]-
> b2[1,3]))
 20. 
.     quietly timer list 1
 21.     local t1 = r(t1)
 22.     quietly timer list 2
 23.     local t2 = r(t2)
 24. 
.     di "  qreg: " %6.3f `t1' "s  FN: " %6.3f `t2' "s  Speedup: " %4.1f (`t1'/
> `t2') "x  MaxDiff: " %7.4f `diff'
 25. }
Number of observations (_N) was 0, now 1,000.

N=1000
  qreg:  0.036s  FN:  0.203s  Speedup:  0.2x  MaxDiff:  0.0144
Number of observations (_N) was 0, now 5,000.

N=5000
