
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do bench_fn.do 

. * Benchmark FN solver vs qreg
. clear all

. set more off

. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. 
. di "{hline 60}"
------------------------------------------------------------

. di "Benchmark: Frisch-Newton vs qreg"
Benchmark: Frisch-Newton vs qreg

. di "{hline 60}"
------------------------------------------------------------

. 
. foreach n in 1000 5000 10000 50000 {
  2.     clear
  3.     set seed 12345
  4.     set obs `n'
  5.     gen x1 = rnormal()
  6.     gen x2 = rnormal()
  7.     gen y = 1 + 2*x1 - x2 + rnormal()*2
  8. 
.     di _newline "=== N=`n' ==="
  9. 
.     timer clear 1
 10.     timer on 1
 11.     quietly qreg y x1 x2
 12.     timer off 1
 13.     quietly timer list 1
 14.     local t_qreg = r(t1)
 15.     matrix b_qreg = e(b)
 16. 
.     timer clear 2
 17.     timer on 2
 18.     quietly cqreg y x1 x2, nopreprocess(1)
 19.     timer off 2
 20.     quietly timer list 2
 21.     local t_fn = r(t2)
 22.     matrix b_fn = e(b)
 23. 
.     local diff1 = abs(b_qreg[1,1] - b_fn[1,1])
 24.     local diff2 = abs(b_qreg[1,2] - b_fn[1,2])
 25.     local diff3 = abs(b_qreg[1,3] - b_fn[1,3])
 26.     local max_diff = max(`diff1', `diff2', `diff3')
 27. 
.     di "qreg:  " %6.3f `t_qreg' "s"
 28.     di "FN:    " %6.3f `t_fn' "s"
 29.     di "Speedup: " %5.1f (`t_qreg'/`t_fn') "x"
 30.     di "Max coef diff: " %8.5f `max_diff'
 31. }
Number of observations (_N) was 0, now 1,000.

=== N=1000 ===
