
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do debug_ipm.do 

. * Debug IPM step by step
. clear all

. set more off

. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. 
. sysuse auto, clear
(1978 automobile data)

. keep price mpg

. 
. * Run both and show verbose output
. di _newline "{hline 78}"

------------------------------------------------------------------------------

. di "QREG"
QREG

. di "{hline 78}"
------------------------------------------------------------------------------

. qreg price mpg

Iteration 1:  WLS sum of weighted deviations =  70552.192

Iteration 1:  Sum of abs. weighted deviations =    75229.5
Iteration 2:  Sum of abs. weighted deviations =   64766.75
Iteration 3:  Sum of abs. weighted deviations =  64760.833

Median regression                                   Number of obs =         74
  Raw sum of deviations  71102.5 (about 4934)
  Min sum of deviations 64760.83                    Pseudo R2     =     0.0892

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -135.6667   67.26576    -2.02   0.047    -269.7585   -1.574816
       _cons |   8088.667   1483.808     5.45   0.000     5130.749    11046.58
------------------------------------------------------------------------------

. 
. di _newline "{hline 78}"

------------------------------------------------------------------------------

. di "CQREG (verbose)"
CQREG (verbose)

. di "{hline 78}"
------------------------------------------------------------------------------

. cqreg price mpg, verbose

------------------------------------------------------------
cqreg: C-Accelerated Quantile Regression
------------------------------------------------------------
Quantile:   .5
Depvar:     price
Indepvars:   mpg
Obs:        74
VCE type:   iid
Bandwidth:  Hall-Sheather
------------------------------------------------------------

cqreg: N=74, K=2, G=0, quantile=0.500
cqreg: IPM: iterations=11, converged=1, objective=64760.8333, time=0.000s
cqreg: Sparsity: 4373.6489, bandwidth: 0.225182
cqreg: Total time: 0.001s (load: 0.001, hdfe: 0.000, ipm: 0.000, vce: 0.000)

Median regression                                  Number of obs =         74
  Raw sum of deviations 71102.5  (about 5006.5   )
  Min sum of deviations 64760.8                    Pseudo R2     =     0.0892

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -135.6667   44.23962    -3.07   0.003    -223.8567    -47.4766
       _cons |   8088.667   975.8768     8.29   0.000     6143.292    10034.04
------------------------------------------------------------------------------

Iterations: 11, converged: yes
Total time:     0.001 seconds

. 
. * Show the results
. matrix list e(b)

e(b)[1,2]
           mpg       _cons
y1  -135.66667   8088.6667

. 
end of do-file
