
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do debug_auto.do 

. * Debug cqreg vs qreg on sysuse auto
. clear all

. set more off

. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. 
. sysuse auto, clear
(1978 automobile data)

. 
. di _newline "{hline 78}"

------------------------------------------------------------------------------

. di "QREG price mpg"
QREG price mpg

. di "{hline 78}"
------------------------------------------------------------------------------

. qreg price mpg

Iteration 1:  WLS sum of weighted deviations =  70552.192

Iteration 1:  Sum of abs. weighted deviations =    75229.5
Iteration 2:  Sum of abs. weighted deviations =   64766.75
Iteration 3:  Sum of abs. weighted deviations =  64760.833

Median regression                                   Number of obs =         74
  Raw sum of deviations  71102.5 (about 4934)
  Min sum of deviations 64760.83                    Pseudo R2     =     0.0892

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -135.6667   67.26576    -2.02   0.047    -269.7585   -1.574816
       _cons |   8088.667   1483.808     5.45   0.000     5130.749    11046.58
------------------------------------------------------------------------------

. 
. matrix qreg_b = e(b)

. matrix qreg_V = e(V)

. local qreg_sum_adev = e(sum_adev)

. local qreg_sum_rdev = e(sum_rdev)

. local qreg_r2_p = e(r2_p)

. local qreg_q_v = e(q_v)

. 
. di _newline(2) "{hline 78}"


------------------------------------------------------------------------------

. di "CQREG price mpg"
CQREG price mpg

. di "{hline 78}"
------------------------------------------------------------------------------

. cqreg price mpg

Median regression                                  Number of obs =         74
  Raw sum of deviations 71102.5  (about 5006.5   )
  Min sum of deviations 64760.8                    Pseudo R2     =     0.0892

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -135.6667   44.23962    -3.07   0.003    -223.8567    -47.4766
       _cons |   8088.667   975.8768     8.29   0.000     6143.292    10034.04
------------------------------------------------------------------------------

. 
. matrix cqreg_b = e(b)

. matrix cqreg_V = e(V)

. local cqreg_sum_adev = e(sum_adev)

. local cqreg_sum_rdev = e(sum_rdev)

. local cqreg_r2_p = e(r2_p)

. local cqreg_q_v = e(q_v)

. 
. di _newline(2) "{hline 78}"


------------------------------------------------------------------------------

. di "COEFFICIENT COMPARISON"
COEFFICIENT COMPARISON

. di "{hline 78}"
------------------------------------------------------------------------------

. di "              qreg            cqreg           diff"
              qreg            cqreg           diff

. di "{hline 60}"
------------------------------------------------------------

. di "mpg:   " %14.8f qreg_b[1,1] "  " %14.8f cqreg_b[1,1] "  " %14.8f qreg_b[1
> ,1]-cqreg_b[1,1]
mpg:    -135.66666667   -135.66666667      0.00000000

. di "_cons: " %14.8f qreg_b[1,2] "  " %14.8f cqreg_b[1,2] "  " %14.8f qreg_b[1
> ,2]-cqreg_b[1,2]
_cons:  8088.66666667   8088.66666667     -0.00000000

. 
. di _newline "{hline 78}"

------------------------------------------------------------------------------

. di "STANDARD ERROR COMPARISON"
STANDARD ERROR COMPARISON

. di "{hline 78}"
------------------------------------------------------------------------------

. di "              qreg            cqreg           diff"
              qreg            cqreg           diff

. di "{hline 60}"
------------------------------------------------------------

. di "mpg:   " %14.8f sqrt(qreg_V[1,1]) "  " %14.8f sqrt(cqreg_V[1,1]) "  " %14
> .8f sqrt(qreg_V[1,1])-sqrt(cqreg_V[1,1])
mpg:      67.26576464     44.23961640     23.02614824

. di "_cons: " %14.8f sqrt(qreg_V[2,2]) "  " %14.8f sqrt(cqreg_V[2,2]) "  " %14
> .8f sqrt(qreg_V[2,2])-sqrt(cqreg_V[2,2])
_cons:  1483.80805190    975.87679819    507.93125372

. 
. di _newline "{hline 78}"

------------------------------------------------------------------------------

. di "SCALAR COMPARISON"
SCALAR COMPARISON

. di "{hline 78}"
------------------------------------------------------------------------------

. di "              qreg            cqreg           diff"
              qreg            cqreg           diff

. di "{hline 60}"
------------------------------------------------------------

. di "sum_adev: " %12.6f `qreg_sum_adev' "  " %12.6f `cqreg_sum_adev' "  " %12.
> 6f `qreg_sum_adev'-`cqreg_sum_adev'
sum_adev: 64760.833333  64760.833333      0.000000

. di "sum_rdev: " %12.6f `qreg_sum_rdev' "  " %12.6f `cqreg_sum_rdev' "  " %12.
> 6f `qreg_sum_rdev'-`cqreg_sum_rdev'
sum_rdev: 71102.500000  71102.500000      0.000000

. di "r2_p:     " %12.8f `qreg_r2_p' "  " %12.8f `cqreg_r2_p' "  " %12.8f `qreg
> _r2_p'-`cqreg_r2_p'
r2_p:       0.08919049    0.08919049    0.00000000

. di "q_v:      " %12.6f `qreg_q_v' "  " %12.6f `cqreg_q_v' "  " %12.6f `qreg_q
> _v'-`cqreg_q_v'
q_v:       4934.000000   5006.500000    -72.500000

. 
end of do-file
