
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do debug_vce.do 

. * Debug VCE computation
. clear all

. set more off

. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. 
. sysuse auto, clear
(1978 automobile data)

. 
. * Run qreg
. qreg price mpg weight

Iteration 1:  WLS sum of weighted deviations =  70138.152

Iteration 1:  Sum of abs. weighted deviations =  70902.418
Iteration 2:  Sum of abs. weighted deviations =  65029.141
Iteration 3:  Sum of abs. weighted deviations =  64107.449
Iteration 4:  Sum of abs. weighted deviations =  64104.978

Median regression                                   Number of obs =         74
  Raw sum of deviations  71102.5 (about 4934)
  Min sum of deviations 64104.98                    Pseudo R2     =     0.0984

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -64.08696   121.1579    -0.53   0.598    -305.6689    177.4949
      weight |   .5782609   .9019106     0.64   0.523    -1.220098     2.37662
       _cons |       4812    5058.39     0.95   0.345    -5274.142    14898.14
------------------------------------------------------------------------------

. matrix V_qreg = e(V)

. di "qreg VCE:"
qreg VCE:

. matrix list V_qreg

symmetric V_qreg[3,3]
               mpg      weight       _cons
   mpg   14679.225
weight   88.202869   .81344281
 _cons  -578952.82  -4334.6403    25587305

. 
. di ""


. di "qreg sparsity = " e(sparsity)
qreg sparsity = 7070.7593

. di "qreg N = " e(N)
qreg N = 74

. 
. * Compute (X'X)^(-1)
. matrix accum XtX = mpg weight
(obs=74)

. matrix XtX_inv = syminv(XtX)

. di ""


. di "(X'X)^(-1):"
(X'X)^(-1):

. matrix list XtX_inv

symmetric XtX_inv[3,3]
               mpg      weight       _cons
   mpg   .00117444
weight   7.057e-06   6.508e-08
 _cons  -.04632027   -.0003468    2.047163

. 
. * What scale does qreg use?
. * V = scale * (X'X)^(-1)
. * scale = V[1,1] / XtX_inv[1,1]
. local scale = V_qreg[1,1] / XtX_inv[1,1]

. di ""


. di "Implied scale = " `scale'
Implied scale = 12498909

. 
. * What should scale be according to formula?
. * scale = sparsity^2 * q*(1-q) / n
. local expected_scale = e(sparsity)^2 * 0.25 / 74

. di "Expected scale (sparsity^2 * 0.25 / 74) = " `expected_scale'
Expected scale (sparsity^2 * 0.25 / 74) = 168904.18

. 
. * Ratio
. di "Ratio = " `scale' / `expected_scale'
Ratio = 74

. 
end of do-file
