
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_cqreg_sparsity.do 

. * Compare sparsity estimation between qreg and cqreg
. clear all

. set more off

. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. 
. sysuse auto, clear
(1978 automobile data)

. 
. * Run qreg and check all e() returns
. qreg price mpg weight

Iteration 1:  WLS sum of weighted deviations =  70138.152

Iteration 1:  Sum of abs. weighted deviations =  70902.418
Iteration 2:  Sum of abs. weighted deviations =  65029.141
Iteration 3:  Sum of abs. weighted deviations =  64107.449
Iteration 4:  Sum of abs. weighted deviations =  64104.978

Median regression                                   Number of obs =         74
  Raw sum of deviations  71102.5 (about 4934)
  Min sum of deviations 64104.98                    Pseudo R2     =     0.0984

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -64.08696   121.1579    -0.53   0.598    -305.6689    177.4949
      weight |   .5782609   .9019106     0.64   0.523    -1.220098     2.37662
       _cons |       4812    5058.39     0.95   0.345    -5274.142    14898.14
------------------------------------------------------------------------------

. ereturn list

scalars:
               e(rank) =  3
           e(sparsity) =  7070.759285184139
             e(bwidth) =  .2314152371765856
               e(df_m) =  2
               e(df_r) =  71
                e(f_r) =  .0001414275270402
                  e(N) =  74
              e(sum_w) =  74
                e(q_v) =  4934
                  e(q) =  .5
           e(sum_rdev) =  71102.5
           e(sum_adev) =  64104.97826086958
           e(convcode) =  0
               e(r2_p) =  .0984145668454756

macros:
                e(cmd) : "qreg"
            e(cmdline) : "qreg price mpg weight"
            e(predict) : "qreg_p"
         e(properties) : "b V"
       e(marginsnotok) : "stdp stddp residuals"
                e(vce) : "iid"
          e(denmethod) : "fitted"
           e(bwmethod) : "hsheather"
             e(depvar) : "price"

matrices:
                  e(b) :  1 x 3
                  e(V) :  3 x 3

functions:
             e(sample)   

. 
. * What is the qreg sparsity?
. di "qreg sparsity = " e(sparsity)
qreg sparsity = 7070.7593

. di "qreg bandwidth = " e(bwidth)
qreg bandwidth = .23141524

. 
. * Our cqreg
. cqreg price mpg weight, verbose

------------------------------------------------------------
cqreg: C-Accelerated Quantile Regression
------------------------------------------------------------
Quantile:   .5
Depvar:     price
Indepvars:   mpg weight
Obs:        74
VCE type:   iid
Bandwidth:  Hall-Sheather
------------------------------------------------------------

cqreg: entering C plugin
cqreg: reading scalars
cqreg: N=%d, K=%d, G=%d
cqreg: N=74, K=3, G=0, quantile=0.500
cqreg: creating state
cqreg: state created successfully
cqreg: loading data
cqreg: data loaded
cqreg debug: y[0..2] = 4099.00, 4749.00, 3799.00
cqreg debug: X[0,0..2] = 22.00, 17.00, 22.00
cqreg: setting up IPM solver
cqreg: creating IPM state
cqreg: solving quantile regression (IRLS)
IRLS: starting
Cholesky input A:
  row 0: 3.601e+04 4.494e+06 1576
  row 1: 4.494e+06 7.188e+08 2.234e+05
  row 2: 1576 2.234e+05 74
j=0: A[j,j]=3.601e+04, sum starts at 3.601e+04
  final sum=3.601e+04
  L[j,j]=189.8
  L[1,0]=2.368e+04
  L[2,0]=8.305
j=1: A[j,j]=7.188e+08, sum starts at 7.188e+08
  k=0: Ljk=A[1,0]=2.368e+04, Ljk^2=5.608e+08
  final sum=1.58e+08
  L[j,j]=1.257e+04
  L[2,1]=2.129
j=2: A[j,j]=74, sum starts at 74
  k=0: Ljk=A[2,0]=8.305, Ljk^2=68.98
  k=1: Ljk=A[2,1]=2.129, Ljk^2=4.533
  final sum=0.4885
  L[j,j]=0.6989
IRLS init: beta=-49.51,1.747,1946
IRLS iter 0: obj=7.277e+04
IRLS iter 0: beta=-64.64,1.337,3305
IRLS iter 1: beta=-68.3,1.218,3658
IRLS iter 2: beta=-72.24,0.9842,4254
IRLS iter 10: obj=6.411e+04
IRLS iter 20: obj=6.411e+04
IRLS iter 30: obj=6.411e+04
IRLS converged at iter 31, obj=6.411e+04
IRLS final: beta=-65.5408,0.564606,4888.74
cqreg: IPM solved
cqreg debug: beta = -65.5408, 0.5646, 4888.7449
cqreg: IPM: iterations=32, converged=1, objective=64105.6208, time=0.000s
cqreg: computing VCE
cqreg: Sparsity: 4926.8521, bandwidth: 0.225182
VCE_IID: starting
VCE_IID: XtX_inv[0,0]=0.001174, sparsity=4927, q=0.5
VCE_IID: scale=82006.3
VCE_IID: V[0,0]=96.31, V[1,1]=0.005337, V[2,2]=1.679e+05
cqreg: VCE done
cqreg: storing results
cqreg: Total time: 0.001s (load: 0.001, hdfe: 0.000, ipm: 0.000, vce: 0.000)

    .5 Quantile regression                      Number of obs     =         74
                                                Min sum of deviations=      641
> 06
                                                Sparsity          =  4926.8521

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -65.54083   9.813845    -6.68   0.000    -85.10908   -45.97258
      weight |   .5646059   .0730552     7.73   0.000      .418938    .7102738
       _cons |   4888.745    409.732    11.93   0.000     4071.762    5705.727
------------------------------------------------------------------------------

IPM iterations: 32, converged: yes
Total time:         0.001 seconds

. di "cqreg sparsity = " e(sparsity)
cqreg sparsity = 4926.8521

. di "cqreg bandwidth = " e(bwidth)
cqreg bandwidth = .22518185

. 
. * Compare standard errors directly
. di ""


. di "SE comparison:"
SE comparison:

. di "qreg  mpg SE = " sqrt(V_qreg[1,1])
qreg  mpg SE = V_qreg not found
r(111);

end of do-file
r(111);
