
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_debug_density.do 

. * Debug density estimation
. clear all

. set more off

. sysuse auto, clear
(1978 automobile data)

. 
. quietly qreg price mpg, quantile(0.5) vce(robust)

. display "qreg robust:"
qreg robust:

. display "  bwidth = " e(bwidth)
  bwidth = .23141524

. display "  N = " e(N)
  N = 74

. 
. * Get the residuals
. predict resid, residuals

. summarize resid, detail

                          Residuals
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -2084.333      -2084.333
 5%        -1556      -1636.667
10%        -1275      -1586.667       Obs                  74
25%         -778          -1556       Sum of wgt.          74

50%            0                      Mean           965.9234
                        Largest       Std. dev.      2673.188
75%     1773.333       7133.333
90%         5038       7276.667       Variance        7145936
95%     7133.333       8310.667       Skewness       1.614233
99%     10666.33       10666.33       Kurtosis       5.055555

. 
. * Check how many observations are near 0
. count if abs(resid) < 500
  23

. count if abs(resid) < 1000
  37

. count if abs(resid) < 2000
  56

. 
. * What are the quantiles of residuals?
. _pctile resid, p(25 50 75)

. display "r_25 = " r(r1)
r_25 = -778

. display "r_50 = " r(r2)
r_50 = 0

. display "r_75 = " r(r3)
r_75 = 1773.3334

. 
. * Bandwidth in probability units
. local h = e(bwidth)

. display "h (prob) = " `h'
h (prob) = .23141524

. 
. * q-h and q+h
. local q_lo = 0.5 - `h'

. local q_hi = 0.5 + `h'

. display "q_lo = " `q_lo'
q_lo = .26858476

. display "q_hi = " `q_hi'
q_hi = .73141524

. 
. * Corresponding residual quantiles
. _pctile resid, p(`=`q_lo'*100' `=`q_hi'*100')

. display "r_lo = " r(r1)
r_lo = -756.66669

. display "r_hi = " r(r2)
r_hi = 1326.6666

. 
. local h_resid = (r(r2) - r(r1)) / 2

. display "h_resid = " `h_resid'
h_resid = 1041.6667

. 
. * Density at 0 using this bandwidth
. * f(0) ≈ P(|r| < h_resid) / (2 * h_resid)
. count if abs(resid) < `h_resid'
  39

. local n_near = r(N)

. local f0 = `n_near' / (2 * `h_resid' * 74)

. display "Approx f(0) = " `f0'
Approx f(0) = .00025297

. display "Approx sparsity = " 1/`f0'
Approx sparsity = 3952.9914

. 
end of do-file
