
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do /Users/Mike/Documents/GitHub/stata-ctools/benchmark/test_quantile.do 

. clear all

. set more off

. sysuse auto, clear
(1978 automobile data)

. drop if missing(price, mpg, weight, rep78)
(5 observations deleted)

. 
. qreg price mpg weight, quantile(0.5)

Iteration 1:  WLS sum of weighted deviations =  63341.574

Iteration 1:  Sum of abs. weighted deviations =  63536.156
Iteration 2:  Sum of abs. weighted deviations =  58812.858
Iteration 3:  Sum of abs. weighted deviations =  58491.205
Iteration 4:  Sum of abs. weighted deviations =  58480.736
Iteration 5:  Sum of abs. weighted deviations =  58477.095
Iteration 6:  Sum of abs. weighted deviations =  58466.957

Median regression                                   Number of obs =         69
  Raw sum of deviations    65163 (about 5079)
  Min sum of deviations 58466.96                    Pseudo R2     =     0.1028

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -64.08696   121.1752    -0.53   0.599    -306.0211    177.8472
      weight |   .5782609    .896591     0.64   0.521    -1.211841    2.368363
       _cons |       4812   5051.627     0.95   0.344    -5273.898     14897.9
------------------------------------------------------------------------------

. predict double resid, resid

. 
. * Count basis observations with same threshold
. gen byte basis = abs(resid) < 1e-8

. count if basis
  3

. local n_basis = r(N)

. local N_full = _N

. local N_adj = _N - `n_basis'

. 
. display "N = " `N_full'
N = 69

. display "Basis obs = " `n_basis'
Basis obs = 3

. display "N_adj = " `N_adj'
N_adj = 66

. 
. * Compute bandwidth
. local tau = 0.5

. local alpha = 0.05

. local z_alpha = invnormal(1 - `alpha'/2)

. local z_tau = invnormal(`tau')

. local phi_tau = normalden(`z_tau')

. local h = `N_adj'^(-1/3) * `z_alpha'^(2/3) * ((1.5 * `phi_tau'^2) / (2*`z_tau
> '^2 + 1))^(1/3)

. 
. display "h = " %12.8f `h'
h =   0.24041112

. 
. * Compute residual quantiles at tau ± h, excluding basis
. local q_lo = `tau' - `h'

. local q_hi = `tau' + `h'

. display "q_lo = " %12.8f `q_lo'
q_lo =   0.25958888

. display "q_hi = " %12.8f `q_hi'
q_hi =   0.74041112

. 
. _pctile resid if !basis, percentile(`=`q_lo'*100' `=`q_hi'*100')

. local r_lo = r(r1)

. local r_hi = r(r2)

. display "r_lo = " %12.6f `r_lo'
r_lo =  -731.000000

. display "r_hi = " %12.6f `r_hi'
r_hi =  1617.000000

. 
. local sparsity = (`r_hi' - `r_lo') / (2 * `h')

. display "Sparsity = " %12.4f `sparsity'
Sparsity =    4883.3016

. 
. * List the non-basis residuals sorted
. sort resid

. list resid if !basis in 1/5

     +------------+
     |      resid |
     |------------|
  1. | -1875.7391 |
  2. | -1730.1739 |
  3. | -1622.7826 |
  4. | -1524.0435 |
  5. | -1478.4348 |
     +------------+

. list resid if !basis in -5/l

     +-----------+
     |     resid |
     |-----------|
 65. | 6439.3913 |
 66. | 6821.6522 |
 67. | 7336.4783 |
 68. |      8330 |
 69. |  9959.087 |
     +-----------+

. 
. * Also show the specific quantiles
. local idx_lo = round(`N_adj' * `q_lo')

. local idx_hi = round(`N_adj' * `q_hi')

. display "Index for q_lo (0-based): " `idx_lo'
Index for q_lo (0-based): 17

. display "Index for q_hi (0-based): " `idx_hi'
Index for q_hi (0-based): 49

. 
end of do-file
