
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_ipm.do 

. * Test IPM implementation
. clear all

. set more off

. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. 
. sysuse auto, clear
(1978 automobile data)

. 
. di _newline



. di as text "{hline 70}"
----------------------------------------------------------------------

. di as text "Testing IPM implementation: cqreg vs qreg (median regression)"
Testing IPM implementation: cqreg vs qreg (median regression)

. di as text "{hline 70}"
----------------------------------------------------------------------

. 
. * Run qreg
. di _newline



. di as result "=== Stata's qreg ===" _newline
=== Stata's qreg ===


. qreg price mpg weight, nolog

Median regression                                   Number of obs =         74
  Raw sum of deviations  71102.5 (about 4934)
  Min sum of deviations 64104.98                    Pseudo R2     =     0.0984

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -64.08696   121.1579    -0.53   0.598    -305.6689    177.4949
      weight |   .5782609   .9019106     0.64   0.523    -1.220098     2.37662
       _cons |       4812    5058.39     0.95   0.345    -5274.142    14898.14
------------------------------------------------------------------------------

. matrix b_qreg = e(b)

. 
. * Run cqreg
. di _newline



. di as result "=== ctools cqreg (IPM) ===" _newline
=== ctools cqreg (IPM) ===


. cqreg price mpg weight

    .5 Quantile regression                      Number of obs     =         74
                                                Min sum of deviations=      641
> 05
                                                Sparsity          =  4939.0092

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -64.08695    84.6302    -0.76   0.451    -232.8348    104.6609
      weight |   .5782609   .6299953     0.92   0.362     -.677914    1.834436
       _cons |       4812   3533.345     1.36   0.178     -2233.29    11857.29
------------------------------------------------------------------------------

. matrix b_cqreg = e(b)

. 
. * Compare
. di _newline



. di as text "{hline 70}"
----------------------------------------------------------------------

. di as text "Coefficient Comparison:"
Coefficient Comparison:

. di as text "{hline 70}"
----------------------------------------------------------------------

. di as text "Variable     " _col(20) "qreg" _col(35) "cqreg" _col(50) "Diff"
Variable           qreg           cqreg          Diff

. 
. local names : colnames b_qreg

. local i = 1

. local max_diff = 0

. foreach v of local names {
  2.     local diff = b_cqreg[1,`i'] - b_qreg[1,`i']
  3.     local abs_diff = abs(`diff')
  4.     if `abs_diff' > `max_diff' {
  5.         local max_diff = `abs_diff'
  6.     }
  7.     di as text "`v'" _col(20) as result %12.6f b_qreg[1,`i'] _col(35) as r
> esult %12.6f b_cqreg[1,`i'] _col(50) as result %12.6f `diff'
  8.     local i = `i' + 1
  9. }
mpg                  -64.086957     -64.086954       0.000003
weight                 0.578261       0.578261      -0.000000
_cons               4812.000000    4811.999965      -0.000035

. 
. di _newline



. di as text "{hline 70}"
----------------------------------------------------------------------

. di as text "Maximum absolute difference: " as result %g `max_diff'
Maximum absolute difference: invalid %format
r(120);

end of do-file
r(120);
