
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_debug_blas.do 

. clear all

. set more off

. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. sysuse auto, clear
(1978 automobile data)

. 
. display "============================================================"
============================================================

. display "Debug: Testing cqreg with fitted method (Siddiqui)"
Debug: Testing cqreg with fitted method (Siddiqui)

. display "============================================================"
============================================================

. 
. * Test 1: qreg default
. display ""


. display "=== qreg default ==="
=== qreg default ===

. quietly qreg price mpg

. display "Coefficient: " _b[mpg]
Coefficient: -135.66667

. display "SE: " _se[mpg]
SE: 67.265765

. display "Sparsity: " e(sparsity)
Sparsity: 6650.0766

. 
. * Test 2: cqreg with fitted method (should use Siddiqui)
. display ""


. display "=== cqreg with fitted method ==="
=== cqreg with fitted method ===

. cqreg price mpg, verbose

------------------------------------------------------------
cqreg: C-Accelerated Quantile Regression
------------------------------------------------------------
Quantile:   .5
Depvar:     price
Indepvars:   mpg
Obs:        74
VCE type:   iid
Density:    fitted
Bandwidth:  Hall-Sheather
------------------------------------------------------------

cqreg: N=74, K=2, G=0, quantile=0.500
cqreg: IPM: iterations=11, converged=1, objective=64760.8333, time=0.000s
cqreg: Sparsity: 6650.0766, bandwidth: 0.231415 (method: fitted)
cqreg: Total time: 0.001s (load: 0.001, hdfe: 0.000, ipm: 0.000, vce: 0.000)

Median regression                                  Number of obs =         74
  Raw sum of deviations 71102.5  (about 5006.5   )
  Min sum of deviations 64760.8                    Pseudo R2     =     0.0892

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -135.6667   67.26576    -2.02   0.047    -269.7585   -1.574816
       _cons |   8088.667   1483.808     5.45   0.000     5130.749    11046.58
------------------------------------------------------------------------------

Iterations: 11, converged: yes
Total time:     0.001 seconds

. display "Coefficient: " _b[mpg]
Coefficient: -135.66667

. display "SE: " _se[mpg]
SE: 67.265765

. display "Sparsity: " e(sparsity)
Sparsity: 6650.0766

. 
. * Test 3: cqreg with residual method
. display ""


. display "=== cqreg with residual method ==="
=== cqreg with residual method ===

. cqreg price mpg, denmethod(residual) verbose

------------------------------------------------------------
cqreg: C-Accelerated Quantile Regression
------------------------------------------------------------
Quantile:   .5
Depvar:     price
Indepvars:   mpg
Obs:        74
VCE type:   iid
Density:    residual
Bandwidth:  Hall-Sheather
------------------------------------------------------------

cqreg: N=74, K=2, G=0, quantile=0.500
cqreg: IPM: iterations=11, converged=1, objective=64760.8333, time=0.000s
cqreg: Sparsity: 4460.3651, bandwidth: 0.233538 (method: residual)
cqreg: Total time: 0.000s (load: 0.000, hdfe: 0.000, ipm: 0.000, vce: 0.000)

Median regression                                  Number of obs =         74
  Raw sum of deviations 71102.5  (about 5006.5   )
  Min sum of deviations 64760.8                    Pseudo R2     =     0.0892

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -135.6667   45.11675    -3.01   0.004    -225.6053   -45.72806
       _cons |   8088.667   995.2255     8.13   0.000     6104.721    10072.61
------------------------------------------------------------------------------

Iterations: 11, converged: yes
Total time:     0.001 seconds

. display "Coefficient: " _b[mpg]
Coefficient: -135.66667

. display "SE: " _se[mpg]
SE: 45.116754

. display "Sparsity: " e(sparsity)
Sparsity: 4460.3651

. 
. display ""


. display "============================================================"
============================================================

. display "If fitted sparsity != 6650.08, the Siddiqui method is failing"
If fitted sparsity != 6650.08, the Siddiqui method is failing

. display "============================================================"
============================================================

. 
end of do-file
