
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_crash.do 

. * Test FN solver crash at various sizes
. clear all

. set more off

. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. 
. di "{hline 50}"
--------------------------------------------------

. di "Testing FN Solver Stability"
Testing FN Solver Stability

. di "{hline 50}"
--------------------------------------------------

. 
. foreach n in 1000 2000 3000 4000 5000 {
  2.     clear
  3.     set seed 12345
  4.     set obs `n'
  5.     gen x1 = rnormal()
  6.     gen x2 = rnormal()
  7.     gen y = 1 + 2*x1 - x2 + rnormal()*2
  8. 
.     di _newline "Testing N=`n'..."
  9. 
.     * Try running cqreg
.     capture noisily cqreg y x1 x2
 10. 
.     if _rc == 0 {
 11.         di "  SUCCESS at N=`n'"
 12.         matrix list e(b)
 13.     }
 14.     else {
 15.         di "  FAILED at N=`n' with rc=" _rc
 16.     }
 17. }
Number of observations (_N) was 0, now 1,000.

Testing N=1000...

    .5 Quantile regression                      Number of obs     =      1,000
                                                Min sum of deviations=      781
> .5
                                                Sparsity          =     4.9674

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          x1 |   2.000693   .0770049    25.98   0.000     1.849583    2.151803
          x2 |  -1.086567   .0783319   -13.87   0.000    -1.240282    -.932853
       _cons |   1.067848   .0786721    13.57   0.000     .9134665     1.22223
------------------------------------------------------------------------------
  SUCCESS at N=1000

e(b)[1,3]
            x1          x2       _cons
y1   2.0006929  -1.0865674   1.0678484
Number of observations (_N) was 0, now 2,000.

Testing N=2000...

    .5 Quantile regression                      Number of obs     =      2,000
                                                Min sum of deviations=       15
> 41
                                                Sparsity          =     4.8169

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          x1 |   2.014849    .053229    37.85   0.000     1.910459    2.119239
          x2 |  -.9692735   .0549397   -17.64   0.000    -1.077019   -.8615283
       _cons |   .9584878   .0538936    17.78   0.000     .8527943    1.064181
------------------------------------------------------------------------------
  SUCCESS at N=2000

e(b)[1,3]
            x1          x2       _cons
y1   2.0148492  -.96927354   .95848781
Number of observations (_N) was 0, now 3,000.

Testing N=3000...

    .5 Quantile regression                      Number of obs     =      3,000
                                                Min sum of deviations=       24
> 21
                                                Sparsity          =     5.5549

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          x1 |   2.023108   .0507646    39.85   0.000     1.923571    2.122645
          x2 |  -1.069402   .0517326   -20.67   0.000    -1.170837   -.9679669
       _cons |   1.038786   .0507337    20.48   0.000     .9393101    1.138263
------------------------------------------------------------------------------
  SUCCESS at N=3000

e(b)[1,3]
            x1          x2       _cons
y1   2.0231081  -1.0694019   1.0387865
Number of observations (_N) was 0, now 4,000.

Testing N=4000...

    .5 Quantile regression                      Number of obs     =      4,000
                                                Min sum of deviations=       32
> 05
                                                Sparsity          =     5.1081

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          x1 |   2.012937   .0405273    49.67   0.000      1.93348    2.092393
          x2 |  -.9786701   .0403303   -24.27   0.000     -1.05774   -.8996003
       _cons |   1.013766   .0403903    25.10   0.000     .9345785    1.092954
------------------------------------------------------------------------------
  SUCCESS at N=4000

e(b)[1,3]
            x1          x2       _cons
y1   2.0129366  -.97867008   1.0137661
Number of observations (_N) was 0, now 5,000.

Testing N=5000...

    .5 Quantile regression                      Number of obs     =      5,000
                                                Min sum of deviations=       39
> 97
                                                Sparsity          =     5.0365

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          x1 |   1.963616   .0359669    54.60   0.000     1.893105    2.034127
          x2 |  -.9849055   .0354999   -27.74   0.000    -1.054501   -.9153101
       _cons |   1.008324   .0356231    28.31   0.000      .938487    1.078161
------------------------------------------------------------------------------
  SUCCESS at N=5000

e(b)[1,3]
            x1          x2       _cons
y1   1.9636158  -.98490552   1.0083239

. 
. di _newline "All tests complete"

All tests complete

. 
end of do-file
