
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do /Users/Mike/Documents/GitHub/stata-ctools/benchmark/test_robust_nocapture.
> do 

. clear all

. set more off

. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. sysuse auto, clear
(1978 automobile data)

. drop if missing(price, mpg, weight, rep78)
(5 observations deleted)

. 
. display "=== ROBUST VCE ===" 
=== ROBUST VCE ===

. quietly qreg price mpg weight, quantile(0.5) vce(robust)

. local se_mpg_qreg = _se[mpg]

. local se_wt_qreg = _se[weight]

. 
. display "qreg vce(robust):"
qreg vce(robust):

. display "  SE[mpg] = " %12.6f `se_mpg_qreg'
  SE[mpg] =    69.165112

. display "  SE[weight] = " %12.6f `se_wt_qreg'
  SE[weight] =     0.725288

. 
. quietly cqreg price mpg weight, quantile(0.5) vce(robust)

. local se_mpg_cqreg = _se[mpg]

. local se_wt_cqreg = _se[weight]

. 
. display _n "cqreg vce(robust):"

cqreg vce(robust):

. display "  SE[mpg] = " %12.6f `se_mpg_cqreg'
  SE[mpg] =     0.000208

. display "  SE[weight] = " %12.6f `se_wt_cqreg'
  SE[weight] =     0.000004

. 
. display _n "Ratios (cqreg/qreg):"

Ratios (cqreg/qreg):

. display "  mpg: " %8.4f (`se_mpg_cqreg'/`se_mpg_qreg')
  mpg:   0.0000

. display "  weight: " %8.4f (`se_wt_cqreg'/`se_wt_qreg')
  weight:   0.0000

. 
end of do-file
