
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_qreg_vce.do 

. clear all

. set more off

. sysuse auto, clear
(1978 automobile data)

. drop if missing(price, mpg, weight, rep78)
(5 observations deleted)

. 
. * Try different VCE options in qreg to understand the formula
. display "=== QREG WITH DIFFERENT VCE OPTIONS ==="
=== QREG WITH DIFFERENT VCE OPTIONS ===

. 
. qreg price mpg weight, quantile(0.5)

Iteration 1:  WLS sum of weighted deviations =  63341.574

Iteration 1:  Sum of abs. weighted deviations =  63536.156
Iteration 2:  Sum of abs. weighted deviations =  58812.858
Iteration 3:  Sum of abs. weighted deviations =  58491.205
Iteration 4:  Sum of abs. weighted deviations =  58480.736
Iteration 5:  Sum of abs. weighted deviations =  58477.095
Iteration 6:  Sum of abs. weighted deviations =  58466.957

Median regression                                   Number of obs =         69
  Raw sum of deviations    65163 (about 5079)
  Min sum of deviations 58466.96                    Pseudo R2     =     0.1028

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -64.08696   121.1752    -0.53   0.599    -306.0211    177.8472
      weight |   .5782609    .896591     0.64   0.521    -1.211841    2.368363
       _cons |       4812   5051.627     0.95   0.344    -5273.898     14897.9
------------------------------------------------------------------------------

. matrix V_iid = e(V)

. display "IID SE[mpg]: " %12.6f sqrt(V_iid[1,1])
IID SE[mpg]:   121.175244

. 
. * Try with vce(robust)
. qreg price mpg weight, quantile(0.5) vce(robust)

Iteration 1:  WLS sum of weighted deviations =  63341.574

Iteration 1:  Sum of abs. weighted deviations =  63536.156
Iteration 2:  Sum of abs. weighted deviations =  58812.858
Iteration 3:  Sum of abs. weighted deviations =  58491.205
Iteration 4:  Sum of abs. weighted deviations =  58480.736
Iteration 5:  Sum of abs. weighted deviations =  58477.095
Iteration 6:  Sum of abs. weighted deviations =  58466.957

Median regression                                   Number of obs =         69
  Raw sum of deviations    65163 (about 5079)
  Min sum of deviations 58466.96                    Pseudo R2     =     0.1028

------------------------------------------------------------------------------
             |               Robust
       price | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -64.08696   69.16511    -0.93   0.358    -202.1796    74.00565
      weight |   .5782609   .7252879     0.80   0.428    -.8698231    2.026345
       _cons |       4812   3281.768     1.47   0.147     -1740.26    11364.26
------------------------------------------------------------------------------

. matrix V_robust = e(V)

. display "Robust SE[mpg]: " %12.6f sqrt(V_robust[1,1])
Robust SE[mpg]:    69.165112

. 
. * Try with bootstrap
. qreg price mpg weight, quantile(0.5) vce(boot, reps(100))
option vce( boot) is not allowed
r(198);

end of do-file
r(198);
