
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_fn_stable.do 

. * Test FN solver stability
. clear all

. set more off

. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. 
. di "Testing FN solver stability..."
Testing FN solver stability...

. 
. set seed 12345

. set obs 1000
Number of observations (_N) was 0, now 1,000.

. gen x1 = rnormal()

. gen x2 = rnormal()

. gen y = 1 + 2*x1 - x2 + rnormal()*2

. 
. quietly qreg y x1 x2

. matrix b_qreg = e(b)

. 
. cqreg y x1 x2, verbose

------------------------------------------------------------
cqreg: C-Accelerated Quantile Regression
------------------------------------------------------------
Quantile:   .5
Depvar:     y
Indepvars:   x1 x2
Obs:        1000
VCE type:   iid
Bandwidth:  Hall-Sheather
------------------------------------------------------------

cqreg: N=1000, K=3, G=0, quantile=0.500
FN iter 1: ||Xg||=2.80e+01, stall=0
FN iter 2: ||Xg||=2.50e+01, stall=0
FN iter 3: ||Xg||=1.93e+01, stall=0
FN iter 4: ||Xg||=1.73e+01, stall=0
FN iter 5: ||Xg||=1.50e+01, stall=0
FN iter 6: ||Xg||=1.32e+01, stall=0
FN iter 7: ||Xg||=8.95e+00, stall=0
FN iter 8: ||Xg||=8.95e+00, stall=1
FN iter 9: ||Xg||=8.95e+00, stall=2
FN iter 10: ||Xg||=8.95e+00, stall=3
FN iter 11: ||Xg||=8.18e+00, stall=0
FN iter 21: ||Xg||=1.88e+00, stall=5
FN converged after 26 iters, ||Xg||=1.88e+00
FN finished: 25 iters, cleaning up...
FN cleanup done
cqreg: IPM: iterations=25, converged=1, objective=781.5314, time=0.000s
cqreg: Sparsity: 4.9674, bandwidth: 0.094539
cqreg: Total time: 0.001s (load: 0.001, hdfe: 0.000, ipm: 0.000, vce: 0.000)

    .5 Quantile regression                      Number of obs     =      1,000
                                                Min sum of deviations=      781
> .5
                                                Sparsity          =     4.9674

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          x1 |   2.000693   .0769827    25.99   0.000     1.849626     2.15176
          x2 |  -1.086567   .0781947   -13.90   0.000    -1.240012   -.9331222
       _cons |   1.067848   .0785407    13.60   0.000     .9137244    1.221973
------------------------------------------------------------------------------

IPM iterations: 25, converged: yes
Total time:         0.001 seconds

. matrix b_cqreg = e(b)

. 
. di _newline "Results:"

Results:

. di "qreg:  " %9.6f b_qreg[1,1] "  " %9.6f b_qreg[1,2] "  " %9.6f b_qreg[1,3]
qreg:   1.995117  -1.095791   1.082248

. di "cqreg: " %9.6f b_cqreg[1,1] "  " %9.6f b_cqreg[1,2] "  " %9.6f b_cqreg[1,
> 3]
cqreg:  2.000693  -1.086567   1.067848

. 
. local diff = max(abs(b_qreg[1,1]-b_cqreg[1,1]), abs(b_qreg[1,2]-b_cqreg[1,2])
> , abs(b_qreg[1,3]-b_cqreg[1,3]))

. di "Max diff: " `diff'
Max diff: .01439974

. 
end of do-file
