
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_scaling.do 

. * Scaling benchmark for cqreg
. clear all

. set more off

. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. 
. di "{hline 60}"
------------------------------------------------------------

. di "cqreg vs qreg Scaling Benchmark"
cqreg vs qreg Scaling Benchmark

. di "{hline 60}"
------------------------------------------------------------

. 
. * Test at multiple sizes
. foreach N in 5000 10000 25000 50000 {
  2.     clear
  3.     set seed 12345
  4.     set obs `N'
  5.     quietly {
  6.         gen x1 = rnormal()
  7.         gen x2 = rnormal()
  8.         gen x3 = rnormal()
  9.         gen y = 1 + 2*x1 - x2 + 0.5*x3 + rnormal()*2
 10.     }
 11. 
.     * qreg
.     timer clear 1
 12.     timer on 1
 13.     quietly qreg y x1 x2 x3
 14.     timer off 1
 15.     quietly timer list 1
 16.     local qreg_time = r(t1)
 17. 
.     * cqreg
.     timer clear 2
 18.     timer on 2
 19.     quietly cqreg y x1 x2 x3
 20.     timer off 2
 21.     quietly timer list 2
 22.     local cqreg_time = r(t2)
 23. 
.     local speedup = `qreg_time' / `cqreg_time'
 24. 
.     di "N=" %6.0fc `N' "  qreg=" %6.3f `qreg_time' "s  cqreg=" %6.3f `cqreg_t
> ime' "s  speedup=" %5.2f `speedup' "x"
 25. }
Number of observations (_N) was 0, now 5,000.
N= 5,000  qreg= 0.058s  cqreg= 0.012s  speedup= 4.83x
