
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do /Users/Mike/Documents/GitHub/stata-ctools/benchmark/test_multi_quantiles.d
> o 

. clear all

. set more off

. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. sysuse auto, clear
(1978 automobile data)

. drop if missing(price, mpg, weight, rep78)
(5 observations deleted)

. 
. display "============================================="
=============================================

. display "TESTING CQREG VS QREG VCE(IID, RESIDUAL)"
TESTING CQREG VS QREG VCE(IID, RESIDUAL)

. display "ACROSS MULTIPLE QUANTILES"
ACROSS MULTIPLE QUANTILES

. display "============================================="
=============================================

. display ""


. display "      q      SE[mpg]_qreg  SE[mpg]_cqreg     ratio"
      q      SE[mpg]_qreg  SE[mpg]_cqreg     ratio

. display "  -------  ------------  -------------  ---------"
  -------  ------------  -------------  ---------

. 
. local all_match = 1

. 
. foreach q in 0.10 0.25 0.50 0.75 0.90 {
  2.     quietly qreg price mpg weight, quantile(`q') vce(iid, residual)
  3.     local se_qreg = _se[mpg]
  4.     
.     quietly cqreg price mpg weight, quantile(`q')
  5.     local se_cqreg = _se[mpg]
  6.     
.     local ratio = `se_cqreg' / `se_qreg'
  7.     
.     display "   " %4.2f `q' "     " %12.4f `se_qreg' "   " %12.4f `se_cqreg' 
> "    " %8.6f `ratio'
  8.     
.     if abs(`ratio' - 1.0) > 0.001 {
  9.         local all_match = 0
 10.     }
 11. }
   0.10          56.0383        56.0383    1.000000
   0.25          49.3639        49.3639    1.000000
   0.50          85.1761        85.1761    1.000000
   0.75         161.2620       161.2620    1.000000
   0.90         151.8282       151.8282    1.000000

. 
. display ""


. if `all_match' {
.     display "{result}SUCCESS: All quantiles match within 0.1%{txt}"
SUCCESS: All quantiles match within 0.1%
. }

. else {
.     display "{error}WARNING: Some quantiles differ by more than 0.1%{txt}"
. }

. 
. display ""


. display "============================================="
=============================================

. display "TESTING WITH LARGER DATASET (nlsw88)"
TESTING WITH LARGER DATASET (nlsw88)

. display "============================================="
=============================================

. 
. sysuse nlsw88, clear
(NLSW, 1988 extract)

. drop if missing(wage, ttl_exp, tenure, grade)
(17 observations deleted)

. 
. display ""


. display "      q      SE[exp]_qreg  SE[exp]_cqreg     ratio"
      q      SE[exp]_qreg  SE[exp]_cqreg     ratio

. display "  -------  ------------  -------------  ---------"
  -------  ------------  -------------  ---------

. 
. foreach q in 0.10 0.25 0.50 0.75 0.90 {
  2.     quietly qreg wage ttl_exp tenure grade, quantile(`q') vce(iid, residua
> l)
  3.     local se_qreg = _se[ttl_exp]
  4.     
.     quietly cqreg wage ttl_exp tenure grade, quantile(`q')
  5.     local se_cqreg = _se[ttl_exp]
  6.     
.     local ratio = `se_cqreg' / `se_qreg'
  7.     
.     display "   " %4.2f `q' "     " %12.6f `se_qreg' "   " %12.6f `se_cqreg' 
> "    " %8.6f `ratio'
  8. }
   0.10         0.014402       0.014402    1.000000
   0.25         0.013854       0.013854    1.000000
   0.50         0.018618       0.018618    1.000000
   0.75         0.028915       0.028915    1.000000
   0.90         0.059482       0.059482    1.000000

. 
. display ""


. display "============================================="
=============================================

. 
end of do-file
