
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_residual.do 

. clear all

. set more off

. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. sysuse auto, clear
(1978 automobile data)

. drop if missing(price, mpg, weight, rep78)
(5 observations deleted)

. 
. * Run qreg with default (fitted) method
. qreg price mpg weight, quantile(0.5)

Iteration 1:  WLS sum of weighted deviations =  63341.574

Iteration 1:  Sum of abs. weighted deviations =  63536.156
Iteration 2:  Sum of abs. weighted deviations =  58812.858
Iteration 3:  Sum of abs. weighted deviations =  58491.205
Iteration 4:  Sum of abs. weighted deviations =  58480.736
Iteration 5:  Sum of abs. weighted deviations =  58477.095
Iteration 6:  Sum of abs. weighted deviations =  58466.957

Median regression                                   Number of obs =         69
  Raw sum of deviations    65163 (about 5079)
  Min sum of deviations 58466.96                    Pseudo R2     =     0.1028

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -64.08696   121.1752    -0.53   0.599    -306.0211    177.8472
      weight |   .5782609    .896591     0.64   0.521    -1.211841    2.368363
       _cons |       4812   5051.627     0.95   0.344    -5273.898     14897.9
------------------------------------------------------------------------------

. local se_mpg_fitted = _se[mpg]

. local se_wt_fitted = _se[weight]

. display "=== FITTED METHOD (default) ==="
=== FITTED METHOD (default) ===

. display "SE[mpg]: " %12.6f `se_mpg_fitted'
SE[mpg]:   121.175244

. display "SE[weight]: " %12.6f `se_wt_fitted'
SE[weight]:     0.896591

. 
. * Run qreg with residual method
. qreg price mpg weight, quantile(0.5) vce(iid, residual)

Iteration 1:  WLS sum of weighted deviations =  63341.574

Iteration 1:  Sum of abs. weighted deviations =  63536.156
Iteration 2:  Sum of abs. weighted deviations =  58812.858
Iteration 3:  Sum of abs. weighted deviations =  58491.205
Iteration 4:  Sum of abs. weighted deviations =  58480.736
Iteration 5:  Sum of abs. weighted deviations =  58477.095
Iteration 6:  Sum of abs. weighted deviations =  58466.957

Median regression                                   Number of obs =         69
  Raw sum of deviations    65163 (about 5079)
  Min sum of deviations 58466.96                    Pseudo R2     =     0.1028

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -64.08696   85.17614    -0.75   0.454    -234.1466    105.9727
      weight |   .5782609   .6302291     0.92   0.362    -.6800321    1.836554
       _cons |       4812   3550.875     1.36   0.180     -2277.55    11901.55
------------------------------------------------------------------------------

. local se_mpg_resid = _se[mpg]

. local se_wt_resid = _se[weight]

. display _n "=== RESIDUAL METHOD ==="

=== RESIDUAL METHOD ===

. display "SE[mpg]: " %12.6f `se_mpg_resid'
SE[mpg]:    85.176144

. display "SE[weight]: " %12.6f `se_wt_resid'
SE[weight]:     0.630229

. display "sparsity: " %12.4f e(sparsity)
sparsity:    4883.3016

. display "bandwidth: " %12.8f e(bwidth)
bandwidth:   0.24041112

. 
. * Run cqreg
. cqreg price mpg weight, quantile(0.5)

Median regression                                  Number of obs =         69
  Raw sum of deviations 65163    (about 5079     )
  Min sum of deviations 58467                      Pseudo R2     =     0.1028

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -64.08696   80.22683    -0.80   0.427     -224.265    96.09109
      weight |   .5782609   .5936085     0.97   0.334    -.6069167    1.763438
       _cons |       4812   3344.545     1.44   0.155    -1865.599     11489.6
------------------------------------------------------------------------------

. local se_mpg_cqreg = _se[mpg]

. local se_wt_cqreg = _se[weight]

. display _n "=== CQREG ==="

=== CQREG ===

. display "SE[mpg]: " %12.6f `se_mpg_cqreg'
SE[mpg]:    80.226834

. display "SE[weight]: " %12.6f `se_wt_cqreg'
SE[weight]:     0.593609

. 
. display _n "=== RATIOS (cqreg / qreg) ==="

=== RATIOS (cqreg / qreg) ===

. display "vs fitted method: " %8.4f (`se_mpg_cqreg' / `se_mpg_fitted')
vs fitted method:   0.6621

. display "vs residual method: " %8.4f (`se_mpg_cqreg' / `se_mpg_resid')
vs residual method:   0.9419

. 
end of do-file
