
Running /Users/Mike/Documents/Stata/profile.do ...


. * Simple test of preprocessing algorithm
. clear all

. set more off

. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. 
. di "{hline 60}"
------------------------------------------------------------

. di "Simple preprocessing test"
Simple preprocessing test

. di "{hline 60}"
------------------------------------------------------------

. 
. * Start small
. set seed 12345

. set obs 1000
Number of observations (_N) was 0, now 1,000.

. gen x1 = rnormal()

. gen x2 = rnormal()

. gen x3 = rnormal()

. gen y = 1 + 2*x1 - x2 + 0.5*x3 + rnormal()*2

. 
. di _newline "=== N=1000 ==="

=== N=1000 ===

. 
. di "Running qreg..."
Running qreg...

. timer clear 1

. timer on 1

. qreg y x1 x2 x3, nolog

Median regression                                   Number of obs =      1,000
  Raw sum of deviations 1249.461 (about .95945966)
  Min sum of deviations 794.0363                    Pseudo R2     =     0.3645

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          x1 |   2.058695   .0858926    23.97   0.000     1.890144    2.227247
          x2 |  -1.061034   .0873094   -12.15   0.000    -1.232366   -.8897028
          x3 |   .5395343   .0900432     5.99   0.000     .3628382    .7162304
       _cons |   .9282336   .0876976    10.58   0.000     .7561405    1.100327
------------------------------------------------------------------------------

. timer off 1

. quietly timer list 1

. di "qreg time: " r(t1) "s"
qreg time: .05s

. matrix b_qreg = e(b)

. 
. di _newline "Running cqreg with verbose..."

Running cqreg with verbose...

. timer clear 2

. timer on 2

. cqreg y x1 x2 x3, verbose

------------------------------------------------------------
cqreg: C-Accelerated Quantile Regression
------------------------------------------------------------
Quantile:   .5
Depvar:     y
Indepvars:   x1 x2 x3
Obs:        1000
VCE type:   iid
Bandwidth:  Hall-Sheather
------------------------------------------------------------

cqreg: N=1000, K=4, G=0, quantile=0.500
Preprocessing QR solver (Chernozhukov et al. 2020)
  Initial subsample size: 179 (of 1000, 17.9%)
  Outer iteration 1: active set size = 179
IPM iter   0: mu=1.0000e+03 obj= 124073.35
IPM iter   1: mu=5.0000e+02 obj=  62036.68
IPM iter   2: mu=2.5000e+02 obj=  31018.34
IPM iter   3: mu=1.2500e+02 obj=  15509.18
IPM iter   4: mu=6.2500e+01 obj=   7754.61
IPM iter  10: mu=1.9531e+00 obj=    243.20
IPM iter  20: mu=1.2207e-01 obj=     25.88
IPM iter  30: mu=1.5259e-02 obj=     21.37
IPM iter  40: mu=3.8147e-03 obj=     21.28
IPM iter  50: mu=4.7684e-04 obj=     21.26
IPM iter  60: mu=5.9605e-05 obj=     21.26
IPM iter  70: mu=1.0000e-05 obj=     21.26
Solution stats: sum_u=23.05 sum_v=19.47 sum_u+v=42.53
  u: min=0.000000e+00 max=0.52  v: min=0.000000e+00 max=0.51
  lu: min=0.000000e+00 max=1.000000  lv: min=0.000000e+00 max=0.500000
  compl: sum(u*lu)=0.000000e+00 sum(v*lv)=0.000000e+00
  Found 1 violations
  Outer iteration 2: active set size = 180
IPM iter   0: mu=1.0000e+03 obj= 124766.49
IPM iter   1: mu=5.0000e+02 obj=  62383.25
IPM iter   2: mu=2.5000e+02 obj=  31191.63
IPM iter   3: mu=1.2500e+02 obj=  15595.83
IPM iter   4: mu=6.2500e+01 obj=   7797.93
IPM iter  10: mu=1.9531e+00 obj=    244.57
IPM iter  20: mu=1.2207e-01 obj=     26.15
IPM iter  30: mu=1.5259e-02 obj=     21.61
IPM iter  40: mu=1.9073e-03 obj=     21.50
IPM iter  50: mu=2.3842e-04 obj=     21.49
IPM iter  60: mu=2.9802e-05 obj=     21.49
Solution stats: sum_u=23.05 sum_v=19.93 sum_u+v=42.98
  u: min=0.000000e+00 max=0.52  v: min=0.000000e+00 max=0.51
  lu: min=0.000000e+00 max=1.000000  lv: min=0.000000e+00 max=0.500000
  compl: sum(u*lu)=0.000000e+00 sum(v*lv)=0.000000e+00
  Found 1 violations
  Outer iteration 3: active set size = 181
IPM iter   0: mu=1.0000e+03 obj= 125459.64
IPM iter   1: mu=5.0000e+02 obj=  62729.82
IPM iter   2: mu=2.5000e+02 obj=  31364.92
IPM iter   3: mu=1.2500e+02 obj=  15682.47
IPM iter   4: mu=6.2500e+01 obj=   7841.26
IPM iter  10: mu=1.9531e+00 obj=    245.94
IPM iter  20: mu=1.2207e-01 obj=     26.40
IPM iter  30: mu=1.5259e-02 obj=     21.84
IPM iter  40: mu=1.9073e-03 obj=     21.73
IPM iter  50: mu=4.7684e-04 obj=     21.73
IPM iter  60: mu=2.9802e-05 obj=     21.73
Solution stats: sum_u=23.28 sum_v=20.17 sum_u+v=43.45
  u: min=0.000000e+00 max=0.52  v: min=0.000000e+00 max=0.53
  lu: min=0.000000e+00 max=1.000000  lv: min=0.000000e+00 max=0.500000
  compl: sum(u*lu)=0.000000e+00 sum(v*lv)=0.000000e+00
  Found 1 violations
  Outer iteration 4: active set size = 182
IPM iter   0: mu=1.0000e+03 obj= 126152.79
IPM iter   1: mu=5.0000e+02 obj=  63076.40
IPM iter   2: mu=2.5000e+02 obj=  31538.20
IPM iter   3: mu=1.2500e+02 obj=  15769.11
IPM iter   4: mu=6.2500e+01 obj=   7884.58
IPM iter  10: mu=1.9531e+00 obj=    247.31
IPM iter  20: mu=1.2207e-01 obj=     26.64
IPM iter  30: mu=1.5259e-02 obj=     22.08
IPM iter  40: mu=1.9073e-03 obj=     21.97
IPM iter  50: mu=2.3842e-04 obj=     21.96
IPM iter  60: mu=2.9802e-05 obj=     21.96
Solution stats: sum_u=23.75 sum_v=20.17 sum_u+v=43.92
  u: min=0.000000e+00 max=0.52  v: min=0.000000e+00 max=0.53
  lu: min=0.000000e+00 max=1.000000  lv: min=0.000000e+00 max=0.500000
  compl: sum(u*lu)=0.000000e+00 sum(v*lv)=0.000000e+00
  Found 1 violations
  Outer iteration 5: active set size = 183
IPM iter   0: mu=1.0000e+03 obj= 126845.94
IPM iter   1: mu=5.0000e+02 obj=  63422.97
IPM iter   2: mu=2.5000e+02 obj=  31711.49
IPM iter   3: mu=1.2500e+02 obj=  15855.76
IPM iter   4: mu=6.2500e+01 obj=   7927.90
IPM iter  10: mu=1.9531e+00 obj=    248.68
IPM iter  20: mu=1.2207e-01 obj=     26.88
IPM iter  30: mu=1.5259e-02 obj=     22.31
IPM iter  40: mu=1.9073e-03 obj=     22.21
IPM iter  50: mu=4.7684e-04 obj=     22.20
IPM iter  60: mu=5.9605e-05 obj=     22.20
IPM iter  70: mu=1.4901e-05 obj=     22.20
Solution stats: sum_u=23.90 sum_v=20.50 sum_u+v=44.40
  u: min=0.000000e+00 max=0.52  v: min=0.000000e+00 max=0.54
  lu: min=0.000000e+00 max=1.000000  lv: min=0.000000e+00 max=0.500000
  compl: sum(u*lu)=0.000000e+00 sum(v*lv)=0.000000e+00
  Found 1 violations
  Outer iteration 6: active set size = 184
IPM iter   0: mu=1.0000e+03 obj= 127539.08
IPM iter   1: mu=5.0000e+02 obj=  63769.54
IPM iter   2: mu=2.5000e+02 obj=  31884.78
IPM iter   3: mu=1.2500e+02 obj=  15942.40
IPM iter   4: mu=6.2500e+01 obj=   7971.22
IPM iter  10: mu=1.9531e+00 obj=    250.05
IPM iter  20: mu=1.2207e-01 obj=     27.16
IPM iter  30: mu=1.5259e-02 obj=     22.56
IPM iter  40: mu=1.9073e-03 obj=     22.45
IPM iter  50: mu=2.3842e-04 obj=     22.45
IPM iter  60: mu=5.9605e-05 obj=     22.45
IPM iter  70: mu=1.0000e-05 obj=     22.45
Solution stats: sum_u=24.23 sum_v=20.66 sum_u+v=44.89
  u: min=0.000000e+00 max=0.53  v: min=0.000000e+00 max=0.53
  lu: min=0.000000e+00 max=1.000000  lv: min=0.000000e+00 max=0.500000
  compl: sum(u*lu)=0.000000e+00 sum(v*lv)=0.000000e+00
  Found 1 violations
  Outer iteration 7: active set size = 185
IPM iter   0: mu=1.0000e+03 obj= 128232.23
IPM iter   1: mu=5.0000e+02 obj=  64116.12
IPM iter   2: mu=2.5000e+02 obj=  32058.06
IPM iter   3: mu=1.2500e+02 obj=  16029.04
IPM iter   4: mu=6.2500e+01 obj=   8014.54
IPM iter  10: mu=1.9531e+00 obj=    251.43
IPM iter  20: mu=1.2207e-01 obj=     27.43
IPM iter  30: mu=1.5259e-02 obj=     22.81
IPM iter  40: mu=1.9073e-03 obj=     22.69
IPM iter  50: mu=2.3842e-04 obj=     22.69
IPM iter  60: mu=2.9802e-05 obj=     22.69
Solution stats: sum_u=24.23 sum_v=21.14 sum_u+v=45.38
  u: min=0.000000e+00 max=0.53  v: min=0.000000e+00 max=0.53
  lu: min=0.000000e+00 max=1.000000  lv: min=0.000000e+00 max=0.500000
  compl: sum(u*lu)=0.000000e+00 sum(v*lv)=0.000000e+00
  Found 1 violations
  Outer iteration 8: active set size = 186
IPM iter   0: mu=1.0000e+03 obj= 128925.38
IPM iter   1: mu=5.0000e+02 obj=  64462.69
IPM iter   2: mu=2.5000e+02 obj=  32231.35
IPM iter   3: mu=1.2500e+02 obj=  16115.69
IPM iter   4: mu=6.2500e+01 obj=   8057.87
IPM iter  10: mu=1.9531e+00 obj=    252.80
IPM iter  20: mu=1.2207e-01 obj=     27.71
IPM iter  30: mu=7.6294e-03 obj=     22.97
IPM iter  40: mu=9.5367e-04 obj=     22.93
IPM iter  50: mu=1.1921e-04 obj=     22.93
IPM iter  60: mu=1.0000e-05 obj=     22.93
Solution stats: sum_u=24.23 sum_v=21.63 sum_u+v=45.86
  u: min=0.000000e+00 max=0.53  v: min=0.000000e+00 max=0.53
  lu: min=0.000000e+00 max=1.000000  lv: min=0.000000e+00 max=0.500000
  compl: sum(u*lu)=0.000000e+00 sum(v*lv)=0.000000e+00
  Found 1 violations
  Outer iteration 9: active set size = 187
IPM iter   0: mu=1.0000e+03 obj= 129618.52
IPM iter   1: mu=5.0000e+02 obj=  64809.27
IPM iter   2: mu=2.5000e+02 obj=  32404.64
IPM iter   3: mu=1.2500e+02 obj=  16202.33
IPM iter   4: mu=6.2500e+01 obj=   8101.19
IPM iter  10: mu=1.9531e+00 obj=    254.17
IPM iter  20: mu=1.2207e-01 obj=     27.96
IPM iter  30: mu=7.6294e-03 obj=     23.22
IPM iter  40: mu=9.5367e-04 obj=     23.18
IPM iter  50: mu=2.3842e-04 obj=     23.17
IPM iter  60: mu=2.9802e-05 obj=     23.17
IPM iter  70: mu=1.0000e-05 obj=     23.17
Solution stats: sum_u=24.23 sum_v=22.12 sum_u+v=46.35
  u: min=0.000000e+00 max=0.53  v: min=0.000000e+00 max=0.53
  lu: min=0.000000e+00 max=1.000000  lv: min=0.000000e+00 max=0.500000
  compl: sum(u*lu)=0.000000e+00 sum(v*lv)=0.000000e+00
  Found 1 violations
  Outer iteration 10: active set size = 188
IPM iter   0: mu=1.0000e+03 obj= 130311.67
IPM iter   1: mu=5.0000e+02 obj=  65155.84
IPM iter   2: mu=2.5000e+02 obj=  32577.93
IPM iter   3: mu=1.2500e+02 obj=  16288.97
IPM iter   4: mu=6.2500e+01 obj=   8144.51
IPM iter  10: mu=1.9531e+00 obj=    255.54
IPM iter  20: mu=1.2207e-01 obj=     28.20
IPM iter  30: mu=1.5259e-02 obj=     23.55
IPM iter  40: mu=1.9073e-03 obj=     23.43
IPM iter  50: mu=1.1921e-04 obj=     23.42
Solution stats: sum_u=24.73 sum_v=22.12 sum_u+v=46.85
  u: min=0.000000e+00 max=0.53  v: min=0.000000e+00 max=0.53
  lu: min=0.000000e+00 max=1.000000  lv: min=0.000000e+00 max=0.500000
  compl: sum(u*lu)=0.000000e+00 sum(v*lv)=0.000000e+00
  Found 1 violations
  Outer iteration 11: active set size = 189
IPM iter   0: mu=1.0000e+03 obj= 131004.82
IPM iter   1: mu=5.0000e+02 obj=  65502.41
IPM iter   2: mu=2.5000e+02 obj=  32751.21
IPM iter   3: mu=1.2500e+02 obj=  16375.62
IPM iter   4: mu=6.2500e+01 obj=   8187.83
IPM iter  10: mu=1.9531e+00 obj=    256.91
IPM iter  20: mu=1.2207e-01 obj=     28.46
IPM iter  30: mu=1.5259e-02 obj=     23.80
IPM iter  40: mu=1.9073e-03 obj=     23.68
IPM iter  50: mu=1.1921e-04 obj=     23.68
IPM iter  60: mu=1.0000e-05 obj=     23.68
Solution stats: sum_u=24.73 sum_v=22.62 sum_u+v=47.35
  u: min=0.000000e+00 max=0.53  v: min=0.000000e+00 max=0.53
  lu: min=0.000000e+00 max=1.000000  lv: min=0.000000e+00 max=0.500000
  compl: sum(u*lu)=0.000000e+00 sum(v*lv)=0.000000e+00
  Found 1 violations
  Outer iteration 12: active set size = 190
IPM iter   0: mu=1.0000e+03 obj= 131697.97
IPM iter   1: mu=5.0000e+02 obj=  65848.99
IPM iter   2: mu=2.5000e+02 obj=  32924.50
IPM iter   3: mu=1.2500e+02 obj=  16462.26
IPM iter   4: mu=6.2500e+01 obj=   8231.16
IPM iter  10: mu=1.9531e+00 obj=    258.28
IPM iter  20: mu=1.2207e-01 obj=     28.72
IPM iter  30: mu=1.5259e-02 obj=     24.06
IPM iter  40: mu=1.9073e-03 obj=     23.93
IPM iter  50: mu=2.3842e-04 obj=     23.93
IPM iter  60: mu=2.9802e-05 obj=     23.93
Solution stats: sum_u=25.04 sum_v=22.81 sum_u+v=47.85
  u: min=0.000000e+00 max=0.53  v: min=0.000000e+00 max=0.53
  lu: min=0.000000e+00 max=1.000000  lv: min=0.000000e+00 max=0.500000
  compl: sum(u*lu)=0.000000e+00 sum(v*lv)=0.000000e+00
  Found 1 violations
  Outer iteration 13: active set size = 191
IPM iter   0: mu=1.0000e+03 obj= 132391.11
IPM iter   1: mu=5.0000e+02 obj=  66195.56
IPM iter   2: mu=2.5000e+02 obj=  33097.79
IPM iter   3: mu=1.2500e+02 obj=  16548.91
IPM iter   4: mu=6.2500e+01 obj=   8274.48
IPM iter  10: mu=1.9531e+00 obj=    259.65
IPM iter  20: mu=1.2207e-01 obj=     29.00
IPM iter  30: mu=7.6294e-03 obj=     24.23
IPM iter  40: mu=9.5367e-04 obj=     24.18
IPM iter  50: mu=1.1921e-04 obj=     24.18
IPM iter  60: mu=1.4901e-05 obj=     24.18
Solution stats: sum_u=25.04 sum_v=23.32 sum_u+v=48.36
  u: min=0.000000e+00 max=0.53  v: min=0.000000e+00 max=0.53
  lu: min=0.000000e+00 max=1.000000  lv: min=0.000000e+00 max=0.500000
  compl: sum(u*lu)=0.000000e+00 sum(v*lv)=0.000000e+00
  Found 1 violations
  Outer iteration 14: active set size = 192
IPM iter   0: mu=1.0000e+03 obj= 133084.26
IPM iter   1: mu=5.0000e+02 obj=  66542.13
IPM iter   2: mu=2.5000e+02 obj=  33271.07
IPM iter   3: mu=1.2500e+02 obj=  16635.55
IPM iter   4: mu=6.2500e+01 obj=   8317.80
IPM iter  10: mu=1.9531e+00 obj=    261.02
IPM iter  20: mu=1.2207e-01 obj=     29.26
IPM iter  30: mu=7.6294e-03 obj=     24.48
IPM iter  40: mu=9.5367e-04 obj=     24.44
IPM iter  50: mu=1.1921e-04 obj=     24.44
IPM iter  60: mu=1.4901e-05 obj=     24.44
Solution stats: sum_u=25.17 sum_v=23.70 sum_u+v=48.87
  u: min=0.000000e+00 max=0.54  v: min=0.000000e+00 max=0.53
  lu: min=0.000000e+00 max=1.000000  lv: min=0.000000e+00 max=0.500000
  compl: sum(u*lu)=0.000000e+00 sum(v*lv)=0.000000e+00
  Found 1 violations
  Outer iteration 15: active set size = 193
IPM iter   0: mu=1.0000e+03 obj= 133777.41
IPM iter   1: mu=5.0000e+02 obj=  66888.71
IPM iter   2: mu=2.5000e+02 obj=  33444.36
IPM iter   3: mu=1.2500e+02 obj=  16722.19
IPM iter   4: mu=6.2500e+01 obj=   8361.12
IPM iter  10: mu=1.9531e+00 obj=    262.40
IPM iter  20: mu=1.2207e-01 obj=     29.52
IPM iter  30: mu=7.6294e-03 obj=     24.74
IPM iter  40: mu=9.5367e-04 obj=     24.69
IPM iter  50: mu=1.1921e-04 obj=     24.69
IPM iter  60: mu=1.4901e-05 obj=     24.69
Solution stats: sum_u=25.17 sum_v=24.21 sum_u+v=49.38
  u: min=0.000000e+00 max=0.54  v: min=0.000000e+00 max=0.53
  lu: min=0.000000e+00 max=1.000000  lv: min=0.000000e+00 max=0.500000
  compl: sum(u*lu)=0.000000e+00 sum(v*lv)=0.000000e+00
  Found 1 violations
  Outer iteration 16: active set size = 194
IPM iter   0: mu=1.0000e+03 obj= 134470.56
IPM iter   1: mu=5.0000e+02 obj=  67235.28
IPM iter   2: mu=2.5000e+02 obj=  33617.65
IPM iter   3: mu=1.2500e+02 obj=  16808.84
IPM iter   4: mu=6.2500e+01 obj=   8404.44
IPM iter  10: mu=1.9531e+00 obj=    263.76
IPM iter  20: mu=6.1035e-02 obj=     26.36
IPM iter  30: mu=7.6294e-03 obj=     24.99
IPM iter  40: mu=9.5367e-04 obj=     24.95
IPM iter  50: mu=1.1921e-04 obj=     24.95
Solution stats: sum_u=25.24 sum_v=24.65 sum_u+v=49.89
  u: min=0.000000e+00 max=0.54  v: min=0.000000e+00 max=0.52
  lu: min=0.000000e+00 max=1.000000  lv: min=0.000000e+00 max=0.500000
  compl: sum(u*lu)=0.000000e+00 sum(v*lv)=0.000000e+00
  Found 1 violations
  Outer iteration 17: active set size = 195
IPM iter   0: mu=1.0000e+03 obj= 135163.70
IPM iter   1: mu=5.0000e+02 obj=  67581.85
IPM iter   2: mu=2.5000e+02 obj=  33790.93
IPM iter   3: mu=1.2500e+02 obj=  16895.48
IPM iter   4: mu=6.2500e+01 obj=   8447.77
IPM iter  10: mu=1.9531e+00 obj=    265.13
IPM iter  20: mu=6.1035e-02 obj=     26.62
IPM iter  30: mu=7.6294e-03 obj=     25.25
IPM iter  40: mu=9.5367e-04 obj=     25.20
IPM iter  50: mu=1.1921e-04 obj=     25.20
IPM iter  60: mu=1.0000e-05 obj=     25.20
Solution stats: sum_u=25.24 sum_v=25.17 sum_u+v=50.40
  u: min=0.000000e+00 max=0.54  v: min=0.000000e+00 max=0.52
  lu: min=0.000000e+00 max=1.000000  lv: min=0.000000e+00 max=0.500000
  compl: sum(u*lu)=0.000000e+00 sum(v*lv)=0.000000e+00
  Found 1 violations
  Outer iteration 18: active set size = 196
IPM iter   0: mu=1.0000e+03 obj= 135856.85
IPM iter   1: mu=5.0000e+02 obj=  67928.43
IPM iter   2: mu=2.5000e+02 obj=  33964.22
IPM iter   3: mu=1.2500e+02 obj=  16982.12
IPM iter   4: mu=6.2500e+01 obj=   8491.09
IPM iter  10: mu=1.9531e+00 obj=    266.50
IPM iter  20: mu=6.1035e-02 obj=     26.88
IPM iter  30: mu=7.6294e-03 obj=     25.51
IPM iter  40: mu=9.5367e-04 obj=     25.47
IPM iter  50: mu=2.3842e-04 obj=     25.47
IPM iter  60: mu=5.9605e-05 obj=     25.47
Solution stats: sum_u=25.24 sum_v=25.69 sum_u+v=50.93
  u: min=0.000000e+00 max=0.54  v: min=0.000000e+00 max=0.53
  lu: min=0.000000e+00 max=1.000000  lv: min=0.000000e+00 max=0.500000
  compl: sum(u*lu)=0.000000e+00 sum(v*lv)=0.000000e+00
  Found 1 violations
  Outer iteration 19: active set size = 197
IPM iter   0: mu=1.0000e+03 obj= 136550.00
IPM iter   1: mu=5.0000e+02 obj=  68275.00
IPM iter   2: mu=2.5000e+02 obj=  34137.51
IPM iter   3: mu=1.2500e+02 obj=  17068.77
IPM iter   4: mu=6.2500e+01 obj=   8534.41
IPM iter  10: mu=1.9531e+00 obj=    267.87
IPM iter  20: mu=6.1035e-02 obj=     27.13
IPM iter  30: mu=7.6294e-03 obj=     25.78
IPM iter  40: mu=1.9073e-03 obj=     25.74
IPM iter  50: mu=2.3842e-04 obj=     25.73
IPM iter  60: mu=5.9605e-05 obj=     25.73
IPM iter  70: mu=1.0000e-05 obj=     25.73
Solution stats: sum_u=25.77 sum_v=25.70 sum_u+v=51.46
  u: min=0.000000e+00 max=0.54  v: min=0.000000e+00 max=0.53
  lu: min=0.000000e+00 max=1.000000  lv: min=0.000000e+00 max=0.500000
  compl: sum(u*lu)=0.000000e+00 sum(v*lv)=0.000000e+00
  Found 1 violations
  Outer iteration 20: active set size = 198
IPM iter   0: mu=1.0000e+03 obj= 137243.14
IPM iter   1: mu=5.0000e+02 obj=  68621.58
IPM iter   2: mu=2.5000e+02 obj=  34310.79
IPM iter   3: mu=1.2500e+02 obj=  17155.41
IPM iter   4: mu=6.2500e+01 obj=   8577.73
IPM iter  10: mu=1.9531e+00 obj=    269.24
IPM iter  20: mu=6.1035e-02 obj=     27.40
IPM iter  30: mu=7.6294e-03 obj=     26.04
IPM iter  40: mu=9.5367e-04 obj=     26.00
IPM iter  50: mu=2.3842e-04 obj=     26.00
IPM iter  60: mu=5.9605e-05 obj=     26.00
IPM iter  70: mu=1.0000e-05 obj=     26.00
Solution stats: sum_u=26.30 sum_v=25.70 sum_u+v=52.00
  u: min=0.000000e+00 max=0.54  v: min=0.000000e+00 max=0.53
  lu: min=0.000000e+00 max=1.000000  lv: min=0.000000e+00 max=0.500000
  compl: sum(u*lu)=0.000000e+00 sum(v*lv)=0.000000e+00
  Found 1 violations
cqreg: IPM: iterations=1336, converged=1, objective=794.6192, time=0.004s
cqreg: Sparsity: 5.5111, bandwidth: 0.094539
cqreg: VCE computation failed
cqreg: Total time: 0.005s (load: 0.001, hdfe: 0.000, ipm: 0.004, vce: 0.000)

    .5 Quantile regression                      Number of obs     =      1,000
                                                Min sum of deviations=      794
> .6
                                                Sparsity          =     5.5111

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          x1 |   1.993973          .        .       .            .           .
          x2 |  -1.083565          .        .       .            .           .
          x3 |    .533235          .        .       .            .           .
       _cons |   .8910874          .        .       .            .           .
------------------------------------------------------------------------------

IPM iterations: 1336, converged: yes
Total time:         0.005 seconds

. timer off 2

. quietly timer list 2

. di "cqreg time: " r(t2) "s"
cqreg time: .457s

. matrix b_cqreg = e(b)

. 
. di _newline "Comparing coefficients:"

Comparing coefficients:

. di "qreg:  " b_qreg[1,1] " " b_qreg[1,2] " " b_qreg[1,3] " " b_qreg[1,4]
qreg:  2.0586955 -1.0610342 .53953428 .92823365

. di "cqreg: " b_cqreg[1,1] " " b_cqreg[1,2] " " b_cqreg[1,3] " " b_cqreg[1,4]
cqreg: 1.9939726 -1.0835652 .53323496 .89108741

. 
. di _newline "Done!"

Done!

. 
end of do-file
