
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_sparsity.do 

. clear all

. set more off

. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. sysuse auto, clear
(1978 automobile data)

. drop if missing(price, mpg, weight, rep78)
(5 observations deleted)

. 
. * Run qreg and get density estimate
. qreg price mpg weight, quantile(0.5)

Iteration 1:  WLS sum of weighted deviations =  63341.574

Iteration 1:  Sum of abs. weighted deviations =  63536.156
Iteration 2:  Sum of abs. weighted deviations =  58812.858
Iteration 3:  Sum of abs. weighted deviations =  58491.205
Iteration 4:  Sum of abs. weighted deviations =  58480.736
Iteration 5:  Sum of abs. weighted deviations =  58477.095
Iteration 6:  Sum of abs. weighted deviations =  58466.957

Median regression                                   Number of obs =         69
  Raw sum of deviations    65163 (about 5079)
  Min sum of deviations 58466.96                    Pseudo R2     =     0.1028

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -64.08696   121.1752    -0.53   0.599    -306.0211    177.8472
      weight |   .5782609    .896591     0.64   0.521    -1.211841    2.368363
       _cons |       4812   5051.627     0.95   0.344    -5273.898     14897.9
------------------------------------------------------------------------------

. local qreg_f = e(f)

. local qreg_sum_adev = e(sum_adev)

. local qreg_sum_rdev = e(sum_rdev)

. 
. display "qreg f(0) = " %12.8f `qreg_f'
qreg f(0) =            .

. display "qreg sparsity (1/f) = " %12.8f 1/`qreg_f'
qreg sparsity (1/f) =            .

. 
. * Get residuals
. predict double r, resid

. summ r

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           r |         69    945.1418    2578.762  -1875.739   9959.087

. 
. * Manual sparsity calculation using Stata's method
. local N = 69

. local q = 0.5

. local alpha = 0.05

. 
. * Hall-Sheather bandwidth
. local z_alpha = invnormal(1 - `alpha'/2)

. local z_q = invnormal(`q')

. local phi_zq = normalden(`z_q')

. 
. local h = `N'^(-1/3) * `z_alpha'^(2/3) * ((1.5 * `phi_zq'^2) / (2*`z_q'^2 + 1
> ))^(1/3)

. 
. display "Hall-Sheather h = " %12.8f `h'
Hall-Sheather h =   0.23687515

. display "q-h = " %12.8f (`q' - `h') " q+h = " %12.8f (`q' + `h')
q-h =   0.26312485 q+h =   0.73687515

. 
. * Get residual quantiles at q-h and q+h
. _pctile r, percentile(`=(`q'-`h')*100' `=(`q'+`h')*100')

. local r_lo = r(r1)

. local r_hi = r(r2)

. 
. display "r_lo = " %12.6f `r_lo'
r_lo =  -721.782609

. display "r_hi = " %12.6f `r_hi'
r_hi =  1520.521739

. display "2h = " %12.8f (2*`h')
2h =   0.47375029

. 
. * Difference quotient sparsity
. local sparsity_dq = (`r_hi' - `r_lo') / (2 * `h')

. display "Sparsity (diff quotient) = " %12.4f `sparsity_dq'
Sparsity (diff quotient) =    4733.0933

. 
. * Compare to qreg's sparsity
. display "qreg's sparsity = " %12.4f (1/`qreg_f')
qreg's sparsity =            .

. display "Ratio (DQ/qreg) = " %12.8f (`sparsity_dq' / (1/`qreg_f'))
Ratio (DQ/qreg) =            .

. 
end of do-file
