
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_timing_detail.do 

. clear all

. set more off

. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. 
. set obs 5000000
Number of observations (_N) was 0, now 5,000,000.

. set seed 12345

. gen x = rnormal()

. gen y = 2*x + rnormal()*5

. 
. display "=== CQREG TIMING BREAKDOWN ==="
=== CQREG TIMING BREAKDOWN ===

. cqreg y x, denmethod(residual)
FN Timing (N=5000000, K=2, iters=19): total=2.007s
  init=0.026s  scaling=0.045
> s  X'DX=0.031s  chol=0.048s
  direction=0.189s  steplength=0.530s  corrector=
> 1.038s  update=0.100s

Median regression                                  Number of obs =  5,000,000
  Raw sum of deviations 1.1e+07  (about -.001789 )
  Min sum of deviations 1.0e+07                    Pseudo R2     =     0.0718

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
           x |   1.999809   .0027847   718.14   0.000     1.994351    2.005267
       _cons |  -.0022945   .0027841    -0.82   0.410    -.0077512    .0031622
------------------------------------------------------------------------------

. 
end of do-file
