
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_breakdown.do 

. clear all

. set more off

. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. 
. set obs 5000000
Number of observations (_N) was 0, now 5,000,000.

. set seed 12345

. gen x = rnormal()

. gen y = 2*x + rnormal()*5

. 
. display "============================================================"
============================================================

. display "CQREG Runtime Breakdown: N=5,000,000, K=2"
CQREG Runtime Breakdown: N=5,000,000, K=2

. display "============================================================"
============================================================

. 
. display ""


. display "=== Method 1: residual (1 IPM solve) ==="
=== Method 1: residual (1 IPM solve) ===

. timer clear

. timer on 1

. cqreg y x, denmethod(residual) verbose

------------------------------------------------------------
cqreg: C-Accelerated Quantile Regression
------------------------------------------------------------
Quantile:   .5
Depvar:     y
Indepvars:   x
Obs:        5000000
VCE type:   iid
Density:    residual
Bandwidth:  Hall-Sheather
------------------------------------------------------------

cqreg: N=5000000, K=2, G=0, quantile=0.500
FN Timing (N=5000000, K=2, iters=19): total=1.048s
  init=0.024s  scaling=0.043
> s  X'DX=0.027s  chol=0.082s
  direction=0.142s  steplength=0.071s  corrector=
> 0.553s  update=0.106s
  Corrector breakdown:
    loop1=0.152s  loop2=0.065s  
> gemv1=0.062s  gemv2=0.013s  loop3=0.188s  step=0.073s
cqreg: IPM: iterations=19, converged=1, objective=9970517.0659, time=1.084s
cqreg: Sparsity: 12.4508, bandwidth: 0.005682 (method: residual)
cqreg: Total time: 1.646s (load: 0.449, hdfe: 0.000, ipm: 1.084, vce: 0.114)

Median regression                                  Number of obs =  5,000,000
  Raw sum of deviations 1.1e+07  (about -.0017922)
  Min sum of deviations 1.0e+07                    Pseudo R2     =     0.0718

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
           x |   1.999809   .0027847   718.14   0.000     1.994351    2.005267
       _cons |  -.0022945   .0027841    -0.82   0.410    -.0077512    .0031622
------------------------------------------------------------------------------

Iterations: 19, converged: yes
Total time:     1.654 seconds

. timer off 1

. timer list 1
   1:      1.88 /        1 =       1.8770

. 
. display ""


. display "=== Method 2: fitted (3 IPM solves) ==="
=== Method 2: fitted (3 IPM solves) ===

. timer clear

. timer on 2

. cqreg y x, denmethod(fitted) verbose

------------------------------------------------------------
cqreg: C-Accelerated Quantile Regression
------------------------------------------------------------
Quantile:   .5
Depvar:     y
Indepvars:   x
Obs:        5000000
VCE type:   iid
Density:    fitted
Bandwidth:  Hall-Sheather
------------------------------------------------------------

cqreg: N=5000000, K=2, G=0, quantile=0.500
FN Timing (N=5000000, K=2, iters=19): total=1.028s
  init=0.023s  scaling=0.042
> s  X'DX=0.025s  chol=0.082s
  direction=0.158s  steplength=0.068s  corrector=
> 0.525s  update=0.106s
  Corrector breakdown:
    loop1=0.151s  loop2=0.063s  
> gemv1=0.062s  gemv2=0.013s  loop3=0.167s  step=0.068s
cqreg: IPM: iterations=19, converged=1, objective=9970517.0659, time=1.065s
FN Timing (N=5000000, K=2, iters=55): total=5.352s
  init=0.029s  scaling=0.137
> s  X'DX=0.163s  chol=0.244s
  direction=0.455s  steplength=1.287s  corrector=
> 2.725s  update=0.311s
  Corrector breakdown:
    loop1=0.449s  loop2=0.200s  
> gemv1=0.193s  gemv2=0.051s  loop3=0.537s  step=1.296s
FN Timing (N=5000000, K=2, iters=55): total=5.441s
  init=0.029s  scaling=0.137
> s  X'DX=0.163s  chol=0.244s
  direction=0.455s  steplength=1.314s  corrector=
> 2.782s  update=0.317s
  Corrector breakdown:
    loop1=0.456s  loop2=0.203s  
> gemv1=0.196s  gemv2=0.052s  loop3=0.547s  step=1.328s
cqreg: Sparsity: 12.4451, bandwidth: 0.005682 (method: fitted)
cqreg: Total time: 4.366s (load: 0.465, hdfe: 0.000, ipm: 1.065, vce: 2.836)

Median regression                                  Number of obs =  5,000,000
  Raw sum of deviations 1.1e+07  (about -.0017922)
  Min sum of deviations 1.0e+07                    Pseudo R2     =     0.0718

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
           x |   1.999809   .0027834   718.48   0.000     1.994353    2.005264
       _cons |  -.0022945   .0027828    -0.82   0.410    -.0077487    .0031597
------------------------------------------------------------------------------

Iterations: 19, converged: yes
Total time:     4.384 seconds

. timer off 2

. timer list 2
   2:      4.42 /        1 =       4.4220

. 
end of do-file
