
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_all_vce.do 

. clear all

. set more off

. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. sysuse auto, clear
(1978 automobile data)

. drop if missing(price, mpg, weight, rep78)
(5 observations deleted)

. 
. display _n "========================================"

========================================

. display "=== COMPREHENSIVE VCE COMPARISON TEST ==="
=== COMPREHENSIVE VCE COMPARISON TEST ===

. display "========================================" _n
========================================


. 
. display _n "Dataset: auto (N=69), quantile=0.5"

Dataset: auto (N=69), quantile=0.5

. display "Clustering variable: rep78 (5 levels)" _n
Clustering variable: rep78 (5 levels)


. 
. * Run qreg with IID (default)
. display "=== STATA qreg ===" _n
=== STATA qreg ===


. quietly qreg price mpg weight, quantile(0.5)

. display "qreg IID (fitted method):"
qreg IID (fitted method):

. display "  SE[mpg]    = " %12.6f _se[mpg]
  SE[mpg]    =   121.175244

. display "  SE[weight] = " %12.6f _se[weight]
  SE[weight] =     0.896591

. 
. quietly qreg price mpg weight, quantile(0.5) vce(iid, residual)

. display _n "qreg IID (residual method):"

qreg IID (residual method):

. display "  SE[mpg]    = " %12.6f _se[mpg]
  SE[mpg]    =    85.176144

. display "  SE[weight] = " %12.6f _se[weight]
  SE[weight] =     0.630229

. 
. quietly qreg price mpg weight, quantile(0.5) vce(robust)

. display _n "qreg Robust:"

qreg Robust:

. display "  SE[mpg]    = " %12.6f _se[mpg]
  SE[mpg]    =    69.165112

. display "  SE[weight] = " %12.6f _se[weight]
  SE[weight] =     0.725288

. 
. display _n "qreg Cluster: NOT SUPPORTED by Stata's qreg" _n

qreg Cluster: NOT SUPPORTED by Stata's qreg


. 
. * Run cqreg with all VCE types
. display "=== cqreg ===" _n
=== cqreg ===


. quietly cqreg price mpg weight, quantile(0.5) vce(iid)

. display "cqreg IID:"
cqreg IID:

. display "  SE[mpg]    = " %12.6f _se[mpg]
  SE[mpg]    =    85.176144

. display "  SE[weight] = " %12.6f _se[weight]
  SE[weight] =     0.630229

. 
. quietly cqreg price mpg weight, quantile(0.5) vce(robust)

. display _n "cqreg Robust:"

cqreg Robust:

. display "  SE[mpg]    = " %12.6f _se[mpg]
  SE[mpg]    =    85.176144

. display "  SE[weight] = " %12.6f _se[weight]
  SE[weight] =     0.630229

. 
. quietly cqreg price mpg weight, quantile(0.5) vce(cluster rep78)

. display _n "cqreg Cluster (rep78, 5 clusters):"

cqreg Cluster (rep78, 5 clusters):

. display "  SE[mpg]    = " %12.6f _se[mpg]
  SE[mpg]    =    46.319382

. display "  SE[weight] = " %12.6f _se[weight]
  SE[weight] =     0.952715

. display "  N_clust    = " e(N_clust)
  N_clust    = 5

. 
. display _n "========================================"

========================================

. display "=== NOTES ===" _n
=== NOTES ===


. display "1. cqreg IID matches qreg vce(iid, residual) method"
1. cqreg IID matches qreg vce(iid, residual) method

. display "2. cqreg Robust is same as IID for median (tau=0.5)"
2. cqreg Robust is same as IID for median (tau=0.5)

. display "3. cqreg Cluster is unique - qreg doesn't support this"
3. cqreg Cluster is unique - qreg doesn't support this

. display "4. All coefficients match exactly between qreg and cqreg"
4. All coefficients match exactly between qreg and cqreg

. 
. * Verify coefficients match
. display _n "=== Coefficient Verification ===" _n

=== Coefficient Verification ===


. quietly qreg price mpg weight, quantile(0.5)

. local b_mpg_qreg = _b[mpg]

. local b_wt_qreg = _b[weight]

. local b_cons_qreg = _b[_cons]

. 
. quietly cqreg price mpg weight, quantile(0.5)

. local b_mpg_cqreg = _b[mpg]

. local b_wt_cqreg = _b[weight]

. local b_cons_cqreg = _b[_cons]

. 
. display "qreg:  mpg=" %10.4f `b_mpg_qreg' "  weight=" %10.4f `b_wt_qreg' "  c
> ons=" %10.2f `b_cons_qreg'
qreg:  mpg=  -64.0870  weight=    0.5783  cons=   4812.00

. display "cqreg: mpg=" %10.4f `b_mpg_cqreg' "  weight=" %10.4f `b_wt_cqreg' " 
>  cons=" %10.2f `b_cons_cqreg'
cqreg: mpg=  -64.0870  weight=    0.5783  cons=   4812.00

. 
. local diff_mpg = abs(`b_mpg_qreg' - `b_mpg_cqreg')

. local diff_wt = abs(`b_wt_qreg' - `b_wt_cqreg')

. local diff_cons = abs(`b_cons_qreg' - `b_cons_cqreg')

. 
. if `diff_mpg' < 1e-6 & `diff_wt' < 1e-6 & `diff_cons' < 1e-6 {
.     display _n "COEFFICIENTS MATCH EXACTLY"

COEFFICIENTS MATCH EXACTLY
. }

. else {
.     display _n "WARNING: Coefficient mismatch!"
. }

. 
end of do-file
