
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_exact_match.do 

. * Test exact match between cqreg and qreg
. clear all

. set more off

. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. sysuse auto, clear
(1978 automobile data)

. 
. display _n "=== EXACT MATCH TEST ===" _n

=== EXACT MATCH TEST ===


. 
. * Run qreg with robust VCE
. quietly qreg price mpg, quantile(0.5) vce(robust)

. display "qreg vce(robust):"
qreg vce(robust):

. display "  beta[mpg]  = " %16.10f _b[mpg]
  beta[mpg]  =  -135.6666666667

. display "  beta[cons] = " %16.10f _b[_cons]
  beta[cons] =  8088.6666666667

. display "  SE[mpg]    = " %16.10f _se[mpg]
  SE[mpg]    =    43.4520447217

. display "  SE[cons]   = " %16.10f _se[_cons]
  SE[cons]   =  1271.5372883491

. matrix V_qreg = e(V)

. display "  V[1,1]     = " %16.10e V_qreg[1,1]
  V[1,1]     =  1.888080190e+03

. display "  V[2,2]     = " %16.10e V_qreg[2,2]
  V[2,2]     =  1.616807076e+06

. local qreg_se_mpg = _se[mpg]

. local qreg_se_cons = _se[_cons]

. 
. * Check what density method qreg used
. display _n "  qreg denmethod = " e(denmethod)

  qreg denmethod = fitted

. display "  qreg bwidth    = " e(bwidth)
  qreg bwidth    = .23141524

. display "  qreg sparsity  = " e(sparsity)
  qreg sparsity  = .

. display "  qreg f_r       = " e(f_r)
  qreg f_r       = .

. 
. * Run cqreg with default settings (should be fitted)
. display _n "cqreg (default):"

cqreg (default):

. quietly cqreg price mpg, quantile(0.5) vce(robust)

. display "  beta[mpg]  = " %16.10f _b[mpg]
  beta[mpg]  =  -135.6666666667

. display "  beta[cons] = " %16.10f _b[_cons]
  beta[cons] =  8088.6666666667

. display "  SE[mpg]    = " %16.10f _se[mpg]
  SE[mpg]    =    63.2607915755

. display "  SE[cons]   = " %16.10f _se[_cons]
  SE[cons]   =  1461.6609507267

. matrix V_cqreg = e(V)

. display "  V[1,1]     = " %16.10e V_cqreg[1,1]
  V[1,1]     =  4.001927751e+03

. display "  V[2,2]     = " %16.10e V_cqreg[2,2]
  V[2,2]     =  2.136452735e+06

. display _n "  cqreg denmethod = " e(denmethod)

  cqreg denmethod = fitted

. display "  cqreg bwidth    = " e(bwidth)
  cqreg bwidth    = .23141524

. display "  cqreg sparsity  = " e(sparsity)
  cqreg sparsity  = 4695.0171

. 
. local cqreg_se_mpg = _se[mpg]

. 
. * Calculate ratios
. display _n "=== COMPARISON ==="

=== COMPARISON ===

. display "SE[mpg] ratio (cqreg/qreg): " %12.10f `cqreg_se_mpg'/`qreg_se_mpg'
SE[mpg] ratio (cqreg/qreg): 1.4558760579

. display "V[1,1] ratio:               " %12.10f V_cqreg[1,1]/V_qreg[1,1]
V[1,1] ratio:               2.1195750959

. 
. * Also check IID comparison
. display _n _n "=== IID COMPARISON ==="


=== IID COMPARISON ===

. quietly qreg price mpg, quantile(0.5)

. display "qreg vce(iid) [default fitted]:"
qreg vce(iid) [default fitted]:

. display "  SE[mpg]    = " %16.10f _se[mpg]
  SE[mpg]    =    67.2657646365

. display "  sparsity   = " e(sparsity)
  sparsity   = 6650.0766

. display "  bwidth     = " e(bwidth)
  bwidth     = .23141524

. 
. quietly qreg price mpg, quantile(0.5) vce(iid, residual)

. display _n "qreg vce(iid, residual):"

qreg vce(iid, residual):

. display "  SE[mpg]    = " %16.10f _se[mpg]
  SE[mpg]    =    45.1167537449

. display "  sparsity   = " e(sparsity)
  sparsity   = 4460.3651

. 
. quietly cqreg price mpg, quantile(0.5) vce(iid) denmethod(residual)

. display _n "cqreg vce(iid) denmethod(residual):"

cqreg vce(iid) denmethod(residual):

. display "  SE[mpg]    = " %16.10f _se[mpg]
  SE[mpg]    =    45.1167537206

. display "  sparsity   = " e(sparsity)
  sparsity   = 4460.3651

. 
end of do-file
