
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_sparsity2.do 

. clear all

. set more off

. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. sysuse auto, clear
(1978 automobile data)

. drop if missing(price, mpg, weight, rep78)
(5 observations deleted)

. 
. * Run qreg and examine what it stores
. qreg price mpg weight, quantile(0.5)

Iteration 1:  WLS sum of weighted deviations =  63341.574

Iteration 1:  Sum of abs. weighted deviations =  63536.156
Iteration 2:  Sum of abs. weighted deviations =  58812.858
Iteration 3:  Sum of abs. weighted deviations =  58491.205
Iteration 4:  Sum of abs. weighted deviations =  58480.736
Iteration 5:  Sum of abs. weighted deviations =  58477.095
Iteration 6:  Sum of abs. weighted deviations =  58466.957

Median regression                                   Number of obs =         69
  Raw sum of deviations    65163 (about 5079)
  Min sum of deviations 58466.96                    Pseudo R2     =     0.1028

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -64.08696   121.1752    -0.53   0.599    -306.0211    177.8472
      weight |   .5782609    .896591     0.64   0.521    -1.211841    2.368363
       _cons |       4812   5051.627     0.95   0.344    -5273.898     14897.9
------------------------------------------------------------------------------

. ereturn list

scalars:
               e(rank) =  3
           e(sparsity) =  6947.194832347471
             e(bwidth) =  .236875145458331
               e(df_m) =  2
               e(df_r) =  66
                e(f_r) =  .0001439429905354
                  e(N) =  69
              e(sum_w) =  69
                e(q_v) =  5079
                  e(q) =  .5
           e(sum_rdev) =  65163
           e(sum_adev) =  58466.95652173913
           e(convcode) =  0
               e(r2_p) =  .1027583671448655

macros:
                e(cmd) : "qreg"
            e(cmdline) : "qreg price mpg weight, quantile(0.5)"
            e(predict) : "qreg_p"
         e(properties) : "b V"
       e(marginsnotok) : "stdp stddp residuals"
                e(vce) : "iid"
          e(denmethod) : "fitted"
           e(bwmethod) : "hsheather"
             e(depvar) : "price"

matrices:
                  e(b) :  1 x 3
                  e(V) :  3 x 3

functions:
             e(sample)   

. 
. * Get the VCE matrix
. matrix list e(V)

symmetric e(V)[3,3]
               mpg      weight       _cons
   mpg    14683.44
weight   87.515401   .80387538
 _cons  -577957.54  -4300.5637    25518934

. 
. * Compute X'X inverse manually
. gen cons = 1

. mkmat mpg weight cons, matrix(X)

. matrix XtX = X' * X

. matrix XtX_inv = syminv(XtX)

. matrix list XtX_inv

symmetric XtX_inv[3,3]
               mpg      weight        cons
   mpg   .00121694
weight   7.253e-06   6.662e-08
  cons  -.04790016  -.00035642   2.1149668

. 
. * IID VCE formula: V = s^2 * tau*(1-tau) * (X'X)^{-1}
. * So: s^2 = V[1,1] / (tau*(1-tau) * (X'X)^{-1}[1,1])
. local v11 = e(V)[1,1]

. local xtxinv11 = XtX_inv[1,1]

. local tau = 0.5

. local scale = `tau' * (1 - `tau')

. local implied_s2 = `v11' / (`scale' * `xtxinv11')

. local implied_s = sqrt(`implied_s2')

. 
. display _n "====================================="

=====================================

. display "BACK-CALCULATED SPARSITY FROM QREG"
BACK-CALCULATED SPARSITY FROM QREG

. display "====================================="
=====================================

. display "V[1,1] = " %12.6f `v11'
V[1,1] = 14683.439879

. display "(X'X)^{-1}[1,1] = " %12.8f `xtxinv11'
(X'X)^{-1}[1,1] =   0.00121694

. display "tau*(1-tau) = " %6.4f `scale'
tau*(1-tau) = 0.2500

. display "implied s^2 = " %12.2f `implied_s2'
implied s^2 =  48263516.04

. display "implied s = " %12.4f `implied_s'
implied s =    6947.1948

. display _n "This is qreg's effective sparsity."

This is qreg's effective sparsity.

. 
. * Now compute difference quotient sparsity
. predict double resid, resid

. local N = 69

. local alpha = 0.05

. local z_alpha = invnormal(1 - `alpha'/2)

. local z_q = invnormal(`tau')

. local phi_zq = normalden(`z_q')

. 
. local h = `N'^(-1/3) * `z_alpha'^(2/3) * ((1.5 * `phi_zq'^2) / (2*`z_q'^2 + 1
> ))^(1/3)

. 
. _pctile resid, percentile(`=(`tau'-`h')*100' `=(`tau'+`h')*100')

. local r_lo = r(r1)

. local r_hi = r(r2)

. 
. local sparsity_dq = (`r_hi' - `r_lo') / (2 * `h')

. 
. display _n "====================================="

=====================================

. display "DIFFERENCE QUOTIENT SPARSITY"
DIFFERENCE QUOTIENT SPARSITY

. display "====================================="
=====================================

. display "h = " %12.8f `h'
h =   0.23687515

. display "r_lo = " %12.4f `r_lo'
r_lo =    -721.7826

. display "r_hi = " %12.4f `r_hi'
r_hi =    1520.5217

. display "sparsity_dq = " %12.4f `sparsity_dq'
sparsity_dq =    4733.0933

. 
. display _n "====================================="

=====================================

. display "COMPARISON"
COMPARISON

. display "====================================="
=====================================

. display "qreg implied sparsity: " %12.4f `implied_s'
qreg implied sparsity:    6947.1948

. display "DQ sparsity:           " %12.4f `sparsity_dq'
DQ sparsity:              4733.0933

. display "Ratio (qreg/DQ):       " %12.6f (`implied_s' / `sparsity_dq')
Ratio (qreg/DQ):           1.467792

. 
. * What multiplier would make DQ match qreg?
. local multiplier = `implied_s' / `sparsity_dq'

. display _n "To match qreg, DQ sparsity needs multiplier: " %8.6f `multiplier'

To match qreg, DQ sparsity needs multiplier: 1.467792

. 
end of do-file
