
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_density_methods.do 

. * Test density estimation methods for cqreg VCE
. * Compare cqreg with different denmethod options to qreg
. 
. clear all

. set more off

. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. sysuse auto, clear
(1978 automobile data)

. drop if missing(price, mpg, weight, rep78)
(5 observations deleted)

. 
. display _n "========================================"

========================================

. display "=== DENSITY METHOD COMPARISON TEST ==="
=== DENSITY METHOD COMPARISON TEST ===

. display "========================================" _n
========================================


. 
. display _n "Dataset: auto (N=" _N "), quantile=0.5" _n

Dataset: auto (N=69), quantile=0.5


. 
. * ========================================
. * IID VCE Comparison
. * ========================================
. display _n "=== IID VCE COMPARISON ===" _n

=== IID VCE COMPARISON ===


. 
. * qreg default (fitted method)
. quietly qreg price mpg weight, quantile(0.5)

. display "qreg vce(iid) [fitted method - default]:"
qreg vce(iid) [fitted method - default]:

. display "  SE[mpg]    = " %12.6f _se[mpg]
  SE[mpg]    =   121.175244

. display "  SE[weight] = " %12.6f _se[weight]
  SE[weight] =     0.896591

. local se_mpg_qreg_fitted = _se[mpg]

. local se_wt_qreg_fitted = _se[weight]

. 
. * qreg residual method
. quietly qreg price mpg weight, quantile(0.5) vce(iid, residual)

. display _n "qreg vce(iid, residual):"

qreg vce(iid, residual):

. display "  SE[mpg]    = " %12.6f _se[mpg]
  SE[mpg]    =    85.176144

. display "  SE[weight] = " %12.6f _se[weight]
  SE[weight] =     0.630229

. local se_mpg_qreg_resid = _se[mpg]

. local se_wt_qreg_resid = _se[weight]

. 
. * cqreg fitted method (default)
. quietly cqreg price mpg weight, quantile(0.5) vce(iid) denmethod(fitted)

. display _n "cqreg vce(iid) denmethod(fitted):"

cqreg vce(iid) denmethod(fitted):

. display "  SE[mpg]    = " %12.6f _se[mpg]
  SE[mpg]    =    54.117331

. display "  SE[weight] = " %12.6f _se[weight]
  SE[weight] =     0.400421

. local se_mpg_cqreg_fitted = _se[mpg]

. local se_wt_cqreg_fitted = _se[weight]

. 
. * cqreg residual method
. quietly cqreg price mpg weight, quantile(0.5) vce(iid) denmethod(residual)

. display _n "cqreg vce(iid) denmethod(residual):"

cqreg vce(iid) denmethod(residual):

. display "  SE[mpg]    = " %12.6f _se[mpg]
  SE[mpg]    =    85.176144

. display "  SE[weight] = " %12.6f _se[weight]
  SE[weight] =     0.630229

. local se_mpg_cqreg_resid = _se[mpg]

. local se_wt_cqreg_resid = _se[weight]

. 
. * Check matches
. display _n "=== IID VCE Match Check ===" _n

=== IID VCE Match Check ===


. local ratio_fitted = `se_mpg_cqreg_fitted' / `se_mpg_qreg_fitted'

. local ratio_resid = `se_mpg_cqreg_resid' / `se_mpg_qreg_resid'

. display "Fitted method ratio (cqreg/qreg): " %6.4f `ratio_fitted'
Fitted method ratio (cqreg/qreg): 0.4466

. display "Residual method ratio (cqreg/qreg): " %6.4f `ratio_resid'
Residual method ratio (cqreg/qreg): 1.0000

. 
. if abs(`ratio_resid' - 1) < 0.001 {
.     display _n "RESIDUAL METHOD MATCHES qreg vce(iid, residual)"

RESIDUAL METHOD MATCHES qreg vce(iid, residual)
. }

. else {
.     display _n "WARNING: Residual method mismatch"
. }

. 
. * ========================================
. * Robust VCE Comparison
. * ========================================
. display _n _n "=== ROBUST VCE COMPARISON ===" _n


=== ROBUST VCE COMPARISON ===


. 
. * qreg robust
. quietly qreg price mpg weight, quantile(0.5) vce(robust)

. display "qreg vce(robust):"
qreg vce(robust):

. display "  SE[mpg]    = " %12.6f _se[mpg]
  SE[mpg]    =    69.165112

. display "  SE[weight] = " %12.6f _se[weight]
  SE[weight] =     0.725288

. local se_mpg_qreg_robust = _se[mpg]

. local se_wt_qreg_robust = _se[weight]

. 
. * cqreg robust with fitted method (should match qreg robust)
. quietly cqreg price mpg weight, quantile(0.5) vce(robust) denmethod(fitted)

. display _n "cqreg vce(robust) denmethod(fitted):"

cqreg vce(robust) denmethod(fitted):

. display "  SE[mpg]    = " %12.6f _se[mpg]
  SE[mpg]    =    68.701908

. display "  SE[weight] = " %12.6f _se[weight]
  SE[weight] =     0.570222

. local se_mpg_cqreg_robust_fitted = _se[mpg]

. local se_wt_cqreg_robust_fitted = _se[weight]

. 
. * cqreg robust with residual method
. quietly cqreg price mpg weight, quantile(0.5) vce(robust) denmethod(residual)

. display _n "cqreg vce(robust) denmethod(residual):"

cqreg vce(robust) denmethod(residual):

. display "  SE[mpg]    = " %12.6f _se[mpg]
  SE[mpg]    =    85.176144

. display "  SE[weight] = " %12.6f _se[weight]
  SE[weight] =     0.630229

. local se_mpg_cqreg_robust_resid = _se[mpg]

. local se_wt_cqreg_robust_resid = _se[weight]

. 
. * Check matches
. display _n "=== Robust VCE Match Check ===" _n

=== Robust VCE Match Check ===


. local ratio_robust = `se_mpg_cqreg_robust_fitted' / `se_mpg_qreg_robust'

. display "Robust fitted method ratio (cqreg/qreg): " %6.4f `ratio_robust'
Robust fitted method ratio (cqreg/qreg): 0.9933

. 
. if abs(`ratio_robust' - 1) < 0.10 {
.     display _n "ROBUST VCE MATCHES qreg vce(robust) (within 10%)"

ROBUST VCE MATCHES qreg vce(robust) (within 10%)
. }

. else {
.     display _n "WARNING: Robust VCE mismatch - ratio: " %6.4f `ratio_robust'
. }

. 
. * ========================================
. * Cluster VCE (unique to cqreg)
. * ========================================
. display _n _n "=== CLUSTER VCE (cqreg only) ===" _n


=== CLUSTER VCE (cqreg only) ===


. 
. quietly cqreg price mpg weight, quantile(0.5) vce(cluster rep78)

. display "cqreg vce(cluster rep78):"
cqreg vce(cluster rep78):

. display "  SE[mpg]    = " %12.6f _se[mpg]
  SE[mpg]    =    29.429382

. display "  SE[weight] = " %12.6f _se[weight]
  SE[weight] =     0.605315

. display "  N_clust    = " e(N_clust)
  N_clust    = 5

. 
. display _n "Note: Stata's qreg does not support cluster VCE" _n

Note: Stata's qreg does not support cluster VCE


. 
. * ========================================
. * Summary
. * ========================================
. display _n "========================================"

========================================

. display "=== SUMMARY ==="
=== SUMMARY ===

. display "========================================" _n
========================================


. 
. display "IID methods:"
IID methods:

. display "  qreg fitted:     SE[mpg]=" %8.2f `se_mpg_qreg_fitted'
  qreg fitted:     SE[mpg]=  121.18

. display "  qreg residual:   SE[mpg]=" %8.2f `se_mpg_qreg_resid'
  qreg residual:   SE[mpg]=   85.18

. display "  cqreg fitted:    SE[mpg]=" %8.2f `se_mpg_cqreg_fitted'
  cqreg fitted:    SE[mpg]=   54.12

. display "  cqreg residual:  SE[mpg]=" %8.2f `se_mpg_cqreg_resid'
  cqreg residual:  SE[mpg]=   85.18

. 
. display _n "Robust methods:"

Robust methods:

. display "  qreg robust:     SE[mpg]=" %8.2f `se_mpg_qreg_robust'
  qreg robust:     SE[mpg]=   69.17

. display "  cqreg fitted:    SE[mpg]=" %8.2f `se_mpg_cqreg_robust_fitted'
  cqreg fitted:    SE[mpg]=   68.70

. display "  cqreg residual:  SE[mpg]=" %8.2f `se_mpg_cqreg_robust_resid'
  cqreg residual:  SE[mpg]=   85.18

. 
end of do-file
