
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_robust_debug.do 

. clear all

. set more off

. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. sysuse auto, clear
(1978 automobile data)

. drop if missing(price, mpg, weight, rep78)
(5 observations deleted)

. 
. display _n "=== DEBUGGING ROBUST VCE ===" _n

=== DEBUGGING ROBUST VCE ===


. 
. * First check what sparsity and bandwidth values we get from cqreg IID
. quietly cqreg price mpg weight, quantile(0.5) vce(iid)

. local sparsity = e(sparsity)

. local bandwidth = e(bwidth)

. di "cqreg IID - sparsity: " %12.4f `sparsity'
cqreg IID - sparsity:    4883.3016

. di "cqreg IID - bandwidth: " %12.6f `bandwidth'
cqreg IID - bandwidth:     0.240411

. 
. * Compute expected h_residual
. local h_residual = `bandwidth' * `sparsity'

. di "h_residual = bandwidth * sparsity = " %12.4f `h_residual'
h_residual = bandwidth * sparsity =    1174.0000

. 
. * Check residual distribution from qreg
. quietly qreg price mpg weight, quantile(0.5)

. predict double resid, residuals

. summarize resid, detail

                          Residuals
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1875.739      -1875.739
 5%    -1524.043      -1730.174
10%     -1197.13      -1622.783       Obs                  69
25%         -731      -1524.043       Sum of wgt.          69

50%            0                      Mean           945.1418
                        Largest       Std. dev.      2578.762
75%         1617       6821.652
90%     4966.348       7336.478       Variance        6650013
95%     6821.652           8330       Skewness       1.615391
99%     9959.087       9959.087       Kurtosis       5.050109

. di _n "Observations with |resid| < h_residual: "

Observations with |resid| < h_residual: 

. count if abs(resid) < `h_residual'
  42

. 
. * Check basis observations (residual ≈ 0)
. di _n "Basis observations (|resid| < 1e-8): "

Basis observations (|resid| < 1e-8): 

. count if abs(resid) < 1e-8
  3

. 
. * Check residuals in different ranges
. di _n "Residual distribution:"

Residual distribution:

. di "  |resid| < 100:    " _continue
  |resid| < 100:    
. count if abs(resid) < 100
  7

. di "  |resid| < 500:    " _continue
  |resid| < 500:    
. count if abs(resid) < 500
  23

. di "  |resid| < 1000:   " _continue
  |resid| < 1000:   
. count if abs(resid) < 1000
  40

. di "  |resid| < 2000:   " _continue
  |resid| < 2000:   
. count if abs(resid) < 2000
  53

. 
. * Now run cqreg with verbose to see more detail
. di _n "=== Running cqreg vce(robust) with verbose ==="

=== Running cqreg vce(robust) with verbose ===

. cqreg price mpg weight, quantile(0.5) vce(robust) verbose

------------------------------------------------------------
cqreg: C-Accelerated Quantile Regression
------------------------------------------------------------
Quantile:   .5
Depvar:     price
Indepvars:   mpg weight
Obs:        69
VCE type:   robust
Bandwidth:  Hall-Sheather
------------------------------------------------------------

cqreg: N=69, K=3, G=0, quantile=0.500
cqreg: IPM: iterations=12, converged=1, objective=58466.9565, time=0.000s
cqreg: Sparsity: 4883.3016, bandwidth: 0.240411
cqreg: Total time: 0.000s (load: 0.000, hdfe: 0.000, ipm: 0.000, vce: 0.000)

Median regression                                  Number of obs =         69
  Raw sum of deviations 65163    (about 5079     )
  Min sum of deviations 58467                      Pseudo R2     =     0.1028

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -64.08696   303.9741    -0.21   0.834    -670.9908    542.8169
      weight |   .5782609   2.100457     0.28   0.784    -3.615436    4.771958
       _cons |       4812    10168.4     0.47   0.638    -15489.86    25113.86
------------------------------------------------------------------------------

Iterations: 12, converged: yes
Total time:     0.000 seconds

. 
end of do-file
