
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_normal_scale.do 

. clear all

. set more off

. sysuse auto, clear
(1978 automobile data)

. drop if missing(price, mpg, weight, rep78)
(5 observations deleted)

. 
. qreg price mpg weight, quantile(0.5)

Iteration 1:  WLS sum of weighted deviations =  63341.574

Iteration 1:  Sum of abs. weighted deviations =  63536.156
Iteration 2:  Sum of abs. weighted deviations =  58812.858
Iteration 3:  Sum of abs. weighted deviations =  58491.205
Iteration 4:  Sum of abs. weighted deviations =  58480.736
Iteration 5:  Sum of abs. weighted deviations =  58477.095
Iteration 6:  Sum of abs. weighted deviations =  58466.957

Median regression                                   Number of obs =         69
  Raw sum of deviations    65163 (about 5079)
  Min sum of deviations 58466.96                    Pseudo R2     =     0.1028

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -64.08696   121.1752    -0.53   0.599    -306.0211    177.8472
      weight |   .5782609    .896591     0.64   0.521    -1.211841    2.368363
       _cons |       4812   5051.627     0.95   0.344    -5273.898     14897.9
------------------------------------------------------------------------------

. predict double resid, resid

. 
. local N = 69

. local q = 0.5

. 
. * Get qreg implied sparsity
. gen cons = 1

. mkmat mpg weight cons, matrix(X)

. matrix XtX = X' * X

. matrix XtX_inv = syminv(XtX)

. local v11 = e(V)[1,1]

. local implied_s = sqrt(`v11' / (0.25 * XtX_inv[1,1]))

. 
. display "qreg implied sparsity: " %12.4f `implied_s'
qreg implied sparsity:    6947.1948

. 
. * Check normal-scale estimator: sparsity = σ * sqrt(2π)
. summ resid

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       resid |         69    945.1418    2578.762  -1875.739   9959.087

. local sd = r(sd)

. local sparsity_normal = `sd' * sqrt(2 * c(pi))

. display _n "=== NORMAL-SCALE ESTIMATOR ==="

=== NORMAL-SCALE ESTIMATOR ===

. display "SD of residuals: " %12.4f `sd'
SD of residuals:    2578.7619

. display "Normal-scale sparsity: " %12.4f `sparsity_normal'
Normal-scale sparsity:    6463.9975

. display "Ratio to qreg: " %8.4f (`sparsity_normal' / `implied_s')
Ratio to qreg:   0.9304

. 
. * Try IQR-based scale (more robust)
. _pctile resid, percentile(25 75)

. local iqr = r(r2) - r(r1)

. local sigma_iqr = `iqr' / 1.349  // 1.349 = 2*Φ^{-1}(0.75) for normal

. local sparsity_iqr = `sigma_iqr' * sqrt(2 * c(pi))

. display _n "=== IQR-BASED SCALE ESTIMATOR ==="

=== IQR-BASED SCALE ESTIMATOR ===

. display "IQR: " %12.4f `iqr'
IQR:    2348.0000

. display "sigma_iqr: " %12.4f `sigma_iqr'
sigma_iqr:    1740.5486

. display "IQR sparsity: " %12.4f `sparsity_iqr'
IQR sparsity:    4362.9082

. display "Ratio to qreg: " %8.4f (`sparsity_iqr' / `implied_s')
Ratio to qreg:   0.6280

. 
. * Try MAD-based scale
. _pctile resid, percentile(50)

. local med = r(r1)

. gen abs_dev = abs(resid - `med')

. summ abs_dev

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     abs_dev |         69    1694.694    2154.581          0   9959.087

. _pctile abs_dev, percentile(50)

. local mad = r(r1)

. local sigma_mad = `mad' / 0.6745  // 0.6745 = Φ^{-1}(0.75) for normal

. local sparsity_mad = `sigma_mad' * sqrt(2 * c(pi))

. display _n "=== MAD-BASED SCALE ESTIMATOR ==="

=== MAD-BASED SCALE ESTIMATOR ===

. display "MAD: " %12.4f `mad'
MAD:     851.9565

. display "sigma_mad: " %12.4f `sigma_mad'
sigma_mad:    1263.0935

. display "MAD sparsity: " %12.4f `sparsity_mad'
MAD sparsity:    3166.1058

. display "Ratio to qreg: " %8.4f (`sparsity_mad' / `implied_s')
Ratio to qreg:   0.4557

. 
. * Try DQ method but with different bandwidth formulas
. local z_alpha = invnormal(0.975)

. local z_q = invnormal(`q')

. local phi_zq = normalden(`z_q')

. 
. * Hall-Sheather bandwidth
. local h_hs = `N'^(-1/3) * `z_alpha'^(2/3) * ((1.5 * `phi_zq'^2) / (2*`z_q'^2 
> + 1))^(1/3)

. 
. * Bofinger bandwidth  
. local h_bof = ((9/2) * `phi_zq'^4 * (2*`z_q'^2 + 1)^2 / `N')^(1/5)

. 
. display _n "=== DIFFERENCE QUOTIENT SPARSITY ==="

=== DIFFERENCE QUOTIENT SPARSITY ===

. display "h_hs = " %12.8f `h_hs'
h_hs =   0.23687515

. display "h_bof = " %12.8f `h_bof'
h_bof =   0.27771590

. 
. foreach bw in hs bof {
  2.     local h = `h_`bw''
  3.     local q_lo = `q' - `h'
  4.     local q_hi = `q' + `h'
  5.     _pctile resid, percentile(`=`q_lo'*100' `=`q_hi'*100')
  6.     local r_lo = r(r1)
  7.     local r_hi = r(r2)
  8.     local sparsity = (`r_hi' - `r_lo') / (2 * `h')
  9.     display "`bw' DQ sparsity: " %12.4f `sparsity' " ratio=" %8.4f (`spars
> ity'/`implied_s')
 10. }
hs DQ sparsity:    4733.0933 ratio=  0.6813
bof DQ sparsity:    5045.6632 ratio=  0.7263

. 
. * Key insight: what if Stata uses a fitted quantile function rather than resi
> duals?
. * The conditional density f_Y|X(ξ(τ)|X) at the τ-quantile
. * For IID VCE, this is constant across X, estimated from residuals
. 
. * Check what bandwidth would make DQ match qreg
. * sparsity = (r_hi - r_lo) / (2h)
. * So h = (r_hi - r_lo) / (2 * sparsity)
. _pctile resid, percentile(`=(`q'-`h_hs')*100' `=(`q'+`h_hs')*100')

. local r_lo = r(r1)

. local r_hi = r(r2)

. local h_implied = (`r_hi' - `r_lo') / (2 * `implied_s')

. display _n "=== FINDING MATCHING BANDWIDTH ==="

=== FINDING MATCHING BANDWIDTH ===

. display "Width (r_hi - r_lo): " %12.4f (`r_hi' - `r_lo')
Width (r_hi - r_lo):    2242.3043

. display "h that would match qreg: " %12.8f `h_implied'
h that would match qreg:   0.16138200

. display "h_hs: " %12.8f `h_hs'
h_hs:   0.23687515

. display "Ratio h_implied/h_hs: " %8.4f (`h_implied' / `h_hs')
Ratio h_implied/h_hs:   0.6813

. 
end of do-file
