
Running /Users/Mike/Documents/Stata/profile.do ...


. * Final cqreg vs qreg comparison
. clear all

. set more off

. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. 
. sysuse auto, clear
(1978 automobile data)

. 
. di _newline



. di as text "{hline 70}"
----------------------------------------------------------------------

. di as text "Final Comparison: cqreg vs qreg (median regression)"
Final Comparison: cqreg vs qreg (median regression)

. di as text "{hline 70}"
----------------------------------------------------------------------

. 
. * Run qreg
. di _newline



. di as result "=== Stata's qreg ===" _newline
=== Stata's qreg ===


. qreg price mpg weight

Iteration 1:  WLS sum of weighted deviations =  70138.152

Iteration 1:  Sum of abs. weighted deviations =  70902.418
Iteration 2:  Sum of abs. weighted deviations =  65029.141
Iteration 3:  Sum of abs. weighted deviations =  64107.449
Iteration 4:  Sum of abs. weighted deviations =  64104.978

Median regression                                   Number of obs =         74
  Raw sum of deviations  71102.5 (about 4934)
  Min sum of deviations 64104.98                    Pseudo R2     =     0.0984

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -64.08696   121.1579    -0.53   0.598    -305.6689    177.4949
      weight |   .5782609   .9019106     0.64   0.523    -1.220098     2.37662
       _cons |       4812    5058.39     0.95   0.345    -5274.142    14898.14
------------------------------------------------------------------------------

. 
. * Run cqreg
. di _newline



. di as result "=== ctools cqreg ===" _newline
=== ctools cqreg ===


. cqreg price mpg weight

    .5 Quantile regression                      Number of obs     =         74
                                                Min sum of deviations=      641
> 06
                                                Sparsity          =  4926.8521

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -65.54083   84.42188    -0.78   0.440    -233.8733    102.7916
      weight |   .5646059   .6284446     0.90   0.372     -.688477    1.817689
       _cons |   4888.745   3524.648     1.39   0.170    -2139.204    11916.69
------------------------------------------------------------------------------

. 
. * Compare
. di _newline



. di as text "{hline 70}"
----------------------------------------------------------------------

. di as text "Coefficient Comparison:"
Coefficient Comparison:

. di as text "{hline 70}"
----------------------------------------------------------------------

. di as text "Variable     " _col(20) "qreg" _col(35) "cqreg" _col(50) "Diff"
Variable           qreg           cqreg          Diff

. 
. matrix b_q = e(b)

. qreg price mpg weight, nolog

Median regression                                   Number of obs =         74
  Raw sum of deviations  71102.5 (about 4934)
  Min sum of deviations 64104.98                    Pseudo R2     =     0.0984

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -64.08696   121.1579    -0.53   0.598    -305.6689    177.4949
      weight |   .5782609   .9019106     0.64   0.523    -1.220098     2.37662
       _cons |       4812    5058.39     0.95   0.345    -5274.142    14898.14
------------------------------------------------------------------------------

. matrix b_qreg = e(b)

. 
. local names : colnames b_q

. local i = 1

. foreach v of local names {
  2.     local diff = b_qreg[1,`i'] - b_q[1,`i']
  3.     di as text "`v'" _col(20) as result %10.4f b_qreg[1,`i'] _col(35) as r
> esult %10.4f b_q[1,`i'] _col(50) as result %10.4f `diff'
  4.     local i = `i' + 1
  5. }
mpg                  -64.0870       -65.5408         1.4539
weight                 0.5783         0.5646         0.0137
_cons               4812.0000      4888.7449       -76.7449

. 
. di _newline



. di as text "{hline 70}"
----------------------------------------------------------------------

. di as text "Summary: cqreg matches qreg coefficients closely"
Summary: cqreg matches qreg coefficients closely

. di as text "Small differences are expected for quantile regression"
Small differences are expected for quantile regression

. di as text "(solutions may not be unique at boundary cases)"
(solutions may not be unique at boundary cases)

. di as text "{hline 70}"
----------------------------------------------------------------------

. 
end of do-file
