
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_verbose.do 

. clear all

. set more off

. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. 
. set obs 5000000
Number of observations (_N) was 0, now 5,000,000.

. set seed 12345

. gen x = rnormal()

. gen y = 2*x + rnormal()*5

. 
. display "=== RESIDUAL METHOD (1 solve) ==="
=== RESIDUAL METHOD (1 solve) ===

. cqreg y x, denmethod(residual) verbose

------------------------------------------------------------
cqreg: C-Accelerated Quantile Regression
------------------------------------------------------------
Quantile:   .5
Depvar:     y
Indepvars:   x
Obs:        5000000
VCE type:   iid
Density:    residual
Bandwidth:  Hall-Sheather
------------------------------------------------------------

cqreg: N=5000000, K=2, G=0, quantile=0.500
cqreg: IPM: iterations=19, converged=1, objective=9970517.0659, time=3.132s
cqreg: Sparsity: 12.4508, bandwidth: 0.005682 (method: residual)
cqreg: Total time: 3.615s (load: 0.042, hdfe: 0.000, ipm: 3.132, vce: 0.442)

Median regression                                  Number of obs =  5,000,000
  Raw sum of deviations 1.1e+07  (about -.001789 )
  Min sum of deviations 1.0e+07                    Pseudo R2     =     0.0718

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
           x |   1.999809   .0027847   718.14   0.000     1.994351    2.005267
       _cons |  -.0022945   .0027841    -0.82   0.410    -.0077512    .0031622
------------------------------------------------------------------------------

Iterations: 19, converged: yes
Total time:     3.622 seconds

. 
. display ""


. display "=== FITTED METHOD (3 solves) ==="
=== FITTED METHOD (3 solves) ===

. cqreg y x, denmethod(fitted) verbose

------------------------------------------------------------
cqreg: C-Accelerated Quantile Regression
------------------------------------------------------------
Quantile:   .5
Depvar:     y
Indepvars:   x
Obs:        5000000
VCE type:   iid
Density:    fitted
Bandwidth:  Hall-Sheather
------------------------------------------------------------

cqreg: N=5000000, K=2, G=0, quantile=0.500
cqreg: IPM: iterations=19, converged=1, objective=9970517.0659, time=3.135s
cqreg: Sparsity: 12.4451, bandwidth: 0.005682 (method: fitted)
cqreg: Total time: 8.135s (load: 0.042, hdfe: 0.000, ipm: 3.135, vce: 4.958)

Median regression                                  Number of obs =  5,000,000
  Raw sum of deviations 1.1e+07  (about -.001789 )
  Min sum of deviations 1.0e+07                    Pseudo R2     =     0.0718

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
           x |   1.999809   .0027834   718.48   0.000     1.994353    2.005264
       _cons |  -.0022945   .0027828    -0.82   0.410    -.0077487    .0031597
------------------------------------------------------------------------------

Iterations: 19, converged: yes
Total time:     8.151 seconds

. 
end of do-file
