
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_robust_vce.do 

. clear all

. set more off

. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. sysuse auto, clear
(1978 automobile data)

. drop if missing(price, mpg, weight, rep78)
(5 observations deleted)

. 
. display _n "=== TESTING ROBUST VCE ===" _n

=== TESTING ROBUST VCE ===


. 
. * First run qreg with default VCE (iid) to get baseline
. quietly qreg price mpg weight, quantile(0.5)

. local se_mpg_iid = _se[mpg]

. local se_wt_iid = _se[weight]

. display "qreg IID VCE:"
qreg IID VCE:

. display "  SE[mpg]    = " %12.6f `se_mpg_iid'
  SE[mpg]    =   121.175244

. display "  SE[weight] = " %12.6f `se_wt_iid'
  SE[weight] =     0.896591

. 
. * Now run with robust VCE
. quietly qreg price mpg weight, quantile(0.5) vce(robust)

. local se_mpg_robust = _se[mpg]

. local se_wt_robust = _se[weight]

. display _n "qreg Robust VCE:"

qreg Robust VCE:

. display "  SE[mpg]    = " %12.6f `se_mpg_robust'
  SE[mpg]    =    69.165112

. display "  SE[weight] = " %12.6f `se_wt_robust'
  SE[weight] =     0.725288

. 
. * Check ratio robust/iid
. display _n "Ratio (robust/iid):"

Ratio (robust/iid):

. display "  mpg:    " %8.4f (`se_mpg_robust'/`se_mpg_iid')
  mpg:      0.5708

. display "  weight: " %8.4f (`se_wt_robust'/`se_wt_iid')
  weight:   0.8089

. 
. * Now run cqreg with IID VCE
. quietly cqreg price mpg weight, quantile(0.5) vce(iid)

. local se_mpg_cqreg_iid = _se[mpg]

. local se_wt_cqreg_iid = _se[weight]

. display _n "cqreg IID VCE:"

cqreg IID VCE:

. display "  SE[mpg]    = " %12.6f `se_mpg_cqreg_iid'
  SE[mpg]    =    85.176144

. display "  SE[weight] = " %12.6f `se_wt_cqreg_iid'
  SE[weight] =     0.630229

. 
. * Now run cqreg with robust VCE
. quietly cqreg price mpg weight, quantile(0.5) vce(robust)

. local se_mpg_cqreg_robust = _se[mpg]

. local se_wt_cqreg_robust = _se[weight]

. display _n "cqreg Robust VCE:"

cqreg Robust VCE:

. display "  SE[mpg]    = " %12.6f `se_mpg_cqreg_robust'
  SE[mpg]    =    85.176144

. display "  SE[weight] = " %12.6f `se_wt_cqreg_robust'
  SE[weight] =     0.630229

. 
. * Compare cqreg robust to qreg robust
. display _n "Ratio cqreg/qreg (robust VCE):"

Ratio cqreg/qreg (robust VCE):

. display "  mpg:    " %12.6f (`se_mpg_cqreg_robust'/`se_mpg_robust')
  mpg:        1.231490

. display "  weight: " %12.6f (`se_wt_cqreg_robust'/`se_wt_robust')
  weight:     0.868936

. 
. * Also check what the variance matrix looks like
. display _n "=== Full ereturn list from qreg robust ==="

=== Full ereturn list from qreg robust ===

. quietly qreg price mpg weight, quantile(0.5) vce(robust)

. ereturn list

scalars:
               e(rank) =  3
           e(sparsity) =  .
             e(bwidth) =  .236875145458331
               e(df_m) =  2
               e(df_r) =  66
                e(f_r) =  .
                  e(N) =  69
              e(sum_w) =  69
                e(q_v) =  5079
                  e(q) =  .5
           e(sum_rdev) =  65163
           e(sum_adev) =  58466.95652173913
           e(convcode) =  0
               e(r2_p) =  .1027583671448655

macros:
                e(cmd) : "qreg"
            e(cmdline) : "qreg price mpg weight, quantile(0.5) vce(robust)"
            e(predict) : "qreg_p"
         e(properties) : "b V"
       e(marginsnotok) : "stdp stddp residuals"
            e(vcetype) : "Robust"
                e(vce) : "robust"
          e(denmethod) : "fitted"
           e(bwmethod) : "hsheather"
             e(depvar) : "price"

matrices:
                  e(b) :  1 x 3
                  e(V) :  3 x 3

functions:
             e(sample)   

. matrix list e(V), format(%12.6f)

symmetric e(V)[3,3]
                 mpg        weight         _cons
   mpg   4783.812714
weight     35.716392      0.526043
 _cons  -2.10255e+05  -2181.218593   1.07700e+07

. 
end of do-file
