
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do benchmark/benchmark_cqreg_5m.do 

. * Benchmark: cqreg vs qreg on 5 million observations with 2 variables
. * Purpose: Identify performance bottlenecks in cqreg
. 
. clear all

. set more off

. adopath + "build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "build"

. 
. * Set seed for reproducibility
. set seed 12345

. 
. di _newline "{hline 78}"

------------------------------------------------------------------------------

. di "BENCHMARK: cqreg vs qreg on 5 million observations"
BENCHMARK: cqreg vs qreg on 5 million observations

. di "{hline 78}"
------------------------------------------------------------------------------

. 
. * Generate dataset with 5 million observations
. di "Generating data..."
Generating data...

. timer clear 1

. timer on 1

. quietly set obs 5000000

. quietly gen double x = rnormal()

. quietly gen double y = 2 + 3*x + rnormal()*2

. timer off 1

. quietly timer list 1

. di "Data generation time: " %9.3f r(t1) " seconds"
Data generation time:     0.286 seconds

. 
. di _newline "{hline 78}"

------------------------------------------------------------------------------

. di "Dataset: N = " %12.0fc _N ", Variables: y, x"
Dataset: N =    5,000,000, Variables: y, x

. di "{hline 78}"
------------------------------------------------------------------------------

. 
. * Benchmark qreg
. di _newline "{hline 78}"

------------------------------------------------------------------------------

. di "QREG (Stata built-in)"
QREG (Stata built-in)

. di "{hline 78}"
------------------------------------------------------------------------------

. timer clear 2

. timer on 2

. quietly qreg y x

. timer off 2

. quietly timer list 2

. local qreg_time = r(t2)

. di "qreg time: " %9.3f `qreg_time' " seconds"
qreg time:     9.965 seconds

. 
. matrix qreg_b = e(b)

. matrix qreg_V = e(V)

. local qreg_N = e(N)

. local qreg_sum_adev = e(sum_adev)

. local qreg_sum_rdev = e(sum_rdev)

. local qreg_r2_p = e(r2_p)

. 
. di "Coefficients:"
Coefficients:

. di "  x:     " %12.6f qreg_b[1,1]
  x:         2.999924

. di "  _cons: " %12.6f qreg_b[1,2]
  _cons:     1.999082

. di "Sum of absolute deviations: " %12.4f `qreg_sum_adev'
Sum of absolute deviations: 3988206.8264

. di "Pseudo R2: " %12.6f `qreg_r2_p'
Pseudo R2:     0.445437

. 
. * Benchmark cqreg with verbose timing
. di _newline "{hline 78}"

------------------------------------------------------------------------------

. di "CQREG (C-accelerated) with verbose timing"
CQREG (C-accelerated) with verbose timing

. di "{hline 78}"
------------------------------------------------------------------------------

. timer clear 3

. timer on 3

. cqreg y x, verbose

------------------------------------------------------------
cqreg: C-Accelerated Quantile Regression
------------------------------------------------------------
Quantile:   .5
Depvar:     y
Indepvars:   x
Obs:        5000000
VCE type:   iid
Density:    fitted
Bandwidth:  Hall-Sheather
------------------------------------------------------------

cqreg: N=5000000, K=2, G=0, quantile=0.500
FN Timing (N=5000000, K=2, iters=18): total=0.961s
  init=0.024s  scaling=0.039
> s  X'DX=0.024s  chol=0.079s
  direction=0.146s  steplength=0.066s  corrector=
> 0.485s  update=0.099s
  Corrector breakdown:
    loop1=0.141s  loop2=0.060s  
> gemv1=0.059s  gemv2=0.012s  loop3=0.151s  step=0.062s
cqreg: IPM: iterations=18, converged=1, objective=3988206.8264, time=0.997s
FN Timing (N=5000000, K=2, iters=50): total=4.833s
  init=0.027s  scaling=0.125
> s  X'DX=0.146s  chol=0.226s
  direction=0.411s  steplength=1.196s  corrector=
> 2.424s  update=0.277s
  Corrector breakdown:
    loop1=0.396s  loop2=0.179s  
> gemv1=0.167s  gemv2=0.044s  loop3=0.431s  step=1.199s
FN Timing (N=5000000, K=2, iters=52): total=5.021s
  init=0.027s  scaling=0.130
> s  X'DX=0.151s  chol=0.234s
  direction=0.425s  steplength=1.242s  corrector=
> 2.517s  update=0.294s
  Corrector breakdown:
    loop1=0.411s  loop2=0.186s  
> gemv1=0.173s  gemv2=0.045s  loop3=0.448s  step=1.246s
cqreg: Sparsity: 4.9780, bandwidth: 0.005682 (method: fitted)
cqreg: Total time: 4.129s (load: 0.447, hdfe: 0.000, ipm: 0.997, vce: 2.686)

Median regression                                  Number of obs =  5,000,000
  Raw sum of deviations 7.2e+06  (about 2.00094  )
  Min sum of deviations 4.0e+06                    Pseudo R2     =     0.4454

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
           x |   2.999924   .0011134  2694.48   0.000     2.997741    3.002106
       _cons |   1.999082   .0011131  1795.93   0.000     1.996901    2.001264
------------------------------------------------------------------------------

Iterations: 18, converged: yes
Total time:     4.146 seconds

. timer off 3

. quietly timer list 3

. local cqreg_time = r(t3)

. di "cqreg total time: " %9.3f `cqreg_time' " seconds"
cqreg total time:     4.347 seconds

. 
. matrix cqreg_b = e(b)

. matrix cqreg_V = e(V)

. local cqreg_N = e(N)

. local cqreg_sum_adev = e(sum_adev)

. local cqreg_sum_rdev = e(sum_rdev)

. local cqreg_r2_p = e(r2_p)

. 
. * Run cqreg a second time for warm cache comparison
. di _newline "{hline 78}"

------------------------------------------------------------------------------

. di "CQREG (warm cache, second run)"
CQREG (warm cache, second run)

. di "{hline 78}"
------------------------------------------------------------------------------

. timer clear 4

. timer on 4

. quietly cqreg y x, verbose

. timer off 4

. quietly timer list 4

. local cqreg_time2 = r(t4)

. di "cqreg time (warm): " %9.3f `cqreg_time2' " seconds"
cqreg time (warm):     4.290 seconds

. 
. * Summary comparison
. di _newline "{hline 78}"

------------------------------------------------------------------------------

. di "PERFORMANCE SUMMARY"
PERFORMANCE SUMMARY

. di "{hline 78}"
------------------------------------------------------------------------------

. di "              qreg         cqreg        speedup"
              qreg         cqreg        speedup

. di "{hline 60}"
------------------------------------------------------------

. di "Time:     " %9.3f `qreg_time' "s    " %9.3f `cqreg_time' "s    " %9.2f `q
> reg_time'/`cqreg_time' "x"
Time:         9.965s        4.347s         2.29x

. di ""


. di "Coefficient Comparison (should match closely):"
Coefficient Comparison (should match closely):

. di "              qreg           cqreg          diff"
              qreg           cqreg          diff

. di "{hline 60}"
------------------------------------------------------------

. di "x:      " %12.6f qreg_b[1,1] "  " %12.6f cqreg_b[1,1] "  " %12.6e qreg_b[
> 1,1]-cqreg_b[1,1]
x:          2.999924      2.999924  -1.33227e-15

. di "_cons:  " %12.6f qreg_b[1,2] "  " %12.6f cqreg_b[1,2] "  " %12.6e qreg_b[
> 1,2]-cqreg_b[1,2]
_cons:      1.999082      1.999082   6.66134e-16

. di ""


. di "Standard Error Comparison:"
Standard Error Comparison:

. di "              qreg           cqreg          diff"
              qreg           cqreg          diff

. di "{hline 60}"
------------------------------------------------------------

. di "x:      " %12.6f sqrt(qreg_V[1,1]) "  " %12.6f sqrt(cqreg_V[1,1]) "  " %1
> 2.6e sqrt(qreg_V[1,1])-sqrt(cqreg_V[1,1])
x:          0.001113      0.001113   5.98228e-13

. di "_cons:  " %12.6f sqrt(qreg_V[2,2]) "  " %12.6f sqrt(cqreg_V[2,2]) "  " %1
> 2.6e sqrt(qreg_V[2,2])-sqrt(cqreg_V[2,2])
_cons:      0.001113      0.001113   5.98097e-13

. di ""


. di "Model Statistics:"
Model Statistics:

. di "              qreg           cqreg          diff"
              qreg           cqreg          diff

. di "{hline 60}"
------------------------------------------------------------

. di "N:      " %12.0f `qreg_N' "  " %12.0f `cqreg_N' "  " %12.0f `qreg_N'-`cqr
> eg_N'
N:           5000000       5000000             0

. di "sum_adev:" %12.4f `qreg_sum_adev' "  " %12.4f `cqreg_sum_adev' "  " %12.4
> e `qreg_sum_adev'-`cqreg_sum_adev'
sum_adev:3988206.8264  3988206.8264    8.8476e-09

. di "Pseudo R2:" %12.6f `qreg_r2_p' "  " %12.6f `cqreg_r2_p' "  " %12.6e `qreg
> _r2_p'-`cqreg_r2_p'
Pseudo R2:    0.445437      0.445437   2.59237e-14

. 
. di _newline "{hline 78}"

------------------------------------------------------------------------------

. di "END BENCHMARK"
END BENCHMARK

. di "{hline 78}"
------------------------------------------------------------------------------

. 
end of do-file
