
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do benchmark/benchmark_cqreg_5m.do 

. * Benchmark: cqreg vs qreg on 5 million observations with 2 variables
. * Purpose: Identify performance bottlenecks in cqreg
. 
. clear all

. set more off

. adopath + "build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "build"

. 
. * Set seed for reproducibility
. set seed 12345

. 
. di _newline "{hline 78}"

------------------------------------------------------------------------------

. di "BENCHMARK: cqreg vs qreg on 5 million observations"
BENCHMARK: cqreg vs qreg on 5 million observations

. di "{hline 78}"
------------------------------------------------------------------------------

. 
. * Generate dataset with 5 million observations
. di "Generating data..."
Generating data...

. timer clear 1

. timer on 1

. quietly set obs 5000000

. quietly gen double x = rnormal()

. quietly gen double y = 2 + 3*x + rnormal()*2

. timer off 1

. quietly timer list 1

. di "Data generation time: " %9.3f r(t1) " seconds"
Data generation time:     0.288 seconds

. 
. di _newline "{hline 78}"

------------------------------------------------------------------------------

. di "Dataset: N = " %12.0fc _N ", Variables: y, x"
Dataset: N =    5,000,000, Variables: y, x

. di "{hline 78}"
------------------------------------------------------------------------------

. 
. * Benchmark qreg
. di _newline "{hline 78}"

------------------------------------------------------------------------------

. di "QREG (Stata built-in)"
QREG (Stata built-in)

. di "{hline 78}"
------------------------------------------------------------------------------

. timer clear 2

. timer on 2

