
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do /tmp/benchmark_ips4o_large.do 

. * Large-scale IPS4o benchmark
. clear all

. adopath + "build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "build"

. cap program drop ctools_plugin

. program ctools_plugin, plugin using("build/ctools_mac_arm.plugin")

. 
. di "Large-scale IPS4o Benchmark"
Large-scale IPS4o Benchmark

. di "======================================================================"
======================================================================

. 
. local sizes 5000000 10000000 20000000

. 
. foreach n of local sizes {
  2.     di _n "N = " %12.0fc `n' " observations"
  3.     di "------------------------------------------------------------------
> ----"
  4. 
.     clear
  5.     set seed 12345
  6.     set obs `n'
  7.     gen double value = rnormal()
  8. 
.     * LSD
.     preserve
  9.     timer clear 1
 10.     timer on 1
 11.     quietly csort value, algorithm(lsd)
 12.     timer off 1
 13.     quietly timer list 1
 14.     di "  LSD:   " %8.3f r(t1) " seconds"
 15.     local t_lsd = r(t1)
 16.     restore
 17. 
.     * IPS4o
.     preserve
 18.     timer clear 1
 19.     timer on 1
 20.     quietly csort value, algorithm(ips4o)
 21.     timer off 1
 22.     quietly timer list 1
 23.     di "  IPS4o: " %8.3f r(t1) " seconds"
 24.     local t_ips4o = r(t1)
 25.     restore
 26. 
.     * Stata
.     preserve
 27.     timer clear 1
 28.     timer on 1
 29.     quietly sort value
 30.     timer off 1
 31.     quietly timer list 1
 32.     di "  Stata: " %8.3f r(t1) " seconds"
 33.     local t_stata = r(t1)
 34.     restore
 35. 
.     di "  Speedup vs Stata: " %5.2f (`t_stata' / `t_ips4o') "x"
 36.     di "  Speedup vs LSD:   " %5.2f (`t_lsd' / `t_ips4o') "x"
 37. }

N =    5,000,000 observations
----------------------------------------------------------------------
Number of observations (_N) was 0, now 5,000,000.
  LSD:      0.159 seconds
  IPS4o:    0.135 seconds
  Stata:    0.513 seconds
  Speedup vs Stata:  3.80x
  Speedup vs LSD:    1.18x

N =   10,000,000 observations
----------------------------------------------------------------------
Number of observations (_N) was 0, now 10,000,000.
  LSD:      0.344 seconds
  IPS4o:    0.244 seconds
  Stata:    1.398 seconds
  Speedup vs Stata:  5.73x
  Speedup vs LSD:    1.41x

N =   20,000,000 observations
----------------------------------------------------------------------
Number of observations (_N) was 0, now 20,000,000.
  LSD:      0.698 seconds
  IPS4o:    0.488 seconds
  Stata:    3.132 seconds
  Speedup vs Stata:  6.42x
  Speedup vs LSD:    1.43x

. 
. di _n "======================================================================
> "

======================================================================

. di "Benchmark complete"
Benchmark complete

. 
end of do-file
