
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do benchmark/benchmark_creghdfe.do 

. *****************************************************************************
> ***
. * benchmark_creghdfe.do
. * Speed benchmark comparing reghdfe and creghdfe performance
. * 50M observations, 2 fixed effects
. *****************************************************************************
> ***
. 
. clear all

. set more off

. 
. * Add ctools build directory to adopath
. adopath ++ "./build"
  [1]              "./build"
  [2]  (BASE)      "/Applications/Stata/ado/base/"
  [3]  (SITE)      "/Applications/Stata/ado/site/"
  [4]              "."
  [5]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [6]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [7]  (OLDPLACE)  "~/ado/"

. 
. *****************************************************************************
> ***
. * Configuration
. *****************************************************************************
> ***
. 
. local N = 50000000   // 50 million observations

. 
. di as txt _n _n




. di as txt "==================================================================
> =============="
===============================================================================
> =

. di as txt "                    REGHDFE vs CREGHDFE SPEED BENCHMARK"
                    REGHDFE vs CREGHDFE SPEED BENCHMARK

. di as txt "==================================================================
> =============="
===============================================================================
> =

. di as txt "Date: `c(current_date)' `c(current_time)'"
Date:  6 Jan 2026 16:13:12

. di as txt "Stata: `c(stata_version)' `c(processors)'-core"
Stata: 18.5 12-core

. di as txt "Observations: " %12.0fc `N'
Observations:   50,000,000

. di as txt "==================================================================
> =============="
===============================================================================
> =

. 
. *****************************************************************************
> ***
. * Generate simulated data
. *****************************************************************************
> ***
. 
. di as txt _n "{hline 80}"

-------------------------------------------------------------------------------
> -

. di as txt "Generating simulated data with N = " %12.0fc `N'
Generating simulated data with N =   50,000,000

. di as txt "{hline 80}"
-------------------------------------------------------------------------------
> -

. 
. set seed 12345

. set obs `N'
Number of observations (_N) was 0, now 50,000,000.

. 
. * Create outcome and regressors
. gen double y = rnormal()

. gen double x1 = rnormal()

. gen double x2 = rnormal()

. gen double x3 = rnormal()

. gen double x4 = rnormal()

. gen double x5 = rnormal()

. 
. * Create fixed effect variables
. * FE1: ~50,000 groups (like firm)
. local n_fe1 = max(50000, floor(`N'/1000))

. gen long fe1 = ceil(runiform() * `n_fe1')

. 
. * FE2: ~100 groups (like year)
. gen int fe2 = ceil(runiform() * 100)

. 
. * Create cluster variable (same as fe1 for clustered tests)
. gen long cluster_id = fe1

. 
. * Add FE effects to outcome
. tempvar fe1_effect fe2_effect

. bysort fe1: gen double `fe1_effect' = rnormal() if _n == 1
(49,950,000 missing values generated)

. bysort fe1: replace `fe1_effect' = `fe1_effect'[1]
(49950000 real changes made)

. bysort fe2: gen double `fe2_effect' = rnormal() if _n == 1
(49,999,900 missing values generated)

. bysort fe2: replace `fe2_effect' = `fe2_effect'[1]
(49999900 real changes made)

. replace y = y + 0.5*x1 + 0.3*x2 - 0.2*x3 + 0.1*x4 - 0.4*x5 + `fe1_effect' + `
> fe2_effect'
(50,000,000 real changes made)

. 
. compress
  variable fe2 was int now byte
  (50,000,000 bytes saved)

. 
. di as txt "Data generation complete."
Data generation complete.

. di as txt "  Observations: " %12.0fc _N
  Observations:   50,000,000

. di as txt "  FE1 groups:   " %12.0fc `n_fe1'
  FE1 groups:         50,000

. di as txt "  FE2 groups:   100"
  FE2 groups:   100

. 
. *****************************************************************************
> ***
. * Initialize results storage
. *****************************************************************************
> ***
. 
. * Store results: test_name, time_reghdfe, time_creghdfe, speedup
. tempname results

. matrix `results' = J(4, 4, .)

. matrix colnames `results' = test time_reghdfe time_creghdfe speedup

. local row = 0

. 
. *****************************************************************************
> ***
. * Test 1: 2 FEs, unadjusted VCE
. *****************************************************************************
> ***
. 
. local ++row

. di as txt _n "{hline 80}"

-------------------------------------------------------------------------------
> -

. di as txt "Test 1: 2 FEs (fe1 fe2), unadjusted VCE"
Test 1: 2 FEs (fe1 fe2), unadjusted VCE

. di as txt "{hline 80}"
-------------------------------------------------------------------------------
> -

. 
. timer clear 1

. timer clear 2

. 
. * Run reghdfe
. di as txt "Running reghdfe..."
Running reghdfe...

. timer on 1

. qui reghdfe y x1 x2 x3 x4 x5, absorb(fe1 fe2)

. timer off 1

. 
. * Store reghdfe results for comparison
. tempname b_reghdfe V_reghdfe

. matrix `b_reghdfe' = e(b)

. matrix `V_reghdfe' = e(V)

. local N_reghdfe = e(N)

. local r2_reghdfe = e(r2)

. local rmse_reghdfe = e(rmse)

. 
. * Run creghdfe
. di as txt "Running creghdfe..."
Running creghdfe...

. timer on 2

. qui creghdfe y x1 x2 x3 x4 x5, absorb(fe1 fe2)
invalid syntax
r(198);

end of do-file
r(198);
