
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do benchmark/benchmark_cimport.do 

. *****************************************************************************
> ***
. * benchmark_cimport.do
. * Speed benchmark comparing import delimited and cimport performance
. * 50M observations, 10 variables of varying types
. *****************************************************************************
> ***
. 
. clear all

. set more off

. 
. * Add ctools build directory to adopath
. adopath ++ "./build"
  [1]              "./build"
  [2]  (BASE)      "/Applications/Stata/ado/base/"
  [3]  (SITE)      "/Applications/Stata/ado/site/"
  [4]              "."
  [5]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [6]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [7]  (OLDPLACE)  "~/ado/"

. 
. *****************************************************************************
> ***
. * Configuration
. *****************************************************************************
> ***
. 
. local N = 50000000   // 50 million observations

. local testfile "benchmark_test_data.csv"

. 
. di as txt _n _n




. di as txt "==================================================================
> =============="
===============================================================================
> =

. di as txt "              IMPORT DELIMITED vs CIMPORT SPEED BENCHMARK"
              IMPORT DELIMITED vs CIMPORT SPEED BENCHMARK

. di as txt "==================================================================
> =============="
===============================================================================
> =

. di as txt "Date: `c(current_date)' `c(current_time)'"
Date:  6 Jan 2026 16:15:36

. di as txt "Stata: `c(stata_version)' `c(processors)'-core"
Stata: 18.5 12-core

. di as txt "Observations: " %12.0fc `N'
Observations:   50,000,000

. di as txt "Variables: 10 (mixed types: double, int, string)"
Variables: 10 (mixed types: double, int, string)

. di as txt "==================================================================
> =============="
===============================================================================
> =

. 
. *****************************************************************************
> ***
. * Generate test CSV file
. *****************************************************************************
> ***
. 
. di as txt _n "{hline 80}"

-------------------------------------------------------------------------------
> -

. di as txt "Phase 1: Generating test CSV file"
Phase 1: Generating test CSV file

. di as txt "{hline 80}"
-------------------------------------------------------------------------------
> -

. 
. * First create the data in Stata
. set seed 54321

. set obs `N'
Number of observations (_N) was 0, now 50,000,000.

. 
. * Create variables of varying types
. * 4 doubles (continuous)
. gen double var_dbl1 = rnormal()

. gen double var_dbl2 = rnormal() * 1000

. gen double var_dbl3 = runiform() * 10000

. gen double var_dbl4 = rnormal() + runiform() * 100

. 
. * 3 integers
. gen int var_int1 = ceil(runiform() * 1000)

. gen long var_int2 = ceil(runiform() * 1000000)

. gen byte var_int3 = ceil(runiform() * 100)

. 
. * 3 strings of varying lengths
. gen str10 var_str1 = "str" + string(ceil(runiform() * 10000))

. gen str20 var_str2 = "category" + string(ceil(runiform() * 100))

. gen str5 var_str3 = substr("ABCDEFGHIJ", ceil(runiform() * 10), 1) + string(c
> eil(runiform() * 1000))

. 
. compress
  variable var_str1 was str10 now str8
  variable var_str2 was str20 now str11
  (550,000,000 bytes saved)

. 
. di as txt "Data generated in memory. Exporting to CSV..."
Data generated in memory. Exporting to CSV...

. 
. * Export to CSV using Stata's export delimited
. timer clear 99

. timer on 99

