
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do validation/benchmark_ips4o.do 

. /****************************************************************************
> ***
>     benchmark_ips4o.do
>     Performance comparison of IPS4o vs other sort algorithms
> *****************************************************************************
> **/
. 
. clear all

. set more off

. 
. * Setup
. adopath + "build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "build"

. cap program drop ctools_plugin

. program ctools_plugin, plugin using("build/ctools_mac_arm.plugin")

. 
. * Results storage
. tempname results

. postfile `results' str20 algorithm obs double time using "benchmark_ips4o_res
> ults.dta", replace
(file benchmark_ips4o_results.dta not found)

. 
. * Test sizes
. local sizes 10000 50000 100000 500000 1000000 2000000

. 
. di as txt _n "===============================================================
> ======="

======================================================================

. di as txt "IPS4o Performance Benchmark"
IPS4o Performance Benchmark

. di as txt "==================================================================
> ===="
======================================================================

. 
. foreach n of local sizes {
  2.     di as txt _n "Testing with `n' observations..."
  3.     di as txt "--------------------------------------------------"
  4. 
.     * Generate random data
.     clear
  5.     set seed 12345
  6.     set obs `n'
  7.     gen double value = rnormal()
  8. 
.     * Test each algorithm
.     foreach alg in lsd ips4o sample {
  9.         preserve
 10. 
.         timer clear 1
 11.         timer on 1
 12.         quietly csort value, algorithm(`alg')
 13.         timer off 1
 14. 
.         quietly timer list 1
 15.         local t = r(t1)
 16. 
.         di as txt "  `alg':" _col(15) %8.3f `t' " seconds"
 17. 
.         post `results' ("`alg'") (`n') (`t')
 18. 
.         restore
 19.     }
 20. 
.     * Also test native Stata sort for comparison
.     preserve
 21. 
.     timer clear 1
 22.     timer on 1
 23.     quietly sort value
 24.     timer off 1
 25. 
.     quietly timer list 1
 26.     local t = r(t1)
 27. 
.     di as txt "  stata:" _col(15) %8.3f `t' " seconds"
 28. 
.     post `results' ("stata") (`n') (`t')
 29. 
.     restore
 30. }

Testing with 10000 observations...
--------------------------------------------------
Number of observations (_N) was 0, now 10,000.
  lsd:           0.001 seconds
  ips4o:         0.001 seconds
  sample:        0.008 seconds
  stata:         0.001 seconds

Testing with 50000 observations...
--------------------------------------------------
Number of observations (_N) was 0, now 50,000.
  lsd:           0.002 seconds
  ips4o:         0.002 seconds
  sample:        0.256 seconds
  stata:         0.004 seconds

Testing with 100000 observations...
--------------------------------------------------
Number of observations (_N) was 0, now 100,000.
  lsd:           0.004 seconds
  ips4o:         0.004 seconds
  sample:        0.009 seconds
  stata:         0.005 seconds

Testing with 500000 observations...
--------------------------------------------------
Number of observations (_N) was 0, now 500,000.
  lsd:           0.012 seconds
  ips4o:         0.011 seconds
  sample:        0.032 seconds
  stata:         0.022 seconds

Testing with 1000000 observations...
--------------------------------------------------
Number of observations (_N) was 0, now 1,000,000.
  lsd:           0.024 seconds
  ips4o:         0.021 seconds
  sample:        0.057 seconds
  stata:         0.042 seconds

Testing with 2000000 observations...
--------------------------------------------------
Number of observations (_N) was 0, now 2,000,000.
  lsd:           0.057 seconds
  ips4o:         0.048 seconds
