
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do cmerge_bench_new.do 

. clear all

. adopath + build
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "build"

. set obs 50000000
Number of observations (_N) was 0, now 50,000,000.

. gen i = _n

. forval i=1/10 {
  2. gen x`i' = rnormal()
  3. }

. gen g = ceil(runiform()*100000)

. tempfile t1

. save `t1'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St88996.000001 saved
    as .dta format

. clear

. set obs 10000
Number of observations (_N) was 0, now 10,000.

. gen g = _n

. forval i=1/10 {
  2. gen y`i' = rnormal()
  3. }

. sort y1

. tempfile t2

. save `t2'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St88996.000002 saved
    as .dta format

. use `t1', clear

. merge m:1 g using `t2'

    Result                      Number of obs
    -----------------------------------------
    Not matched                    44,998,988
        from master                44,998,988  (_merge==1)
        from using                          0  (_merge==2)

    Matched                         5,001,012  (_merge==3)
    -----------------------------------------

. use `t1', clear

. cmerge m:1 g using `t2', verbose

------------------------------------------------------------
cmerge: Optimized C-Accelerated Merge
------------------------------------------------------------
Merge type:  m:1
Key vars:    g
Using file:  /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St88996.000002
Master obs:  50000000
Master vars: 12
------------------------------------------------------------

Phase 1: Loading using dataset (keys + keepusing only)...
  Using: 10000 obs, keeping 1 keys + 10 keepusing vars

Phase 2: Executing merge with streaming...
build/cmerge.ado

    Result                      Number of obs
    -----------------------------------------
    Not matched                    44,998,988
        from master                44,998,988  (_merge==1)
        from using                          0  (_merge==2)

    Matched                         5,001,012  (_merge==3)
    -----------------------------------------

cmerge timing breakdown:

  [Phase 1: Load using data into C]
    Load keys:              0.0000 sec
    Load keepusing:         0.0002 sec
    Sort using:             0.0002 sec
    Apply permutation:      0.0001 sec
    --------------------------------
    Phase 1 C total:        0.0005 sec

  [Phase 2: Execute merge]
    Load master keys:       0.2300 sec
    Sort master:            0.6440 sec
    Merge join:             0.0749 sec
    Reorder output:         0.0000 sec
    Write keepusing:        0.2104 sec
    Stream master (12 vars):  2.6224 sec
    Cleanup:                0.0521 sec
    --------------------------------
    Phase 2 C total:        3.9373 sec

  [Outside C code]
    Pre-plugin1 ado:        0.4650 sec  (load using.dta, parse)
    Plugin1 overhead:       0.0005 sec  (Stata's plugin framework)
    Inter-plugin ado:       2.2390 sec  (breakdown below)
      - restore:            0.4310 sec
      - st_addvar:          1.6240 sec  (create placeholders, _merge)
      - st_store row:       0.1840 sec  (fill _orig_row)
      - set obs:            0.0000 sec  (expand to max output)
    Plugin2 overhead:       0.0007 sec  (Stata's plugin framework)
    Post-plugin ado:        0.3430 sec  (labels, cleanup)
    --------------------------------
    Non-C total:            3.0482 sec

  [Summary]
    Wall clock total:       6.9860 sec
    C code:                   56.4%%
    Plugin overhead:           0.0%%
    Ado-file overhead:        43.6%%

. 
end of do-file
