
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do /private/tmp/compare_output.do 

. * Compare civreghdfe and ivreghdfe output character-by-character
. clear all

. set more off

. 
. * Load civreghdfe from build directory
. adopath ++ "/Users/Mike/Documents/GitHub/stata-ctools/build"
  [1]              "/Users/Mike/Documents/GitHub/stata-ctools/build"
  [2]  (BASE)      "/Applications/Stata/ado/base/"
  [3]  (SITE)      "/Applications/Stata/ado/site/"
  [4]              "."
  [5]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [6]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [7]  (OLDPLACE)  "~/ado/"

. 
. * Load test data
. sysuse auto, clear
(1978 automobile data)

. 
. * Create instrument
. gen weight2 = weight^2

. 
. * Capture ivreghdfe output
. log using "/private/tmp/ivreghdfe_output.log", text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /private/tmp/ivreghdfe_output.log
  log type:  text
 opened on:  13 Jan 2026, 16:48:57

. ivreghdfe price (mpg = weight2), absorb(foreign) first
(MWFE estimator converged in 1 iterations)

First-stage regressions
-----------------------


First-stage regression of mpg:

Statistics consistent for homoskedasticity only
Number of obs =                     74
------------------------------------------------------------------------------
         mpg | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     weight2 |  -9.87e-07   1.07e-07    -9.20   0.000    -1.20e-06   -7.73e-07
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,    71) =    84.64
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,    71) =    84.64
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,    71)  P-val | SW Chi-sq(  1) P-val | SW F(  1,    71)
mpg          |      84.64    0.0000 |       88.21   0.0000 |       84.64

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=40.24    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      84.64

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,71)=       82.55     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     86.03     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     39.78     P-val=0.0000

Number of observations               N  =         74
Number of regressors                 K  =          1
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          1
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =       74
                                                      F(  1,    71) =    40.94
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.0677
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.0677
Residual SS             =  590676824.6                Root MSE      =     2884

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |   -550.688   86.06571    -6.40   0.000    -722.2981   -379.0778
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          40.242
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               84.637
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight2
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+

. log close
      name:  <unnamed>
       log:  /private/tmp/ivreghdfe_output.log
  log type:  text
 closed on:  13 Jan 2026, 16:48:58
-------------------------------------------------------------------------------

. 
. * Capture civreghdfe output
. log using "/private/tmp/civreghdfe_output.log", text replace
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /private/tmp/civreghdfe_output.log
  log type:  text
 opened on:  13 Jan 2026, 16:48:58

. civreghdfe price (mpg = weight2), absorb(foreign) first

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =       74
                                                      F(  1,    71) =    40.94
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.0677
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.0677
Residual SS             =  590676824.6                Root MSE      =     2884

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |   -550.688   86.06571    -6.40   0.000    -722.2981   -379.0778
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          40.242
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               84.637
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight2
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+


. log close
      name:  <unnamed>
       log:  /private/tmp/civreghdfe_output.log
  log type:  text
 closed on:  13 Jan 2026, 16:48:58
-------------------------------------------------------------------------------

. 
. di "Done - compare the log files"
Done - compare the log files

. 
end of do-file
