
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do /tmp/debug_precision2.do 

. * Debug test to find precision loss in cmerge
. clear all

. set more off

. adopath + "/Users/Mike/Documents/GitHub/stata-ctools/build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/Users/Mike/Documents/GitHub/stata-ctools/build"

. 
. * Test: Float variable type mismatch
. di _n "=== Key Finding: Variable Type Mismatch ==="

=== Key Finding: Variable Type Mismatch ===

. clear

. set obs 3
Number of observations (_N) was 0, now 3.

. gen long id = _n

. gen float val_float = 3.14159265358979

. di "Original float value (high precision display):"
Original float value (high precision display):

. format val_float %25.17g

. list id val_float, noobs

  +-------------------------+
  | id            val_float |
  |-------------------------|
  |  1   3.1415927410125732 |
  |  2   3.1415927410125732 |
  |  3   3.1415927410125732 |
  +-------------------------+

. 
. tempfile master

. save `master'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St88818.000001 saved
    as .dta format

. 
. clear

. set obs 3
Number of observations (_N) was 0, now 3.

. gen long id = _n

. gen float using_float = 2.71828182845905

. di _n "Using dataset float value (high precision display):"

Using dataset float value (high precision display):

. format using_float %25.17g

. list id using_float, noobs

  +-------------------------+
  | id          using_float |
  |-------------------------|
  |  1   2.7182817459106445 |
  |  2   2.7182817459106445 |
  |  3   2.7182817459106445 |
  +-------------------------+

. local using_val = using_float[1]

. di "Raw value: " %25.17g `using_val'
Raw value:         2.718281745910645

. tempfile using_data

. save `using_data'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St88818.000002 saved
    as .dta format

. 
. * Stata merge
. use `master', clear

. merge 1:1 id using `using_data'

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                                 3  (_merge==3)
    -----------------------------------------

. drop _merge

. di _n "=== STATA MERGE ==="

=== STATA MERGE ===

. describe using_float

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------
using_float     float   %25.17g               

. format using_float %25.17g

. list id using_float, noobs

  +-------------------------+
  | id          using_float |
  |-------------------------|
  |  1   2.7182817459106445 |
  |  2   2.7182817459106445 |
  |  3   2.7182817459106445 |
  +-------------------------+

. local stata_val = using_float[1]

. di "Stata merge value: " %25.17g `stata_val'
Stata merge value:         2.718281745910645

. tempfile stata_result

. save `stata_result'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St88818.000003 saved
    as .dta format

. 
. * cmerge
. use `master', clear

. cmerge 1:1 id using `using_data'

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0

    Matched                                 3  (_merge==3)
    -----------------------------------------

. drop _merge

. di _n "=== CMERGE ==="

=== CMERGE ===

. describe using_float

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------
using_float     float   %9.0g                 

. format using_float %25.17g

. list id using_float, noobs

  +-------------------------+
  | id          using_float |
  |-------------------------|
  |  1   2.7182817459106445 |
  |  2   2.7182817459106445 |
  |  3   2.7182817459106445 |
  +-------------------------+

. local cmerge_val = using_float[1]

. di "cmerge value:      " %25.17g `cmerge_val'
cmerge value:              2.718281745910645

. 
. * Detailed comparison
. di _n "=== VALUE COMPARISON ==="

=== VALUE COMPARISON ===

. di "Original using_float: " %25.17g `using_val'
Original using_float:         2.718281745910645

. di "Stata merge result:   " %25.17g `stata_val'
Stata merge result:           2.718281745910645

. di "cmerge result:        " %25.17g `cmerge_val'
cmerge result:                2.718281745910645

. di "Stata - Original:     " %25.17g (`stata_val' - `using_val')
Stata - Original:                             0

. di "cmerge - Original:    " %25.17g (`cmerge_val' - `using_val')
cmerge - Original:                            0

. di "cmerge - Stata:       " %25.17g (`cmerge_val' - `stata_val')
cmerge - Stata:                               0

. 
. * Check if cf would fail
. di _n "=== CF COMPARISON ==="

=== CF COMPARISON ===

. capture cf _all using `stata_result'

. if _rc == 0 {
.     di as result "cf _all: MATCH"
cf _all: MATCH
. }

. else {
.     di as error "cf _all: MISMATCH (rc=" _rc ")"
.     * List specific differences
.     cf using_float using `stata_result'
. }

. 
. di _n "=== CONCLUSION ==="

=== CONCLUSION ===

. di "The issue is that Stata merge preserves variable TYPE (float)"
The issue is that Stata merge preserves variable TYPE (float)

. di "while cmerge creates placeholder as double."
while cmerge creates placeholder as double.

. di "The VALUES are identical, but cf _all compares types too."
The VALUES are identical, but cf _all compares types too.

. 
end of do-file
