
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do /tmp/debug_nested.do 

. * Debug nested FE detection
. clear all

. adopath ++ "/Users/Mike/Documents/GitHub/stata-ctools/build"
  [1]              "/Users/Mike/Documents/GitHub/stata-ctools/build"
  [2]  (BASE)      "/Applications/Stata/ado/base/"
  [3]  (SITE)      "/Applications/Stata/ado/site/"
  [4]              "."
  [5]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [6]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [7]  (OLDPLACE)  "~/ado/"

. 
. * Test 1: cluster VCE (firm) - should pass
. sysuse auto, clear
(1978 automobile data)

. gen firm = rep78
(5 missing values generated)

. replace firm = 1 if mi(firm)
(5 real changes made)

. gen year = mpg > 20

. gen y = price

. gen x = mpg

. gen z = headroom

. 
. di _n "=== Test 1: single FE + cluster (same var) ==="

=== Test 1: single FE + cluster (same var) ===

. di "absorb(firm), vce(cluster firm)"
absorb(firm), vce(cluster firm)

. civreghdfe y (x = z), absorb(firm) vce(cluster firm) verbose

------------------------------------------------------------
civreghdfe: C-Accelerated IV Regression with HDFE
------------------------------------------------------------
Dependent variable:    y
Endogenous variables:  x (1)
Exogenous variables:    (0)
Excluded instruments:  z (1)
Absorbed FE:           firm (1)
Observations:          74
VCE:                   Cluster (firm)
------------------------------------------------------------
civreghdfe: N=74, K_endog=1, K_exog=0, K_iv=1, G=1
civreghdfe: 74 valid observations (dropped 0)
civreghdfe: No singletons found
civreghdfe: Partialling out fixed effects...
civreghdfe: Fixed effects partialled out
civreghdfe: nested_fe_index=1, df_a=5, df_a_nested=5, df_a_for_vce=0, nested_ad
> j=1
civreghdfe: Computing 2SLS estimation
  N=74, K_exog=0, K_endog=1, K_iv=1
  beta[0] = -177.465
  First-stage F[0] = 9.49313 (R^2 = 0.11649)
civreghdfe: Done

IV regression with HDFE                         Number of obs      =        74
Absorbed 1 HDFE groups                          Num. clusters      =         5

                                   (Std. err. adjusted for 5 clusters in firm)
------------------------------------------------------------------------------
             |               Cluster
           y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
           x |  -177.4651   88.14263    -2.01   0.048     -353.351   -1.579222
------------------------------------------------------------------------------

First-stage regression summary:
------------------------------------------------------------
  x                          F(  1,     68) =        9.49
------------------------------------------------------------
  Stock-Yogo weak ID test critical values (10% maximal IV size): 16.38

. 
. * Test 2: nlswork cluster VCE - should pass but fails
. di _n "=== Test 2: nlswork cluster VCE ==="

=== Test 2: nlswork cluster VCE ===

. webuse nlswork, clear
(National Longitudinal Survey of Young Women, 14-24 years old in 1968)

. keep in 1/5000
(23,534 observations deleted)

. di "absorb(idcode), vce(cluster idcode)"
absorb(idcode), vce(cluster idcode)

. civreghdfe ln_wage (tenure = age) ttl_exp, absorb(idcode) vce(cluster idcode)
>  verbose

------------------------------------------------------------
civreghdfe: C-Accelerated IV Regression with HDFE
------------------------------------------------------------
Dependent variable:    ln_wage
Endogenous variables:  tenure (1)
Exogenous variables:   ttl_exp (1)
Excluded instruments:  age (1)
Absorbed FE:           idcode (1)
Observations:          4934
VCE:                   Cluster (idcode)
------------------------------------------------------------
civreghdfe: N=5000, K_endog=1, K_exog=1, K_iv=2, G=1
civreghdfe: 4934 valid observations (dropped 66)
civreghdfe: Dropped 112 singletons in 2 iterations
civreghdfe: Partialling out fixed effects...
civreghdfe: Fixed effects partialled out
civreghdfe: nested_fe_index=1, df_a=723, df_a_nested=723, df_a_for_vce=0, neste
> d_adj=1
civreghdfe: Computing 2SLS estimation
  N=4822, K_exog=1, K_endog=1, K_iv=2
  beta[0] = 0.00139984
  beta[1] = 0.0547209
  First-stage F[0] = 4888.9 (R^2 = 0.5036)
civreghdfe: Done

IV regression with HDFE                         Number of obs      =     4,822
Absorbed 1 HDFE groups                          Num. clusters      =       938

                               (Std. err. adjusted for 938 clusters in idcode)
------------------------------------------------------------------------------
             |               Cluster
     ln_wage | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      tenure |   .0547209    .012446     4.40   0.000       .03032    .0791218
     ttl_exp |   .0013998   .0064619     0.22   0.829     -.011269    .0140686
------------------------------------------------------------------------------

First-stage regression summary:
------------------------------------------------------------
  tenure                     F(  1,   4097) =     4888.90
------------------------------------------------------------
  Stock-Yogo weak ID test critical values (10% maximal IV size): 16.38

. 
. * Test 3: two-way FE + cluster
. di _n "=== Test 3: two-way FE + cluster ==="

=== Test 3: two-way FE + cluster ===

. sysuse auto, clear
(1978 automobile data)

. gen firm = rep78
(5 missing values generated)

. replace firm = 1 if mi(firm)
(5 real changes made)

. gen year = mpg > 20

. gen y = price

. gen x = mpg

. gen z = headroom

. di "absorb(firm year), vce(cluster firm)"
absorb(firm year), vce(cluster firm)

. civreghdfe y (x = z), absorb(firm year) vce(cluster firm) verbose

------------------------------------------------------------
civreghdfe: C-Accelerated IV Regression with HDFE
------------------------------------------------------------
Dependent variable:    y
Endogenous variables:  x (1)
Exogenous variables:    (0)
Excluded instruments:  z (1)
Absorbed FE:           firm year (2)
Observations:          74
VCE:                   Cluster (firm)
------------------------------------------------------------
civreghdfe: N=74, K_endog=1, K_exog=0, K_iv=1, G=2
civreghdfe: 36 valid observations (dropped 38)
civreghdfe: No singletons found
civreghdfe: Partialling out fixed effects...
civreghdfe: Fixed effects partialled out
civreghdfe: nested_fe_index=1, df_a=5, df_a_nested=5, df_a_for_vce=0, nested_ad
> j=1
civreghdfe: Computing 2SLS estimation
  N=36, K_exog=0, K_endog=1, K_iv=1
  beta[0] = -466.747
  First-stage F[0] = 0.329163 (R^2 = 0.00958843)
civreghdfe: Done

IV regression with HDFE                         Number of obs      =        36
Absorbed 2 HDFE groups                          Num. clusters      =         5

                                   (Std. err. adjusted for 5 clusters in firm)
------------------------------------------------------------------------------
             |               Cluster
           y | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
           x |  -466.7472   680.1268    -0.69   0.498    -1855.752    922.2571
------------------------------------------------------------------------------

First-stage regression summary:
------------------------------------------------------------
  x                          F(  1,     30) =        0.33
------------------------------------------------------------
  Stock-Yogo weak ID test critical values (10% maximal IV size): 16.38

. 
end of do-file
