
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do /tmp/debug_precision.do 

. * Debug test to find precision loss in cmerge
. clear all

. set more off

. adopath + "/Users/Mike/Documents/GitHub/stata-ctools/build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/Users/Mike/Documents/GitHub/stata-ctools/build"

. 
. * Test 1: Float variable precision
. di _n "=== Test 1: Float variable ==="

=== Test 1: Float variable ===

. clear

. set obs 5
Number of observations (_N) was 0, now 5.

. gen long id = _n

. gen float val_float = 3.14159265358979

. list, noobs

  +---------------+
  | id   val_fl~t |
  |---------------|
  |  1   3.141593 |
  |  2   3.141593 |
  |  3   3.141593 |
  |  4   3.141593 |
  |  5   3.141593 |
  +---------------+

. 
. tempfile master

. save `master'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St87957.000001 saved
    as .dta format

. 
. clear

. set obs 5
Number of observations (_N) was 0, now 5.

. gen long id = _n

. gen float using_float = 2.71828182845905

. tempfile using_data

. save `using_data'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St87957.000002 saved
    as .dta format

. 
. * Stata merge
. use `master', clear

. merge 1:1 id using `using_data'

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                                 5  (_merge==3)
    -----------------------------------------

. di "Stata merge - using_float value (should be float):"
Stata merge - using_float value (should be float):

. list id using_float in 1/1, noobs

  +---------------+
  | id   using_~t |
  |---------------|
  |  1   2.718282 |
  +---------------+

. di "Type: " _col(10)
Type:    

. describe using_float

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------
using_float     float   %9.0g                 

. sum using_float, format

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 using_float |          5    2.718282           0   2.718282   2.718282

. tempfile stata_result

. save `stata_result'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St87957.000003 saved
    as .dta format

. 
. * cmerge
. use `master', clear

. cmerge 1:1 id using `using_data'

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0

    Matched                                 5  (_merge==3)
    -----------------------------------------

. di _n "cmerge - using_float value:"

cmerge - using_float value:

. list id using_float in 1/1, noobs

  +----------------+
  | id   using_f~t |
  |----------------|
  |  1   2.7182817 |
  +----------------+

. di "Type: " _col(10)
Type:    

. describe using_float

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------
using_float     double  %10.0g                

. sum using_float, format

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 using_float |          5    2.718282           0   2.718282   2.718282

. 
. * Compare
. di _n "Comparing values:"

Comparing values:

. merge 1:1 id using `stata_result', update
variable _merge already defined
r(110);

end of do-file
r(110);
