
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do benchmark/debug_vce_comparison.do 

. /****************************************************************************
> ***
> * debug_vce_comparison.do
> *
> * Diagnostic comparison of cqreg vs qreg variance-covariance estimation.
> * Run this to understand discrepancies between the two implementations.
> *****************************************************************************
> **/
. 
. clear all

. set more off

. 
. * Add ctools build directory to adopath
. adopath + "./build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "./build"

. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "./build"
  [8]              "../build"

. 
. * Load test data
. sysuse auto, clear
(1978 automobile data)

. drop if missing(price, mpg, weight, rep78)
(5 observations deleted)

. 
. local N = _N

. display "Sample size: `N'"
Sample size: 69

. 
. *****************************************************************************
> ***
. * Part 1: Basic IID VCE Comparison
. *****************************************************************************
> ***
. 
. display _n "{hline 70}"

----------------------------------------------------------------------

. display "PART 1: IID VCE COMPARISON (default)"
PART 1: IID VCE COMPARISON (default)

. display "{hline 70}"
----------------------------------------------------------------------

. 
. * Run qreg with default VCE
. quietly qreg price mpg weight, quantile(0.5)

. local b_mpg_qreg = _b[mpg]

. local b_wt_qreg = _b[weight]

. local b_cons_qreg = _b[_cons]

. local se_mpg_qreg = _se[mpg]

. local se_wt_qreg = _se[weight]

. local se_cons_qreg = _se[_cons]

. matrix V_qreg = e(V)

. local sum_adev_qreg = e(sum_adev)

. 
. display "qreg results:"
qreg results:

. display "  b[mpg] = " %12.6f `b_mpg_qreg' "  SE = " %10.6f `se_mpg_qreg'
  b[mpg] =   -64.086957  SE = 121.175244

. display "  b[weight] = " %12.6f `b_wt_qreg' "  SE = " %10.6f `se_wt_qreg'
  b[weight] =     0.578261  SE =   0.896591

. display "  b[_cons] = " %12.6f `b_cons_qreg' "  SE = " %10.6f `se_cons_qreg'
  b[_cons] =  4812.000000  SE =  5.052e+03

. display "  sum_adev = " %12.4f `sum_adev_qreg'
  sum_adev =   58466.9565

. 
. * Run cqreg with verbose output
. display _n "Running cqreg..."

Running cqreg...

. cqreg price mpg weight, quantile(0.5) verbose

------------------------------------------------------------
cqreg: C-Accelerated Quantile Regression
------------------------------------------------------------
Quantile:   .5
Depvar:     price
Indepvars:   mpg weight
Obs:        69
VCE type:   iid
Bandwidth:  Hall-Sheather
------------------------------------------------------------

cqreg: N=69, K=3, G=0, quantile=0.500
cqreg: IPM: iterations=12, converged=1, objective=58466.9565, time=0.000s
cqreg: Sparsity: 4599.5488, bandwidth: 0.236875
cqreg: Total time: 0.001s (load: 0.001, hdfe: 0.000, ipm: 0.000, vce: 0.000)

Median regression                                  Number of obs =         69
  Raw sum of deviations 65163    (about 5079     )
  Min sum of deviations 58467                      Pseudo R2     =     0.1028

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -64.08696   80.22683    -0.80   0.427     -224.265    96.09109
      weight |   .5782609   .5936085     0.97   0.334    -.6069167    1.763438
       _cons |       4812   3344.545     1.44   0.155    -1865.599     11489.6
------------------------------------------------------------------------------

Iterations: 12, converged: yes
Total time:     0.001 seconds

. 
. local b_mpg_cqreg = _b[mpg]

. local b_wt_cqreg = _b[weight]

. local b_cons_cqreg = _b[_cons]

. local se_mpg_cqreg = _se[mpg]

. local se_wt_cqreg = _se[weight]

. local se_cons_cqreg = _se[_cons]

. 
. display _n "cqreg results:"

cqreg results:

. display "  b[mpg] = " %12.6f `b_mpg_cqreg' "  SE = " %10.6f `se_mpg_cqreg'
  b[mpg] =   -64.086957  SE =  80.226834

. display "  b[weight] = " %12.6f `b_wt_cqreg' "  SE = " %10.6f `se_wt_cqreg'
  b[weight] =     0.578261  SE =   0.593609

. display "  b[_cons] = " %12.6f `b_cons_cqreg' "  SE = " %10.6f `se_cons_cqreg
> '
  b[_cons] =  4812.000000  SE =  3.345e+03

. 
. * Comparison
. display _n "{hline 70}"

----------------------------------------------------------------------

. display "COMPARISON:"
COMPARISON:

. display "{hline 70}"
----------------------------------------------------------------------

. display "                 qreg          cqreg       coef_diff     SE_ratio"
                 qreg          cqreg       coef_diff     SE_ratio

. display "mpg:       " %12.6f `b_mpg_qreg' %12.6f `b_mpg_cqreg' %12.6f (`b_mpg
> _cqreg'-`b_mpg_qreg') %10.4f (`se_mpg_cqreg'/`se_mpg_qreg')
mpg:         -64.086957  -64.086957   -0.000000    0.6621

. display "weight:    " %12.6f `b_wt_qreg' %12.6f `b_wt_cqreg' %12.6f (`b_wt_cq
> reg'-`b_wt_qreg') %10.4f (`se_wt_cqreg'/`se_wt_qreg')
weight:        0.578261    0.578261   -0.000000    0.6621

. display "_cons:     " %12.6f `b_cons_qreg' %12.6f `b_cons_cqreg' %12.6f (`b_c
> ons_cqreg'-`b_cons_qreg') %10.4f (`se_cons_cqreg'/`se_cons_qreg')
_cons:      4812.000000 4812.000000    0.000000    0.6621

. 
. *****************************************************************************
> ***
. * Part 2: Extract qreg's Implied Sparsity
. *****************************************************************************
> ***
. 
. display _n "{hline 70}"

----------------------------------------------------------------------

. display "PART 2: SPARSITY ANALYSIS"
PART 2: SPARSITY ANALYSIS

. display "{hline 70}"
----------------------------------------------------------------------

. 
. * The IID VCE formula is:
. *   V = s^2 * tau*(1-tau) * (X'X)^{-1}
. *
. * Where s = sparsity = 1/f(0)
. *
. * We can back-calculate s from qreg's V and our computed (X'X)^{-1}
. 
. * Compute (X'X)^{-1}
. gen cons = 1

. mkmat mpg weight cons, matrix(X)

. matrix XtX = X' * X

. matrix XtX_inv = syminv(XtX)

. 
. * For tau = 0.5, tau*(1-tau) = 0.25
. local tau = 0.5

. local tau_factor = `tau' * (1 - `tau')

. 
. * Back-calculate sparsity from qreg's variance of first coefficient
. * V[1,1] = s^2 * tau*(1-tau) * (X'X)^{-1}[1,1]
. * s^2 = V[1,1] / (tau*(1-tau) * (X'X)^{-1}[1,1])
. local v11_qreg = V_qreg[1,1]

. local xtxinv11 = XtX_inv[1,1]

. local implied_s2 = `v11_qreg' / (`tau_factor' * `xtxinv11')

. local implied_s = sqrt(`implied_s2')

. 
. display "qreg implied sparsity (from mpg variance):"
qreg implied sparsity (from mpg variance):

. display "  V[mpg,mpg] = " %12.6f `v11_qreg'
  V[mpg,mpg] = 14683.439879

. display "  (X'X)^{-1}[1,1] = " %12.6e `xtxinv11'
  (X'X)^{-1}[1,1] =  1.21694e-03

. display "  tau*(1-tau) = " %8.6f `tau_factor'
  tau*(1-tau) = 0.250000

. display "  Implied s^2 = " %12.4f `implied_s2'
  Implied s^2 =   4.8264e+07

. display "  Implied s = " %12.4f `implied_s'
  Implied s =    6947.1948

. 
. * Get cqreg's reported sparsity
. capture scalar cqreg_sparsity = __cqreg_sparsity

. capture scalar cqreg_bandwidth = __cqreg_bandwidth

. 
. display _n "cqreg reported values:"

cqreg reported values:

. display "  Sparsity = " %12.4f cqreg_sparsity
  Sparsity = cqreg_sparsity not found
r(111);

end of do-file
r(111);
