
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do /tmp/debug_auto3.do 

. * Debug test - trace values through the merge process
. clear all

. set more off

. adopath + "/Users/Mike/Documents/GitHub/stata-ctools/build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/Users/Mike/Documents/GitHub/stata-ctools/build"

. 
. * Create test datasets
. sysuse auto, clear
(1978 automobile data)

. keep make price mpg

. 
. * Show original master data
. di "=== MASTER DATA (first 10) ==="
=== MASTER DATA (first 10) ===

. list make price mpg in 1/10, noobs

  +------------------------------+
  | make             price   mpg |
  |------------------------------|
  | AMC Concord      4,099    22 |
  | AMC Pacer        4,749    17 |
  | AMC Spirit       3,799    22 |
  | Buick Century    4,816    20 |
  | Buick Electra    7,827    15 |
  |------------------------------|
  | Buick LeSabre    5,788    18 |
  | Buick Opel       4,453    26 |
  | Buick Regal      5,189    20 |
  | Buick Riviera   10,372    16 |
  | Buick Skylark    4,082    19 |
  +------------------------------+

. 
. tempfile master

. save `master'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St68208.000001 saved
    as .dta format

. 
. sysuse auto, clear
(1978 automobile data)

. keep make rep78 headroom

. 
. * Show original using data (sorted by make to see correspondence)
. sort make

. di "=== USING DATA SORTED (first 10) ==="
=== USING DATA SORTED (first 10) ===

. list make rep78 headroom in 1/10, noobs

  +----------------------------------+
  | make            rep78   headroom |
  |----------------------------------|
  | AMC Concord         3        2.5 |
  | AMC Pacer           3        3.0 |
  | AMC Spirit          .        3.0 |
  | Audi 5000           5        3.0 |
  | Audi Fox            3        2.5 |
  |----------------------------------|
  | BMW 320i            4        2.5 |
  | Buick Century       3        4.5 |
  | Buick Electra       4        4.0 |
  | Buick LeSabre       3        4.0 |
  | Buick Opel          .        3.0 |
  +----------------------------------+

. 
. * Reset order
. sysuse auto, clear
(1978 automobile data)

. keep make rep78 headroom

. tempfile using_file

. save `using_file'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St68208.000002 saved
    as .dta format

. 
. * Run cmerge
. use `master', clear
(1978 automobile data)

. cmerge 1:1 make using `using_file', verbose

------------------------------------------------------------
cmerge: Optimized C-Accelerated Merge
------------------------------------------------------------
Merge type:  1:1
Key vars:    make
Using file:  /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St68208.000002
Master obs:  74
Master vars: 3
------------------------------------------------------------

Phase 1: Loading using dataset (keys + keepusing only)...
  Using: 74 obs, keeping 1 keys + 2 keepusing vars
cmerge: Loading using keys...
cmerge: Loading keepusing variables...
cmerge: Sorting using data...
  Loaded 74 obs (1 keys, 2 keepusing) in 0.0 ms, sorted in 0.0 ms

Phase 2: Executing merge with streaming...
cmerge: Loading master keys only...
  Loaded 74 obs, 2 vars in 0.0 ms
cmerge: Sorting master keys...
  Sorted in 0.0 ms
cmerge: Performing merge join...
  Merge produced 74 rows in 0.0 ms
cmerge: Writing output...
cmerge: Streaming master variables...
  Wrote keepusing in 0.0 ms, streamed 3 master vars in 0.1 ms

Total C time: 0.2 ms
  Load: 0.0 ms, Sort: 0.0 ms, Merge: 0.0 ms

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0

    Matched                                74  (_merge==3)
    -----------------------------------------

Total time:     0.002 seconds

. 
. * Show cmerge result BEFORE any sort
. di "=== CMERGE RESULT BEFORE SORT (first 10) ==="
=== CMERGE RESULT BEFORE SORT (first 10) ===

. list make price mpg rep78 headroom _merge in 1/10, noobs

  +---------------------------------------------------------+
  | make            price   mpg   rep78   headroom   _merge |
  |---------------------------------------------------------|
  | AMC Concord     4,099    22       3        2.5        3 |
  | AMC Pacer       4,749    17       3          3        3 |
  | AMC Spirit      3,799    22       .          3        3 |
  | Audi 5000       9,690    17       5          3        3 |
  | Audi Fox        6,295    23       3        2.5        3 |
  |---------------------------------------------------------|
  | BMW 320i        9,735    25       4        2.5        3 |
  | Buick Century   4,816    20       3        4.5        3 |
  | Buick Electra   7,827    15       4          4        3 |
  | Buick LeSabre   5,788    18       3          4        3 |
  | Buick Opel      4,453    26       .          3        3 |
  +---------------------------------------------------------+

. 
. * Sort by make
. sort make

. 
. * Show cmerge result AFTER sort
. di "=== CMERGE RESULT AFTER SORT (first 10) ==="
=== CMERGE RESULT AFTER SORT (first 10) ===

. list make price mpg rep78 headroom _merge in 1/10, noobs

  +---------------------------------------------------------+
  | make            price   mpg   rep78   headroom   _merge |
  |---------------------------------------------------------|
  | AMC Concord     4,099    22       3        2.5        3 |
  | AMC Pacer       4,749    17       3          3        3 |
  | AMC Spirit      3,799    22       .          3        3 |
  | Audi 5000       9,690    17       5          3        3 |
  | Audi Fox        6,295    23       3        2.5        3 |
  |---------------------------------------------------------|
  | BMW 320i        9,735    25       4        2.5        3 |
  | Buick Century   4,816    20       3        4.5        3 |
  | Buick Electra   7,827    15       4          4        3 |
  | Buick LeSabre   5,788    18       3          4        3 |
  | Buick Opel      4,453    26       .          3        3 |
  +---------------------------------------------------------+

. 
. * Now check specific values
. di "=== Check specific values ==="
=== Check specific values ===

. di "Looking for Audi 5000..."
Looking for Audi 5000...

. list if make == "Audi 5000", noobs

  +-----------------------------------------------------+
  | make        price   mpg   rep78   headroom   _merge |
  |-----------------------------------------------------|
  | Audi 5000   9,690    17       5          3        3 |
  +-----------------------------------------------------+

. 
end of do-file
