
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do debug_1m.do 

. * Debug 1:m merge failure
. clear all

. set more off

. adopath + build
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "build"

. 
. * Create master (4 regions)
. clear

. input byte region str20 division_name

       region         division_name
  1. 1 "Northeast"
  2. 2 "Midwest"
  3. 3 "South"
  4. 4 "West"
  5. end

. tempfile master

. save `master'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St09504.000001 saved
    as .dta format

. list

     +--------------------+
     | region   divisio~e |
     |--------------------|
  1. |      1   Northeast |
  2. |      2     Midwest |
  3. |      3       South |
  4. |      4        West |
     +--------------------+

. 
. * Create using (50 states with regions)
. sysuse census, clear
(1980 Census data by state)

. keep state region pop medage

. tempfile using_data

. save `using_data'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St09504.000002 saved
    as .dta format

. di "Using: " _N " obs"
Using: 50 obs

. 
. * Run Stata merge
. use `master', clear

. merge 1:m region using `using_data'
(variable region was byte, now int to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                                50  (_merge==3)
    -----------------------------------------

. tempfile stata_result

. save `stata_result'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St09504.000003 saved
    as .dta format

. di ""


. di "=== STATA MERGE RESULT ==="
=== STATA MERGE RESULT ===

. di "N = " _N
N = 50

. tab _merge

   Matching result from |
                  merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
            Matched (3) |         50      100.00      100.00
------------------------+-----------------------------------
                  Total |         50      100.00

. list in 1/15

     +------------------------------------------------------------------------+
     | region   divisio~e   state                  pop   medage        _merge |
     |------------------------------------------------------------------------|
  1. |      1   Northeast   Rhode Island       947,154    31.80   Matched (3) |
  2. |      2     Midwest   Missouri         4,916,686    30.90   Matched (3) |
  3. |      3       South   Virginia         5,346,818    29.80   Matched (3) |
  4. |      4        West   California      23,667,902    29.90   Matched (3) |
  5. |      1   Northeast   Vermont            511,456    29.40   Matched (3) |
     |------------------------------------------------------------------------|
  6. |      1   Northeast   New Hampshire      920,610    30.10   Matched (3) |
  7. |      1   Northeast   Maine            1,124,660    30.40   Matched (3) |
  8. |      1   Northeast   Massachusetts    5,737,037    31.20   Matched (3) |
  9. |      1   Northeast   New Jersey       7,364,823    32.20   Matched (3) |
 10. |      1   Northeast   Connecticut      3,107,576    32.00   Matched (3) |
     |------------------------------------------------------------------------|
 11. |      1   Northeast   Pennsylvania    11,863,895    32.10   Matched (3) |
 12. |      1   Northeast   New York        17,558,072    31.90   Matched (3) |
 13. |      2     Midwest   Ohio            10,797,630    29.90   Matched (3) |
 14. |      2     Midwest   Michigan         9,262,078    28.80   Matched (3) |
 15. |      2     Midwest   Illinois        11,426,518    29.90   Matched (3) |
     +------------------------------------------------------------------------+

. 
. * Run cmerge
. use `master', clear

. cmerge 1:m region using `using_data', verbose

------------------------------------------------------------
cmerge: Optimized C-Accelerated Merge
------------------------------------------------------------
Merge type:  1:m
Key vars:    region
Using file:  /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St09504.000002
Master obs:  4
Master vars: 2
------------------------------------------------------------

Phase 1: Loading using dataset (keys + keepusing only)...
  Using: 50 obs, keeping 1 keys + 3 keepusing vars

Phase 2: Executing merge with streaming...

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
        from master                         0  (_merge==1)
        from using                          0  (_merge==2)

    Matched                                50  (_merge==3)
    -----------------------------------------

cmerge timing breakdown:

  [Phase 1: Load using data into C]
    Load keys:              0.0000 sec
    Load keepusing:         0.0001 sec
    Sort using:             0.0009 sec
    Apply permutation:      0.0000 sec
    --------------------------------
    Phase 1 C total:        0.0009 sec

  [Phase 2: Execute merge]
    Load master keys:       0.0000 sec
    Sort master:            0.0001 sec
    Merge join:             0.0000 sec
    Reorder output:         0.0000 sec
    Write keepusing:        0.0000 sec
    Stream master (2 vars):  0.0000 sec
    Cleanup:                0.0000 sec
    --------------------------------
    Phase 2 C total:        0.0002 sec

  [Outside C code]
    Pre-plugin1 ado:        0.0010 sec  (load using.dta, parse)
    Plugin1 overhead:       0.0001 sec  (Stata's plugin framework)
    Inter-plugin ado:       0.0010 sec  (breakdown below)
      - restore:            0.0000 sec
      - append vars:        0.0000 sec  (create placeholders, _merge)
      - st_store row:       0.0000 sec  (fill _orig_row)
      - set obs:            0.0000 sec  (expand to max output)
    Plugin2 overhead:      -0.0002 sec  (Stata's plugin framework)
    Post-plugin ado:        0.0000 sec  (labels, cleanup)
    --------------------------------
    Non-C total:            0.0019 sec

  [Summary]
    Wall clock total:       0.0030 sec
    C code:                   37.5%%
    Plugin overhead:          -4.2%%
    Ado-file overhead:        66.7%%

. di ""


. di "=== CMERGE RESULT ==="
=== CMERGE RESULT ===

. di "N = " _N
N = 50

. tab _merge

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |         50      100.00      100.00
------------+-----------------------------------
      Total |         50      100.00

. list in 1/15

     +-----------------------------------------------------------------+
     | region   divisio~e           state        pop   medage   _merge |
     |-----------------------------------------------------------------|
  1. |      1   Northeast     Connecticut    3107576       32        3 |
  2. |      1   Northeast           Maine    1124660     30.4        3 |
  3. |      1   Northeast   Massachusetts    5737037     31.2        3 |
  4. |      1   Northeast   New Hampshire     920610     30.1        3 |
  5. |      1   Northeast      New Jersey    7364823     32.2        3 |
     |-----------------------------------------------------------------|
  6. |      1   Northeast        New York   17558072     31.9        3 |
  7. |      1   Northeast    Pennsylvania   11863895     32.1        3 |
  8. |      1   Northeast    Rhode Island     947154     31.8        3 |
  9. |      1   Northeast         Vermont     511456     29.4        3 |
 10. |      2     Midwest        Illinois   11426518     29.9        3 |
     |-----------------------------------------------------------------|
 11. |      2     Midwest         Indiana    5490224     29.2        3 |
 12. |      2     Midwest            Iowa    2913808       30        3 |
 13. |      2     Midwest          Kansas    2363679     30.1        3 |
 14. |      2     Midwest        Michigan    9262078     28.8        3 |
 15. |      2     Midwest       Minnesota    4075970     29.2        3 |
     +-----------------------------------------------------------------+

. 
. * Compare after sorting
. di ""


. di "=== COMPARISON (after sorting) ==="
=== COMPARISON (after sorting) ===

. sort region state

. tempfile cmerge_sorted

. save `cmerge_sorted'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St09504.000004 saved
    as .dta format

. 
. use `stata_result', clear

. sort region state

. cf _all using `cmerge_sorted'

. 
end of do-file
