
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do /tmp/debug_master_stream.do 

. * Debug test for master variable streaming precision
. clear all

. set more off

. adopath + "/Users/Mike/Documents/GitHub/stata-ctools/build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/Users/Mike/Documents/GitHub/stata-ctools/build"

. 
. * Test master variable precision after streaming
. di _n "=== Master Variable Streaming Precision Test ==="

=== Master Variable Streaming Precision Test ===

. 
. * Create master with high-precision double values
. clear

. set obs 5
Number of observations (_N) was 0, now 5.

. gen long id = _n

. gen double master_dbl = _n * 1.23456789012345678

. gen float master_flt = _n * 1.234567

. gen long master_lng = _n * 123456

. gen int master_int = _n * 123

. gen byte master_byt = _n * 12

. format master_dbl %25.17g

. format master_flt %25.17g

. 
. di "Original master values:"
Original master values:

. list, noobs

  +--------------------------------------------------------------------+
  | id |         master_dbl |         master_flt | master~g | maste~nt |
  |  1 | 1.2345678901234567 | 1.2345670461654663 |   123456 |      123 |
  |--------------------------------------------------------------------|
  |                              maste~yt                              |
  |                                    12                              |
  +--------------------------------------------------------------------+

  +--------------------------------------------------------------------+
  | id |         master_dbl |         master_flt | master~g | maste~nt |
  |  2 | 2.4691357802469134 | 2.4691340923309326 |   246912 |      246 |
  |--------------------------------------------------------------------|
  |                              maste~yt                              |
  |                                    24                              |
  +--------------------------------------------------------------------+

  +--------------------------------------------------------------------+
  | id |         master_dbl |         master_flt | master~g | maste~nt |
  |  3 | 3.7037036703703698 | 3.7037010192871094 |   370368 |      369 |
  |--------------------------------------------------------------------|
  |                              maste~yt                              |
  |                                    36                              |
  +--------------------------------------------------------------------+

  +--------------------------------------------------------------------+
  | id |         master_dbl |         master_flt | master~g | maste~nt |
  |  4 | 4.9382715604938268 | 4.9382681846618652 |   493824 |      492 |
  |--------------------------------------------------------------------|
  |                              maste~yt                              |
  |                                    48                              |
  +--------------------------------------------------------------------+

  +--------------------------------------------------------------------+
  | id |         master_dbl |         master_flt | master~g | maste~nt |
  |  5 | 6.1728394506172837 | 6.1728348731994629 |   617280 |      615 |
  |--------------------------------------------------------------------|
  |                              maste~yt                              |
  |                                    60                              |
  +--------------------------------------------------------------------+

. 
. * Save original values for comparison
. local orig_dbl1 = master_dbl[1]

. local orig_dbl2 = master_dbl[2]

. local orig_dbl3 = master_dbl[3]

. local orig_flt1 = master_flt[1]

. local orig_lng1 = master_lng[1]

. local orig_int1 = master_int[1]

. local orig_byt1 = master_byt[1]

. 
. tempfile master

. save `master'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St88269.000001 saved
    as .dta format

. 
. * Create using dataset that only matches some rows
. clear

. set obs 3
Number of observations (_N) was 0, now 3.

. gen long id = _n + 1  // matches master rows 2, 3, 4

. gen double using_val = _n * 9.87654321098765

. tempfile using_data

. save `using_data'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St88269.000002 saved
    as .dta format

. 
. * Stata merge
. use `master', clear

. merge 1:1 id using `using_data'

    Result                      Number of obs
    -----------------------------------------
    Not matched                             2
        from master                         2  (_merge==1)
        from using                          0  (_merge==2)

    Matched                                 3  (_merge==3)
    -----------------------------------------

. drop _merge

. di _n "=== STATA MERGE RESULT ==="

=== STATA MERGE RESULT ===

. describe

Contains data from /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St88269.00
> 0001
 Observations:             5                  
    Variables:             7                  10 Jan 2026 18:06
-------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------
id              long    %12.0g                
master_dbl      double  %25.17g               
master_flt      float   %25.17g               
master_lng      long    %12.0g                
master_int      int     %8.0g                 
master_byt      byte    %8.0g                 
using_val       double  %10.0g                
-------------------------------------------------------------------------------
Sorted by: id
     Note: Dataset has changed since last saved.

. list, noobs

  +--------------------------------------------------------------------+
  | id |         master_dbl |         master_flt | master~g | maste~nt |
  |  1 | 1.2345678901234567 | 1.2345670461654663 |   123456 |      123 |
  |--------------------------------------------------------------------|
  |            maste~yt             |            using_val             |
  |                  12             |                    .             |
  +--------------------------------------------------------------------+

  +--------------------------------------------------------------------+
  | id |         master_dbl |         master_flt | master~g | maste~nt |
  |  2 | 2.4691357802469134 | 2.4691340923309326 |   246912 |      246 |
  |--------------------------------------------------------------------|
  |            maste~yt             |            using_val             |
  |                  24             |            9.8765432             |
  +--------------------------------------------------------------------+

  +--------------------------------------------------------------------+
  | id |         master_dbl |         master_flt | master~g | maste~nt |
  |  3 | 3.7037036703703698 | 3.7037010192871094 |   370368 |      369 |
  |--------------------------------------------------------------------|
  |            maste~yt             |            using_val             |
  |                  36             |            19.753086             |
  +--------------------------------------------------------------------+

  +--------------------------------------------------------------------+
  | id |         master_dbl |         master_flt | master~g | maste~nt |
  |  4 | 4.9382715604938268 | 4.9382681846618652 |   493824 |      492 |
  |--------------------------------------------------------------------|
  |            maste~yt             |            using_val             |
  |                  48             |             29.62963             |
  +--------------------------------------------------------------------+

  +--------------------------------------------------------------------+
  | id |         master_dbl |         master_flt | master~g | maste~nt |
  |  5 | 6.1728394506172837 | 6.1728348731994629 |   617280 |      615 |
  |--------------------------------------------------------------------|
  |            maste~yt             |            using_val             |
  |                  60             |                    .             |
  +--------------------------------------------------------------------+

. tempfile stata_result

. save `stata_result'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St88269.000003 saved
    as .dta format

. 
. local stata_dbl1 = master_dbl[1]

. local stata_dbl2 = master_dbl[2]

. local stata_dbl3 = master_dbl[3]

. 
. * cmerge
. use `master', clear

. cmerge 1:1 id using `using_data'

    Result                      Number of obs
    -----------------------------------------
    Not matched                             2
        from master                         2  (_merge==1)

    Matched                                 3  (_merge==3)
    -----------------------------------------

. drop _merge

. di _n "=== CMERGE RESULT ==="

=== CMERGE RESULT ===

. describe

Contains data from /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St88269.00
> 0001
 Observations:             5                  
    Variables:             7                  10 Jan 2026 18:06
-------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------
id              long    %12.0g                
master_dbl      double  %25.17g               
master_flt      float   %25.17g               
master_lng      long    %12.0g                
master_int      int     %8.0g                 
master_byt      byte    %8.0g                 
using_val       double  %10.0g                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. list, noobs

  +--------------------------------------------------------------------+
  | id |         master_dbl |         master_flt | master~g | maste~nt |
  |  1 | 1.2345678901234567 | 1.2345670461654663 |   123456 |      123 |
  |--------------------------------------------------------------------|
  |            maste~yt             |            using_val             |
  |                  12             |                    .             |
  +--------------------------------------------------------------------+

  +--------------------------------------------------------------------+
  | id |         master_dbl |         master_flt | master~g | maste~nt |
  |  2 | 2.4691357802469134 | 2.4691340923309326 |   246912 |      246 |
  |--------------------------------------------------------------------|
  |            maste~yt             |            using_val             |
  |                  24             |            9.8765432             |
  +--------------------------------------------------------------------+

  +--------------------------------------------------------------------+
  | id |         master_dbl |         master_flt | master~g | maste~nt |
  |  3 | 3.7037036703703698 | 3.7037010192871094 |   370368 |      369 |
  |--------------------------------------------------------------------|
  |            maste~yt             |            using_val             |
  |                  36             |            19.753086             |
  +--------------------------------------------------------------------+

  +--------------------------------------------------------------------+
  | id |         master_dbl |         master_flt | master~g | maste~nt |
  |  4 | 4.9382715604938268 | 4.9382681846618652 |   493824 |      492 |
  |--------------------------------------------------------------------|
  |            maste~yt             |            using_val             |
  |                  48             |             29.62963             |
  +--------------------------------------------------------------------+

  +--------------------------------------------------------------------+
  | id |         master_dbl |         master_flt | master~g | maste~nt |
  |  5 | 6.1728394506172837 | 6.1728348731994629 |   617280 |      615 |
  |--------------------------------------------------------------------|
  |            maste~yt             |            using_val             |
  |                  60             |                    .             |
  +--------------------------------------------------------------------+

. 
. * Compare master variable precision
. di _n "=== PRECISION COMPARISON ==="

=== PRECISION COMPARISON ===

. di "master_dbl row 1:"
master_dbl row 1:

. di "  Original:  " %25.17g `orig_dbl1'
  Original:         1.2345678901234569

. di "  Stata:     " %25.17g `stata_dbl1'
  Stata:            1.2345678901234569

. di "  cmerge:    " %25.17g master_dbl[1]
  cmerge:           1.2345678901234567

. di "  Diff (cmerge-orig): " %25.17g (master_dbl[1] - `orig_dbl1')
  Diff (cmerge-orig):   -2.2204460492503131e-16

. 
. di _n "master_dbl row 2:"

master_dbl row 2:

. di "  Original:  " %25.17g `orig_dbl2'
  Original:         2.4691357802469129

. di "  Stata:     " %25.17g `stata_dbl2'
  Stata:            2.4691357802469129

. di "  cmerge:    " %25.17g master_dbl[2]
  cmerge:           2.4691357802469134

. di "  Diff (cmerge-orig): " %25.17g (master_dbl[2] - `orig_dbl2')
  Diff (cmerge-orig):    4.4408920985006262e-16

. 
. di _n "master_flt row 1:"

master_flt row 1:

. di "  Original:  " %25.17g `orig_flt1'
  Original:         1.2345670461654661

. di "  cmerge:    " %25.17g master_flt[1]
  cmerge:           1.2345670461654663

. di "  Diff:      " %25.17g (master_flt[1] - `orig_flt1')
  Diff:         2.2204460492503131e-16

. 
. di _n "Integer types:"

Integer types:

. di "  master_lng: orig=" `orig_lng1' " cmerge=" master_lng[1]
  master_lng: orig=123456 cmerge=123456

. di "  master_int: orig=" `orig_int1' " cmerge=" master_int[1]
  master_int: orig=123 cmerge=123

. di "  master_byt: orig=" `orig_byt1' " cmerge=" master_byt[1]
  master_byt: orig=12 cmerge=12

. 
. * Full cf comparison
. di _n "=== CF COMPARISON ==="

=== CF COMPARISON ===

. capture cf _all using `stata_result'

. if _rc == 0 {
.     di as result "cf _all: MATCH - datasets identical"
cf _all: MATCH - datasets identical
. }

. else {
.     di as error "cf _all: MISMATCH (rc=" _rc ")"
.     * Show which variables differ
.     foreach var of varlist _all {
  2.         capture cf `var' using `stata_result'
  3.         if _rc != 0 {
  4.             di as error "  Variable `var' differs"
  5.         }
  6.     }
. }

. 
. di _n "=== DONE ==="

=== DONE ===

. 
end of do-file
