
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do debug_ivstats.do 

. /****************************************************************************
> ***
>  * debug_ivstats.do
>  *
>  * Compare underidentification and weak ID test statistics between
>  * ivreghdfe and civreghdfe
>  ****************************************************************************
> **/
. 
. clear all

. set more off

. 
. * Add build directory to adopath
. adopath ++ "build"
  [1]              "build"
  [2]  (BASE)      "/Applications/Stata/ado/base/"
  [3]  (SITE)      "/Applications/Stata/ado/site/"
  [4]              "."
  [5]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [6]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [7]  (OLDPLACE)  "~/ado/"

. 
. * Load auto dataset
. sysuse auto, clear
(1978 automobile data)

. 
. di as text ""


. di as text "=========================================="
==========================================

. di as text "Test 1: Single endogenous, single instrument"
Test 1: Single endogenous, single instrument

. di as text "=========================================="
==========================================

. 
. * Run ivreghdfe
. ivreghdfe price (mpg = weight), absorb(foreign)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =       74
                                                      F(  1,    71) =    41.02
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1386
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1386
Residual SS             =  545772312.9                Root MSE      =     2773

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -504.0671   78.69864    -6.41   0.000    -660.9877   -347.1465
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          44.470
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              106.920
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+

. di as text ""


. di as text "ivreghdfe results:"
ivreghdfe results:

. di as text "  N = " e(N)
  N = 74

. di as text "  idstat (underid) = " e(idstat)
  idstat (underid) = 44.469891

. di as text "  iddf = " e(iddf)
  iddf = 1

. di as text "  idp = " e(idp)
  idp = 2.583e-11

. di as text "  widstat (Cragg-Donald F) = " e(widstat)
  widstat (Cragg-Donald F) = 106.9201

. di as text "  First-stage F = " e(rkf)
  First-stage F = .

. 
. local iv_idstat = e(idstat)

. local iv_widstat = e(widstat)

. local iv_rkf = e(rkf)

. 
. * Run civreghdfe
. civreghdfe price (mpg = weight), absorb(foreign)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =       74
                                                      F(  1,    71) =    41.02
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1386
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1386
Residual SS             =  545772312.9                Root MSE      =     2773

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -504.0671   78.69864    -6.41   0.000    -660.9877   -347.1465
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          44.470
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              106.920
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+


. di as text ""


. di as text "civreghdfe results:"
civreghdfe results:

. di as text "  N = " e(N)
  N = 74

. di as text "  idstat (underid) = " e(idstat)
  idstat (underid) = 44.469891

. di as text "  iddf = " e(iddf)
  iddf = 1

. di as text "  idp = " e(idp)
  idp = 2.583e-11

. di as text "  cd_f (Cragg-Donald F) = " e(cd_f)
  cd_f (Cragg-Donald F) = 106.9201

. di as text "  First-stage F = " e(F_first1)
  First-stage F = 106.9201

. 
. local civ_idstat = e(idstat)

. local civ_cd_f = e(cd_f)

. local civ_F1 = e(F_first1)

. 
. di as text ""


. di as text "COMPARISON:"
COMPARISON:

. di as text "  underid stat: ivreghdfe=" `iv_idstat' " civreghdfe=" `civ_idsta
> t' " diff=" (`iv_idstat' - `civ_idstat')
  underid stat: ivreghdfe=44.469891 civreghdfe=44.469891 diff=2.132e-14

. di as text "  weak ID F:    ivreghdfe=" `iv_widstat' " civreghdfe=" `civ_cd_f
> ' " diff=" (`iv_widstat' - `civ_cd_f')
  weak ID F:    ivreghdfe=106.9201 civreghdfe=106.9201 diff=9.948e-14

. 
. di as text ""


. di as text "=========================================="
==========================================

. di as text "Test 2: Single endogenous, two instruments"
Test 2: Single endogenous, two instruments

. di as text "=========================================="
==========================================

. 
. sysuse auto, clear
(1978 automobile data)

. ivreghdfe price (mpg = weight length), absorb(foreign)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =       74
                                                      F(  1,    71) =    38.44
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1802
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1802
Residual SS             =  519411935.2                Root MSE      =     2705

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -471.0645    75.9828    -6.20   0.000    -622.5699   -319.5592
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          45.402
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               55.564
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           9.386
                                                   Chi-sq(1) P-val =    0.0022
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight length
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+

. di as text ""


. di as text "ivreghdfe results:"
ivreghdfe results:

. di as text "  idstat = " e(idstat)
  idstat = 45.401515

. di as text "  widstat = " e(widstat)
  widstat = 55.564237

. di as text "  rkf = " e(rkf)
  rkf = .

. 
. local iv_idstat = e(idstat)

. local iv_widstat = e(widstat)

. 
. civreghdfe price (mpg = weight length), absorb(foreign)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =       74
                                                      F(  1,    71) =    38.44
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1802
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1802
Residual SS             =  519411935.2                Root MSE      =     2705

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -471.0645    75.9828    -6.20   0.000    -622.5699   -319.5592
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          45.402
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               55.564
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           9.005
                                                 Chi-sq(1) P-val =   0.0027
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight length
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+


. di as text ""


. di as text "civreghdfe results:"
civreghdfe results:

. di as text "  idstat = " e(idstat)
  idstat = 45.401515

. di as text "  cd_f = " e(cd_f)
  cd_f = 55.564237

. di as text "  F_first1 = " e(F_first1)
  F_first1 = 55.564237

. 
. local civ_idstat = e(idstat)

. local civ_cd_f = e(cd_f)

. 
. di as text ""


. di as text "COMPARISON:"
COMPARISON:

. di as text "  underid stat: ivreghdfe=" `iv_idstat' " civreghdfe=" `civ_idsta
> t' " diff=" (`iv_idstat' - `civ_idstat')
  underid stat: ivreghdfe=45.401515 civreghdfe=45.401515 diff=-4.974e-14

. di as text "  weak ID F:    ivreghdfe=" `iv_widstat' " civreghdfe=" `civ_cd_f
> ' " diff=" (`iv_widstat' - `civ_cd_f')
  weak ID F:    ivreghdfe=55.564237 civreghdfe=55.564237 diff=-1.776e-13

. 
. di as text ""


. di as text "=========================================="
==========================================

. di as text "Test 3: With robust VCE"
Test 3: With robust VCE

. di as text "=========================================="
==========================================

. 
. sysuse auto, clear
(1978 automobile data)

. ivreghdfe price (mpg = weight), absorb(foreign) vce(robust)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =       74
                                                      F(  1,    71) =    27.57
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1386
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1386
Residual SS             =  545772312.9                Root MSE      =     2773

------------------------------------------------------------------------------
             |               Robust
       price | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -504.0671   95.99555    -5.25   0.000    -695.4768   -312.6574
------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             21.299
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              106.920
                         (Kleibergen-Paap rk Wald F statistic):        145.474
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+

. di as text ""


. di as text "ivreghdfe results (robust):"
ivreghdfe results (robust):

. di as text "  idstat = " e(idstat)
  idstat = 21.298751

. di as text "  widstat = " e(widstat)
  widstat = 145.47377

. 
. local iv_idstat = e(idstat)

. local iv_widstat = e(widstat)

. 
. civreghdfe price (mpg = weight), absorb(foreign) vce(robust)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =       74
                                                      F(  1,    71) =    27.57
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1386
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1386
Residual SS             =  545772312.9                Root MSE      =     2773

------------------------------------------------------------------------------
             |               Robust
       price | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -504.0671   95.99555    -5.25   0.000    -695.4768   -312.6574
------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             47.713
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              106.920
                         (Kleibergen-Paap rk Wald F statistic):        145.474
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+


. di as text ""


. di as text "civreghdfe results (robust):"
civreghdfe results (robust):

. di as text "  idstat = " e(idstat)
  idstat = 47.713114

. di as text "  cd_f = " e(cd_f)
  cd_f = 106.9201

. di as text "  widstat = " e(widstat)
  widstat = 145.47377

. di as text "  kp_f = " e(kp_f)
  kp_f = 145.47377

. 
. local civ_idstat = e(idstat)

. local civ_cd_f = e(cd_f)

. local civ_widstat = e(widstat)

. 
. di as text ""


. di as text "COMPARISON:"
COMPARISON:

. di as text "  underid stat: ivreghdfe=" `iv_idstat' " civreghdfe=" `civ_idsta
> t' " diff=" (`iv_idstat' - `civ_idstat')
  underid stat: ivreghdfe=21.298751 civreghdfe=47.713114 diff=-26.414363

. di as text "  weak ID F (KP): ivreghdfe=" `iv_widstat' " civreghdfe=" `civ_wi
> dstat' " diff=" (`iv_widstat' - `civ_widstat')
  weak ID F (KP): ivreghdfe=145.47377 civreghdfe=145.47377 diff=2.842e-13

. di as text "  weak ID F (CD): ivreghdfe CD=" 106.9201 " civreghdfe=" `civ_cd_
> f'
  weak ID F (CD): ivreghdfe CD=106.9201 civreghdfe=106.9201

. 
. di as text ""


. di as text "=========================================="
==========================================

. di as text "Test 4: Two endogenous variables"
Test 4: Two endogenous variables

. di as text "=========================================="
==========================================

. 
. sysuse auto, clear
(1978 automobile data)

. ivreghdfe price (mpg weight = length turn displacement), absorb(foreign)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =       74
                                                      F(  2,    70) =     4.50
                                                      Prob > F      =   0.0145
Total (centered) SS     =  633558013.5                Centered R2   =  -2.5032
Total (uncentered) SS   =  633558013.5                Uncentered R2 =  -2.5032
Residual SS             =   2219486458                Root MSE      =     5631

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |   1540.245   1460.649     1.05   0.295    -1372.927    4453.417
      weight |   13.69941   10.09124     1.36   0.179    -6.426925    33.82574
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):           1.331
                                                   Chi-sq(2) P-val =    0.5141
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                0.421
Stock-Yogo weak ID test critical values: 10% maximal IV size             13.43
                                         15% maximal IV size              8.18
                                         20% maximal IV size              6.40
                                         25% maximal IV size              5.45
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.075
                                                   Chi-sq(1) P-val =    0.7847
------------------------------------------------------------------------------
Instrumented:         mpg weight
Excluded instruments: length turn displacement
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+

. di as text ""


. di as text "ivreghdfe results (2 endog):"
ivreghdfe results (2 endog):

. di as text "  idstat = " e(idstat)
  idstat = 1.3307097

. di as text "  widstat = " e(widstat)
  widstat = .42117274

. 
. local iv_idstat = e(idstat)

. local iv_widstat = e(widstat)

. 
. civreghdfe price (mpg weight = length turn displacement), absorb(foreign)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =       74
                                                      F(  2,    70) =     4.50
                                                      Prob > F      =   0.0145
Total (centered) SS     =  633558013.5                Centered R2   =  -2.5032
Total (uncentered) SS   =  633558013.5                Uncentered R2 =  -2.5032
Residual SS             =  2219486457.9               Root MSE      =     5631

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |   1540.245   1460.649     1.05   0.295    -1372.927    4453.417
      weight |   13.69941   10.09124     1.36   0.179    -6.426925    33.82574
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          43.860
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               33.470
Stock-Yogo weak ID test critical values: 10% maximal IV size             13.43
                                         15% maximal IV size              8.18
                                         20% maximal IV size              6.40
                                         25% maximal IV size              5.45
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.071
                                                 Chi-sq(1) P-val =   0.7905
------------------------------------------------------------------------------
Instrumented:         mpg weight
Excluded instruments: length turn displacement
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+


. di as text ""


. di as text "civreghdfe results (2 endog):"
civreghdfe results (2 endog):

. di as text "  idstat = " e(idstat)
  idstat = 43.860052

. di as text "  cd_f = " e(cd_f)
  cd_f = 33.469906

. 
. local civ_idstat = e(idstat)

. local civ_cd_f = e(cd_f)

. 
. di as text ""


. di as text "COMPARISON:"
COMPARISON:

. di as text "  underid stat: ivreghdfe=" `iv_idstat' " civreghdfe=" `civ_idsta
> t' " diff=" (`iv_idstat' - `civ_idstat')
  underid stat: ivreghdfe=1.3307097 civreghdfe=43.860052 diff=-42.529343

. di as text "  weak ID F:    ivreghdfe=" `iv_widstat' " civreghdfe=" `civ_cd_f
> ' " diff=" (`iv_widstat' - `civ_cd_f')
  weak ID F:    ivreghdfe=.42117274 civreghdfe=33.469906 diff=-33.048733

. 
. di as text ""


. di as text "=========================================="
==========================================

. di as text "All e() scalars from ivreghdfe"
All e() scalars from ivreghdfe

. di as text "=========================================="
==========================================

. 
. sysuse auto, clear
(1978 automobile data)

. ivreghdfe price (mpg = weight), absorb(foreign)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =       74
                                                      F(  1,    71) =    41.02
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1386
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1386
Residual SS             =  545772312.9                Root MSE      =     2773

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -504.0671   78.69864    -6.41   0.000    -660.9877   -347.1465
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          44.470
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              106.920
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+

. ereturn list

scalars:
                  e(N) =  74
          e(inexog_ct) =  0
          e(exexog_ct) =  1
           e(endog_ct) =  1
         e(partial_ct) =  2
               e(df_r) =  71
               e(df_m) =  1
          e(sdofminus) =  2
           e(dofminus) =  0
             e(center) =  0
                 e(r2) =  .1385598456125731
               e(rmse) =  2772.532053009985
                e(rss) =  545772312.9327112
                e(mss) =  87785700.53232372
               e(r2_a) =  .1021609658497241
                  e(F) =  41.02440469169803
                 e(Fp) =  1.41980047537e-08
               e(Fdf1) =  1
               e(Fdf2) =  71
                 e(yy) =  633558013.465035
             e(N_full) =  74
     e(num_singletons) =  0
    e(drop_singletons) =  1
        e(df_a_nested) =  0
     e(df_a_redundant) =  0
       e(df_a_initial) =  2
               e(df_a) =  2
    e(N_hdfe_extended) =  1
             e(N_hdfe) =  1
               e(cons) =  0
        e(partialcons) =  2
           e(nocollin) =  0
                e(cdf) =  106.920099807941
            e(widstat) =  106.920099807941
                 e(cd) =  1.505916898703394
                e(idp) =  2.58299290816e-11
               e(iddf) =  1
             e(idstat) =  44.46989066625118
           e(sargandf) =  0
             e(sargan) =  0
                e(jdf) =  0
                  e(j) =  0
                 e(ll) =  -690.1064031944591
              e(rankV) =  1
              e(rankS) =  1
             e(rankxx) =  1
             e(rankzz) =  1
             e(condxx) =  1
             e(condzz) =  1
                e(r2c) =  .1385598456125731
                e(r2u) =  .1385598456125731
                e(yyc) =  633558013.465035

macros:
            e(predict) : "reghdfe_p"
            e(cmdline) : "ivreghdfe price (mpg = weight), absorb(foreign)"
            e(version) : "04.1.11"
          e(ivreg2cmd) : "ivreghdfe"
                e(cmd) : "ivreghdfe"
   e(extended_absvars) : "foreign"
            e(absvars) : "foreign"
             e(title2) : "Absorbing 1 HDFE group"
          e(dofmethod) : "pairwise clusters continuous"
       e(hacsubtitleV) : "Statistics consistent for homoskedasticity only"
       e(hacsubtitleB) : "Estimates efficient for homoskedasticity only"
              e(title) : "IV (2SLS) estimation"
        e(ranktestcmd) : "ranktest"
              e(model) : "iv"
       e(partialsmall) : "small"
              e(small) : "small"
             e(depvar) : "price"
            e(depvar0) : "price"
            e(depvar1) : "price"
              e(instd) : "mpg"
             e(instd0) : "mpg"
             e(instd1) : "mpg"
              e(insts) : "weight"
             e(insts0) : "weight"
             e(insts1) : "weight"
             e(exexog) : "weight"
            e(exexog0) : "weight"
            e(exexog1) : "weight"
          e(marginsok) : "XB default"
       e(marginsnotok) : "Residuals SCores"
         e(properties) : "b V"

matrices:
                  e(b) :  1 x 1
                  e(V) :  1 x 1
          e(dof_table) :  1 x 5
               e(cdev) :  1 x 1
               e(ccev) :  1 x 1
                  e(W) :  1 x 1
                  e(S) :  1 x 1

functions:
             e(sample)   

. 
end of do-file
