
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do /tmp/final_benchmark.do 

. * Final IPS4o Benchmark
. clear all

. adopath + "build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "build"

. cap program drop ctools_plugin

. program ctools_plugin, plugin using("build/ctools_mac_arm.plugin")

. 
. di "======================================================================"
======================================================================

. di "Final IPS4o Performance Comparison"
Final IPS4o Performance Comparison

. di "======================================================================"
======================================================================

. 
. local sizes 100000 500000 1000000 2000000 5000000 10000000

. 
. foreach n of local sizes {
  2.     di _n "N = " %12.0fc `n'
  3.     di "------------------------------------------------------------------
> ----"
  4. 
.     clear
  5.     set seed 12345
  6.     set obs `n'
  7.     gen double value = rnormal()
  8. 
.     * LSD
.     preserve
  9.     timer clear 1
 10.     timer on 1
 11.     quietly csort value, algorithm(lsd)
 12.     timer off 1
 13.     quietly timer list 1
 14.     local t_lsd = r(t1)
 15.     di "  LSD Radix:  " %8.4f r(t1) "s"
 16.     restore
 17. 
.     * IPS4o
.     preserve
 18.     timer clear 1
 19.     timer on 1
 20.     quietly csort value, algorithm(ips4o)
 21.     timer off 1
 22.     quietly timer list 1
 23.     local t_ips4o = r(t1)
 24.     di "  IPS4o:      " %8.4f r(t1) "s"
 25.     restore
 26. 
.     * Stata
.     preserve
 27.     timer clear 1
 28.     timer on 1
 29.     quietly sort value
 30.     timer off 1
 31.     quietly timer list 1
 32.     local t_stata = r(t1)
 33.     di "  Stata:      " %8.4f r(t1) "s"
 34.     restore
 35. 
.     di "  -> IPS4o is " %4.2f (`t_stata' / `t_ips4o') "x faster than Stata"
 36.     di "  -> IPS4o is " %4.2f (`t_lsd' / `t_ips4o') "x faster than LSD"
 37. }

N =      100,000
----------------------------------------------------------------------
Number of observations (_N) was 0, now 100,000.
  LSD Radix:    0.0050s
  IPS4o:        0.0040s
  Stata:        0.0040s
  -> IPS4o is 1.00x faster than Stata
  -> IPS4o is 1.25x faster than LSD

N =      500,000
----------------------------------------------------------------------
Number of observations (_N) was 0, now 500,000.
  LSD Radix:    0.0120s
  IPS4o:        0.0120s
  Stata:        0.0190s
  -> IPS4o is 1.58x faster than Stata
  -> IPS4o is 1.00x faster than LSD

N =    1,000,000
----------------------------------------------------------------------
Number of observations (_N) was 0, now 1,000,000.
  LSD Radix:    0.0240s
  IPS4o:        0.0280s
  Stata:        0.0420s
  -> IPS4o is 1.50x faster than Stata
  -> IPS4o is 0.86x faster than LSD

N =    2,000,000
----------------------------------------------------------------------
Number of observations (_N) was 0, now 2,000,000.
  LSD Radix:    0.0590s
  IPS4o:        0.0480s
  Stata:        0.1140s
  -> IPS4o is 2.38x faster than Stata
  -> IPS4o is 1.23x faster than LSD

N =    5,000,000
----------------------------------------------------------------------
Number of observations (_N) was 0, now 5,000,000.
  LSD Radix:    0.1600s
  IPS4o:        0.1200s
  Stata:        0.5230s
  -> IPS4o is 4.36x faster than Stata
  -> IPS4o is 1.33x faster than LSD

N =   10,000,000
----------------------------------------------------------------------
Number of observations (_N) was 0, now 10,000,000.
  LSD Radix:    0.3440s
  IPS4o:        0.2470s
  Stata:        1.3760s
  -> IPS4o is 5.57x faster than Stata
  -> IPS4o is 1.39x faster than LSD

. 
. di _n "======================================================================
> "

======================================================================

. di "Benchmark complete"
Benchmark complete

. di "======================================================================"
======================================================================

. 
end of do-file
