
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do temp/format_compare.do 

. capture adopath ++ "build"

. clear

. set seed 12345

. set obs 5
Number of observations (_N) was 0, now 5.

. gen float x_float = runiform()

. gen double x_double = runiform()

. 
. export delimited using "temp/stata_fmt.csv", replace
(file temp/stata_fmt.csv not found)
file temp/stata_fmt.csv saved

. cexport delimited using "temp/cexport_fmt.csv", replace

file temp/cexport_fmt.csv saved
(           5 observations written)

. 
. di ""


. di "=== Stata export delimited ==="
=== Stata export delimited ===

. type "temp/stata_fmt.csv"
x_float,x_double
.35762972,.2076905268617547
.40044263,.0286626992551849
.68938333,.6889244778794504
.5597356,.4693433590964561
.57445127,.207152595773107

. di ""


. di "=== cexport delimited ==="
=== cexport delimited ===

. type "temp/cexport_fmt.csv"
x_float,x_double
0.357629716396332,0.207690526861755
0.400442630052567,0.028662699255185
0.689383327960968,0.68892447787945
0.559735596179962,0.469343359096456
0.574451267719269,0.207152595773107

. 
. erase "temp/stata_fmt.csv"

. erase "temp/cexport_fmt.csv"

. 
end of do-file
