
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_local.do 

. adopath + "./build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "./build"

. 
. * Create local test files instead of web
. sysuse auto, clear
(1978 automobile data)

. keep make price mpg

. tempfile master

. save `master'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St23128.000001 saved
    as .dta format

. 
. sysuse auto, clear
(1978 automobile data)

. keep make weight length

. tempfile using_file

. save `using_file'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St23128.000002 saved
    as .dta format

. 
. use `master', clear
(1978 automobile data)

. di "Master loaded: " _N " obs"
Master loaded: 74 obs

. desc, short

Contains data from /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St23128.00
> 0001
 Observations:            74                  1978 automobile data
    Variables:             3                  11 Jan 2026 14:28
Sorted by: 

. 
. di "Calling cmerge with string key..."
Calling cmerge with string key...

. cmerge 1:1 make using `using_file', verbose

------------------------------------------------------------
cmerge: Optimized C-Accelerated Merge
------------------------------------------------------------
Merge type:  1:1
Key vars:    make
Using file:  /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St23128.000002
Master obs:  74
Master vars: 3
------------------------------------------------------------

Phase 1: Loading using dataset (keys + keepusing only)...
  Using: 74 obs, keeping 1 keys + 2 keepusing vars
cmerge: Loading using keys...
cmerge: Loading keepusing variables...
cmerge: Sorting using data...
  Loaded 74 obs (1 keys, 2 keepusing) in 0.0 ms, sorted in 0.1 ms

Phase 2: Executing merge with streaming...
cmerge: Loading master keys only...
  Loaded 74 obs, 2 vars in 0.0 ms
cmerge: Sorting master keys...
  Sorted in 0.0 ms
cmerge: Performing merge join...
  Merge produced 74 rows in 0.0 ms
cmerge: Writing output...
cmerge: Streaming master variables...
  Wrote keepusing in 0.0 ms, streamed 3 master vars in 0.0 ms

Total C time: 0.2 ms
  Load: 0.0 ms, Sort: 0.0 ms, Merge: 0.0 ms

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0

    Matched                                74  (_merge==3)
    -----------------------------------------

Total time:     0.121 seconds

. di "cmerge completed!"
cmerge completed!

. list in 1/5

     +------------------------------------------------------+
     | make          price   mpg   weight   length   _merge |
     |------------------------------------------------------|
  1. | AMC Concord   4,099    22     2930      186        3 |
  2. | AMC Pacer     4,749    17     3350      173        3 |
  3. | AMC Spirit    3,799    22     2640      168        3 |
  4. | Audi 5000     9,690    17     2830      189        3 |
  5. | Audi Fox      6,295    23     2070      174        3 |
     +------------------------------------------------------+

. 
end of do-file
