
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do benchmark/test_permute_large.do 

. * Benchmark permutation performance with large dataset (10M obs, 10+ vars)
. * This tests the use case the user cares about most
. 
. clear all

. set more off

. 
. * Add build directory to adopath
. adopath + "build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "build"

. 
. * Test with 10M observations, 10 variables
. local size = 10000000

. local nvars = 10

. 
. di as text ""


. di as text "========================================"
========================================

. di as text "Dataset size: " `size' " observations"
Dataset size: 10000000 observations

. di as text "Variables:    " `nvars' " numeric variables"
Variables:    10 numeric variables

. di as text "========================================"
========================================

. 
. clear

. set seed 12345

. quietly set obs `size'

. 
. * Create multiple variables
. forval i = 1/`nvars' {
  2.     quietly gen x`i' = runiform()
  3. }

. 
. * Run csort with verbose to see timing breakdown
. di as text ""


. di as text "Sorting with IPS4O (default):"
Sorting with IPS4O (default):

. csort x1, verbose
csort: Sorting on variables: x1
       All variables: x1 x2 x3 x4 x5 x6 x7 x8 x9 x10 __000000
       Sort key indices:  1
       Algorithm: ips4o (default)

-------------------------------------------------------
csort timing breakdown:
-------------------------------------------------------
  C plugin internals:
    Data load:                0.0626 sec
    Sort (compute order):     0.0748 sec
    Sort (apply permute):     0.1056 sec
    Data store:               0.0454 sec
    Memory cleanup:           0.0050 sec
  -----------------------------------------------------
    C plugin total:           0.2934 sec
  -----------------------------------------------------
  Stata overhead:
    Pre-plugin parsing:       0.0060 sec
    Plugin call overhead:     0.0006 sec
    Post-plugin sort:         0.0930 sec
  -----------------------------------------------------
    Stata overhead total:     0.0996 sec
-------------------------------------------------------
    Wall clock total:         0.3930 sec
-------------------------------------------------------

. 
. di as text ""


. di as text "Sort time:    " %8.4f _csort_time_sort " sec"
Sort time:      0.0748 sec

. di as text "Permute time: " %8.4f _csort_time_permute " sec"
Permute time:   0.1056 sec

. di as text "Ratio (permute/sort): " %5.2f (_csort_time_permute / _csort_time_
> sort)
Ratio (permute/sort):  1.41

. 
. di as text ""


. di as text "========================================"
========================================

. di as text "Benchmark complete!"
Benchmark complete!

. di as text "========================================"
========================================

. 
end of do-file
