
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do benchmark/test_civreghdfe_simple.do 

. * Simple direct comparison: civreghdfe vs ivreghdfe
. * Focus on raw coefficient values
. 
. clear all

. set more off

. adopath + "build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "build"

. 
. sysuse auto, clear
(1978 automobile data)

. 
. di _n "{hline 78}"

------------------------------------------------------------------------------

. di "Simple coefficient comparison: civreghdfe vs ivreghdfe"
Simple coefficient comparison: civreghdfe vs ivreghdfe

. di "{hline 78}" _n
------------------------------------------------------------------------------


. 
. * ===========================================================================
> =
. * Test: Basic IV regression with absorb(foreign)
. * ===========================================================================
> =
. 
. * Run ivreghdfe first
. ivreghdfe price (mpg = weight length), absorb(foreign) vce(robust)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =       74
                                                      F(  1,    71) =    31.13
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1802
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1802
Residual SS             =  519411935.2                Root MSE      =     2705

------------------------------------------------------------------------------
             |               Robust
       price | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -471.0645   84.43456    -5.58   0.000    -639.4223   -302.7068
------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             22.986
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               55.564
                         (Kleibergen-Paap rk Wald F statistic):         74.869
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         3.969
                                                   Chi-sq(1) P-val =    0.0463
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight length
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+

. matrix b_iv = e(b)

. local iv_mpg = b_iv[1,1]

. 
. * Run civreghdfe
. civreghdfe price (mpg = weight length), absorb(foreign) vce(robust)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =       74
                                                      F(  1,    71) =    31.13
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1802
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1802
Residual SS             =  519411935.2                Root MSE      =     2705

------------------------------------------------------------------------------
             |               Robust
       price | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -471.0645   84.43456    -5.58   0.000    -639.4223   -302.7068
------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             22.986
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               55.564
                         (Kleibergen-Paap rk Wald F statistic):         75.939
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         5.204
                                                   Chi-sq(1) P-val =    0.0225
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight length
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2    |
-----------------------------------------------------+


. matrix b_civ = e(b)

. local civ_mpg = b_civ[1,1]

. 
. * Show comparison with many decimal places
. di _n "Raw coefficient values:"

Raw coefficient values:

. di "ivreghdfe mpg coefficient:  " %20.15f `iv_mpg'
ivreghdfe mpg coefficient:  -471.064549216720309

. di "civreghdfe mpg coefficient: " %20.15f `civ_mpg'
civreghdfe mpg coefficient: -471.064549216720422

. di "Difference:                 " %20.15e (`civ_mpg' - `iv_mpg')
Difference:                 -1.1368683772162e-13

. di "Relative difference:        " %20.15e ((`civ_mpg' - `iv_mpg')/`iv_mpg')
Relative difference:         2.4134025349743e-16

. 
. * Show the displayed values
. di _n "Displayed coefficient values (default format):"

Displayed coefficient values (default format):

. di "ivreghdfe mpg:  " `iv_mpg'
ivreghdfe mpg:  -471.06455

. di "civreghdfe mpg: " `civ_mpg'
civreghdfe mpg: -471.06455

. 
. * Now check standard errors
. local se_iv = sqrt(e(V)[1,1])

. ivreghdfe price (mpg = weight length), absorb(foreign) vce(robust)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =       74
                                                      F(  1,    71) =    31.13
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1802
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1802
Residual SS             =  519411935.2                Root MSE      =     2705

------------------------------------------------------------------------------
             |               Robust
       price | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -471.0645   84.43456    -5.58   0.000    -639.4223   -302.7068
------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             22.986
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               55.564
                         (Kleibergen-Paap rk Wald F statistic):         74.869
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         3.969
                                                   Chi-sq(1) P-val =    0.0463
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight length
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+

. local se_iv = sqrt(e(V)[1,1])

. civreghdfe price (mpg = weight length), absorb(foreign) vce(robust)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =       74
                                                      F(  1,    71) =    31.13
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1802
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1802
Residual SS             =  519411935.2                Root MSE      =     2705

------------------------------------------------------------------------------
             |               Robust
       price | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -471.0645   84.43456    -5.58   0.000    -639.4223   -302.7068
------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             22.986
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               55.564
                         (Kleibergen-Paap rk Wald F statistic):         75.939
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         5.204
                                                   Chi-sq(1) P-val =    0.0225
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight length
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2    |
-----------------------------------------------------+


. local se_civ = sqrt(e(V)[1,1])

. 
. di _n "Standard errors:"

Standard errors:

. di "ivreghdfe SE:   " %20.15f `se_iv'
ivreghdfe SE:     84.434559208992482

. di "civreghdfe SE:  " %20.15f `se_civ'
civreghdfe SE:    84.434559208992383

. di "SE difference:  " %20.15e (`se_civ' - `se_iv')
SE difference:  -9.9475983006414e-14

. 
. * ===========================================================================
> =
. * Now manually compute predictions and compare
. * ===========================================================================
> =
. di _n "{hline 78}"

------------------------------------------------------------------------------

. di "Prediction comparison"
Prediction comparison

. di "{hline 78}"
------------------------------------------------------------------------------

. 
. * Using ivreghdfe
. ivreghdfe price (mpg = weight length), absorb(foreign) vce(robust) resid
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =       74
                                                      F(  1,    71) =    31.13
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1802
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1802
Residual SS             =  519411935.2                Root MSE      =     2705

------------------------------------------------------------------------------
             |               Robust
       price | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -471.0645   84.43456    -5.58   0.000    -639.4223   -302.7068
------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             22.986
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               55.564
                         (Kleibergen-Paap rk Wald F statistic):         74.869
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         3.969
                                                   Chi-sq(1) P-val =    0.0463
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight length
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+

. predict double yhat_iv_xb, xb

. 
. * Using civreghdfe - compute manually
. civreghdfe price (mpg = weight length), absorb(foreign) vce(robust)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =       74
                                                      F(  1,    71) =    31.13
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1802
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1802
Residual SS             =  519411935.2                Root MSE      =     2705

------------------------------------------------------------------------------
             |               Robust
       price | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -471.0645   84.43456    -5.58   0.000    -639.4223   -302.7068
------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             22.986
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               55.564
                         (Kleibergen-Paap rk Wald F statistic):         75.939
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         5.204
                                                   Chi-sq(1) P-val =    0.0225
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight length
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2    |
-----------------------------------------------------+


. gen double yhat_civ_raw = mpg * b_civ[1,1]

. 
. * Compare
. gen double pred_diff = yhat_civ_raw - yhat_iv_xb

. 
. di _n "Prediction statistics:"

Prediction statistics:

. sum yhat_iv_xb yhat_civ_raw pred_diff

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  yhat_iv_xb |         74    -10032.4    2725.345  -19313.65  -5652.775
yhat_civ_raw |         74    -10032.4    2725.345  -19313.65  -5652.775
   pred_diff |         74   -2.06e-12    6.78e-13  -3.64e-12  -9.09e-13

. 
. * The difference is large because ivreghdfe xb includes FE means
. di _n "Note: yhat_iv_xb includes fixed effect adjustments,"

Note: yhat_iv_xb includes fixed effect adjustments,

. di "while yhat_civ_raw is just mpg * beta."
while yhat_civ_raw is just mpg * beta.

. 
. * Let's also compare using demeaned data
. bysort foreign: egen double mean_mpg = mean(mpg)

. gen double mpg_dem = mpg - mean_mpg

. gen double yhat_civ_dem = mpg_dem * b_civ[1,1]

. 
. di _n "Demeaned comparison (should be closer to 0 mean):"

Demeaned comparison (should be closer to 0 mean):

. sum yhat_civ_dem

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
yhat_civ_dem |         74    5.57e-15    2505.597  -7644.093    5074.65

. 
. * What ivreghdfe xb really contains
. di _n "The ivreghdfe xb prediction structure:"

The ivreghdfe xb prediction structure:

. di "This prediction includes the estimated FE contributions."
This prediction includes the estimated FE contributions.

. di "Civreghdfe does not have a predict command, so manual"
Civreghdfe does not have a predict command, so manual

. di "computation uses raw or demeaned X * beta."
computation uses raw or demeaned X * beta.

. 
. * ===========================================================================
> =
. * Compare the diagnostic statistics
. * ===========================================================================
> =
. di _n "{hline 78}"

------------------------------------------------------------------------------

. di "Diagnostic statistics comparison"
Diagnostic statistics comparison

. di "{hline 78}"
------------------------------------------------------------------------------

. 
. ivreghdfe price (mpg = weight length), absorb(foreign) vce(robust)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =       74
                                                      F(  1,    71) =    31.13
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1802
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1802
Residual SS             =  519411935.2                Root MSE      =     2705

------------------------------------------------------------------------------
             |               Robust
       price | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -471.0645   84.43456    -5.58   0.000    -639.4223   -302.7068
------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             22.986
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               55.564
                         (Kleibergen-Paap rk Wald F statistic):         74.869
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         3.969
                                                   Chi-sq(1) P-val =    0.0463
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight length
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+

. local j_iv = e(sargan)

. local cd_iv = e(cd_f)

. local kp_iv = e(widstat)

. local id_iv = e(idstat)

. 
. civreghdfe price (mpg = weight length), absorb(foreign) vce(robust)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =       74
                                                      F(  1,    71) =    31.13
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1802
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1802
Residual SS             =  519411935.2                Root MSE      =     2705

------------------------------------------------------------------------------
             |               Robust
       price | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -471.0645   84.43456    -5.58   0.000    -639.4223   -302.7068
------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             22.986
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               55.564
                         (Kleibergen-Paap rk Wald F statistic):         75.939
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         5.204
                                                   Chi-sq(1) P-val =    0.0225
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight length
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2    |
-----------------------------------------------------+


. local j_civ = e(sargan)

. local cd_civ = e(cd_f)

. local kp_civ = e(kp_f)

. local id_civ = e(idstat)

. 
. di _n "Test statistic comparison:"

Test statistic comparison:

. di "                        ivreghdfe      civreghdfe     Difference"
                        ivreghdfe      civreghdfe     Difference

. di "{hline 65}"
-----------------------------------------------------------------

. di "Hansen J:           " %14.6f `j_iv' "  " %14.6f `j_civ' "  " %10.6f (`j_c
> iv' - `j_iv')
Hansen J:                        .        5.203660           .

. di "Cragg-Donald F:     " %14.6f `cd_iv' "  " %14.6f `cd_civ' "  " %10.6f (`c
> d_civ' - `cd_iv')
Cragg-Donald F:                  .       55.564237           .

. di "Kleibergen-Paap F:  " %14.6f `kp_iv' "  " %14.6f `kp_civ' "  " %10.6f (`k
> p_civ' - `kp_iv')
Kleibergen-Paap F:       74.869323       75.938885    1.069562

. di "Underid LM:         " %14.6f `id_iv' "  " %14.6f `id_civ' "  " %10.6f (`i
> d_civ' - `id_iv')
Underid LM:              22.985631       22.985631   -0.000000

. 
. di _n "{hline 78}"

------------------------------------------------------------------------------

. di "CONCLUSION:"
CONCLUSION:

. di "Coefficients and SEs match to machine precision (1e-12 or better)."
Coefficients and SEs match to machine precision (1e-12 or better).

. di "Diagnostic test statistics show some differences - these may need review.
> "
Diagnostic test statistics show some differences - these may need review.

. di "{hline 78}"
------------------------------------------------------------------------------

. 
end of do-file
