
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do benchmark/test_ereturn_check.do 

. * Check what e() values ivreghdfe returns
. 
. clear all

. set more off

. adopath + "build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "build"

. 
. sysuse auto, clear
(1978 automobile data)

. 
. di _n "{hline 78}"

------------------------------------------------------------------------------

. di "Checking ivreghdfe e() returns with robust VCE"
Checking ivreghdfe e() returns with robust VCE

. di "{hline 78}" _n
------------------------------------------------------------------------------


. 
. ivreghdfe price (mpg = weight length), absorb(foreign) vce(robust)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =       74
                                                      F(  1,    71) =    31.13
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1802
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1802
Residual SS             =  519411935.2                Root MSE      =     2705

------------------------------------------------------------------------------
             |               Robust
       price | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -471.0645   84.43456    -5.58   0.000    -639.4223   -302.7068
------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             22.986
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               55.564
                         (Kleibergen-Paap rk Wald F statistic):         74.869
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         3.969
                                                   Chi-sq(1) P-val =    0.0463
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight length
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+

. 
. di _n "All stored e() scalars:"

All stored e() scalars:

. ereturn list

scalars:
                  e(N) =  74
          e(inexog_ct) =  0
          e(exexog_ct) =  2
           e(endog_ct) =  1
         e(partial_ct) =  2
               e(df_r) =  71
               e(df_m) =  1
          e(sdofminus) =  2
           e(dofminus) =  0
             e(center) =  0
                 e(r2) =  .1801667342916088
               e(rmse) =  2704.747873477514
                e(rss) =  519411935.1947605
                e(mss) =  114146078.2702745
               e(r2_a) =  .1455258920785782
                  e(F) =  31.12578855003879
                 e(Fp) =  4.12557155102e-07
               e(Fdf1) =  1
               e(Fdf2) =  71
                 e(yy) =  633558013.465035
             e(N_full) =  74
     e(num_singletons) =  0
    e(drop_singletons) =  1
        e(df_a_nested) =  0
     e(df_a_redundant) =  0
       e(df_a_initial) =  2
               e(df_a) =  2
    e(N_hdfe_extended) =  1
             e(N_hdfe) =  1
               e(cons) =  0
        e(partialcons) =  2
           e(nocollin) =  0
                e(rkf) =  74.86932344971838
                e(cdf) =  55.56423698112895
            e(widstat) =  74.86932344971838
                 e(cd) =  1.587549628032256
                e(idp) =  .0000102031356203
               e(iddf) =  2
             e(idstat) =  22.98563094232781
                 e(jp) =  .0463397066025767
                e(jdf) =  1
                  e(j) =  3.969202789644064
                 e(ll) =  -688.2747329309916
              e(rankV) =  1
              e(rankS) =  2
             e(rankxx) =  1
             e(rankzz) =  2
             e(condxx) =  1
             e(condzz) =  7540.913436147259
                e(r2c) =  .1801667342916088
                e(r2u) =  .1801667342916088
                e(yyc) =  633558013.465035

macros:
            e(predict) : "reghdfe_p"
            e(cmdline) : "ivreghdfe price (mpg = weight length), absorb(for.."
            e(version) : "04.1.11"
          e(ivreg2cmd) : "ivreghdfe"
                e(cmd) : "ivreghdfe"
   e(extended_absvars) : "foreign"
            e(absvars) : "foreign"
             e(title2) : "Absorbing 1 HDFE group"
          e(dofmethod) : "pairwise clusters continuous"
       e(hacsubtitleV) : "Statistics robust to heteroskedasticity"
       e(hacsubtitleB) : "Estimates efficient for homoskedasticity only"
              e(title) : "IV (2SLS) estimation"
        e(ranktestcmd) : "ranktest"
              e(model) : "iv"
            e(vcetype) : "Robust"
                e(vce) : "robust"
       e(partialsmall) : "small"
              e(small) : "small"
             e(depvar) : "price"
            e(depvar0) : "price"
            e(depvar1) : "price"
              e(instd) : "mpg"
             e(instd0) : "mpg"
             e(instd1) : "mpg"
              e(insts) : "weight length"
             e(insts0) : "weight length"
             e(insts1) : "weight length"
             e(exexog) : "weight length"
            e(exexog0) : "weight length"
            e(exexog1) : "weight length"
          e(marginsok) : "XB default"
       e(marginsnotok) : "Residuals SCores"
         e(properties) : "b V"

matrices:
                  e(b) :  1 x 1
                  e(V) :  1 x 1
          e(dof_table) :  1 x 5
               e(cdev) :  1 x 1
               e(ccev) :  1 x 1
                  e(W) :  2 x 2
                  e(S) :  2 x 2

functions:
             e(sample)   

. 
. di _n _n "Specific Sargan/Hansen related:"


Specific Sargan/Hansen related:

. di "e(sargan):   " e(sargan)
e(sargan):   .

. di "e(sargan_p): " e(sargan_p)
e(sargan_p): .

. di "e(j):        " e(j)
e(j):        3.9692028

. di "e(jp):       " e(jp)
e(jp):       .04633971

. di "e(hansen):   " e(hansen)
e(hansen):   .

. 
. di _n _n "{hline 78}"


------------------------------------------------------------------------------

. di "Now checking civreghdfe e() returns"
Now checking civreghdfe e() returns

. di "{hline 78}" _n
------------------------------------------------------------------------------


. 
. civreghdfe price (mpg = weight length), absorb(foreign) vce(robust)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =       74
                                                      F(  1,    71) =    31.13
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1802
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1802
Residual SS             =  519411935.2                Root MSE      =     2705

------------------------------------------------------------------------------
             |               Robust
       price | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -471.0645   84.43456    -5.58   0.000    -639.4223   -302.7068
------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             22.986
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               55.564
                         (Kleibergen-Paap rk Wald F statistic):         75.939
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         5.204
                                                   Chi-sq(1) P-val =    0.0225
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight length
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2    |
-----------------------------------------------------+


. 
. di _n "All stored e() scalars:"

All stored e() scalars:

. ereturn list

scalars:
                  e(N) =  74
               e(df_r) =  71
               e(df_a) =  2
                  e(K) =  1
              e(level) =  95
            e(K_endog) =  1
             e(K_exog) =  0
               e(K_iv) =  2
                  e(G) =  1
           e(F_first1) =  55.56423698112897
                e(rss) =  519411935.1947606
                e(tss) =  633558013.4650351
                 e(r2) =  .1801667342916088
               e(rmse) =  2704.747873477514
                  e(F) =  31.12578855003887
             e(idstat) =  22.98563094232771
               e(iddf) =  2
                e(idp) =  .0000102031356203
             e(sargan) =  5.20366038953513
          e(sargan_df) =  1
            e(endog_p) =  8.21618148833e-09
           e(endog_df) =  1
            e(endog_f) =  33.22326046897145
         e(endog_chi2) =  33.22326046897145
               e(kp_f) =  75.9388852132857
            e(widstat) =  75.9388852132857
               e(cd_f) =  55.56423698112897
           e(sargan_p) =  .0225393769311884

macros:
            e(vcetype) : "Robust"
              e(model) : "2sls"
              e(title) : "IV (2SLS) regression with HDFE"
             e(absorb) : "foreign"
        e(instruments) : "weight length"
          e(endogvars) : "mpg"
             e(depvar) : "price"
            e(cmdline) : "civreghdfe price (mpg = weight length)"
                e(cmd) : "civreghdfe"
         e(properties) : "b V"

matrices:
                  e(b) :  1 x 1
                  e(V) :  1 x 1

functions:
             e(sample)   

. 
. di _n _n "Specific Sargan/Hansen related:"


Specific Sargan/Hansen related:

. di "e(sargan):   " e(sargan)
e(sargan):   5.2036604

. di "e(sargan_p): " e(sargan_p)
e(sargan_p): .02253938

. di "e(sargan_df):" e(sargan_df)
e(sargan_df):1

. 
end of do-file
