
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do /tmp/test_mm_raw.do 

. clear all

. set more off

. adopath ++ build
  [1]              "build"
  [2]  (BASE)      "/Applications/Stata/ado/base/"
  [3]  (SITE)      "/Applications/Stata/ado/site/"
  [4]              "."
  [5]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [6]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [7]  (OLDPLACE)  "~/ado/"

. 
. * Create master dataset with clear position markers
. clear

. input int group int master_pos float val1

        group  master~s       val1
  1. 1 1 10.1
  2. 1 2 10.2
  3. 1 3 10.3
  4. 2 1 20.1
  5. 2 2 20.2
  6. end

. tempfile master_mm

. save `master_mm'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St77282.000001 saved
    as .dta format

. 
. * Create using dataset with clear position markers
. clear

. input int group int using_pos float val2

        group  using_~s       val2
  1. 1 1 100.1
  2. 1 2 100.2
  3. 1 3 100.3
  4. 2 1 200.1
  5. 2 2 200.2
  6. 2 3 200.3
  7. end

. tempfile using_mm

. save `using_mm'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St77282.000002 saved
    as .dta format

. 
. * Stata merge - show raw order
. di "STATA m:m merge result:"
STATA m:m merge result:

. use `master_mm', clear

. merge m:m group using `using_mm', nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                                 6  
    -----------------------------------------

. list, noobs

  +--------------------------------------------+
  | group   master~s   val1   using_~s    val2 |
  |--------------------------------------------|
  |     1          1   10.1          1   100.1 |
  |     1          2   10.2          2   100.2 |
  |     1          3   10.3          3   100.3 |
  |     2          1   20.1          1   200.1 |
  |     2          2   20.2          2   200.2 |
  |--------------------------------------------|
  |     2          2   20.2          3   200.3 |
  +--------------------------------------------+

. 
. * cmerge - show raw order
. di ""


. di "CMERGE m:m merge result:"
CMERGE m:m merge result:

. use `master_mm', clear

. cmerge m:m group using `using_mm', nogen noreport

. list, noobs

  +--------------------------------------------+
  | group   master~s   val1   using_~s    val2 |
  |--------------------------------------------|
  |     1          1   10.1          1   100.1 |
  |     1          2   10.2          2   100.2 |
  |     1          3   10.3          3   100.3 |
  |     2          1   20.1          1   200.1 |
  |     2          2   20.2          2   200.2 |
  |--------------------------------------------|
  |     2          2   20.2          3   200.3 |
  +--------------------------------------------+

. 
end of do-file
