
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do /tmp/test_memeff_debug.do 

. clear all

. set more off

. 
. * Add build directory to adopath
. adopath + "/Users/Mike/Documents/GitHub/stata-ctools/build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/Users/Mike/Documents/GitHub/stata-ctools/build"

. 
. * Create small test dataset
. set seed 12345

. set obs 100
Number of observations (_N) was 0, now 100.

. 
. * sort_key is variable 1
. gen sort_key = ceil(runiform() * 100)

. 
. * 14 more columns
. forvalues i = 1/14 {
  2.     gen col`i' = runiform()
  3. }

. 
. * Show variable order
. describe, short

Contains data
 Observations:           100                  
    Variables:            15                  
Sorted by: 
     Note: Dataset has changed since last saved.

. 
. di as text "Running csort with memeff..."
Running csort with memeff...

. csort sort_key, timeit memeff

-------------------------------------------------------
csort timing breakdown (memory-efficient mode):
-------------------------------------------------------
  C plugin internals:
    Load key vars:            0.0000 sec
    Sort (compute order):     0.0007 sec
    Permute keys in C:        0.0001 sec
    Store sorted keys:        0.0000 sec
    Stream non-key vars:      0.0001 sec
  -----------------------------------------------------
    C plugin total:           0.0011 sec
  -----------------------------------------------------
  Stata overhead:
    Pre-plugin parsing:       0.1610 sec
    Plugin call overhead:    -0.0001 sec
    Post-plugin sort:         0.0000 sec
  -----------------------------------------------------
    Stata overhead total:     0.1609 sec
-------------------------------------------------------
    Wall clock total:         0.1620 sec
-------------------------------------------------------

. 
. di as text "Done."
Done.

. 
end of do-file
