
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do benchmark/test_civreghdfe_predict.do 

. * Test prediction comparison: civreghdfe vs ivreghdfe
. * Using sysuse auto dataset
. 
. clear all

. set more off

. set trace off

. 
. * Add ctools build directory to adopath
. adopath + "build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "build"

. 
. sysuse auto, clear
(1978 automobile data)

. 
. * Create a simple absorb variable
. gen byte one = 1

. 
. di _n "{hline 78}"

------------------------------------------------------------------------------

. di "Testing civreghdfe vs ivreghdfe predictions"
Testing civreghdfe vs ivreghdfe predictions

. di "{hline 78}" _n
------------------------------------------------------------------------------


. 
. * ===========================================================================
> =
. * Test 1: No fixed effects (just constant absorbed)
. * ===========================================================================
> =
. di as text "Test 1: No real fixed effects (absorb(one))"
Test 1: No real fixed effects (absorb(one))

. di "{hline 40}"
----------------------------------------

. 
. * Run ivreghdfe
. ivreghdfe price (mpg = weight length), absorb(one) vce(robust) resid
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =       74
                                                      F(  1,    72) =    19.88
                                                      Prob > F      =   0.0000
Total (centered) SS     =  635065396.1                Centered R2   =   0.1963
Total (uncentered) SS   =  635065396.1                Uncentered R2 =   0.1963
Residual SS             =  510433432.9                Root MSE      =     2663

------------------------------------------------------------------------------
             |               Robust
       price | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |   -316.767   71.05145    -4.46   0.000    -458.4055   -175.1285
------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             28.746
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               69.341
                         (Kleibergen-Paap rk Wald F statistic):         55.378
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         4.007
                                                   Chi-sq(1) P-val =    0.0453
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight length
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         one |         1           0           1     |
-----------------------------------------------------+

. matrix b_iv = e(b)

. predict double yhat_iv, xb

. 
. * Run civreghdfe
. civreghdfe price (mpg = weight length), absorb(one) vce(robust)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =       74
                                                      F(  1,    72) =    19.88
                                                      Prob > F      =   0.0000
Total (centered) SS     =  635065396.1                Centered R2   =   0.1963
Total (uncentered) SS   =  635065396.1                Uncentered R2 =   0.1963
Residual SS             =  510433432.9                Root MSE      =     2663

------------------------------------------------------------------------------
             |               Robust
       price | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |   -316.767   71.05145    -4.46   0.000    -458.4055   -175.1285
------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             28.746
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               69.341
                         (Kleibergen-Paap rk Wald F statistic):         56.158
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         5.608
                                                   Chi-sq(1) P-val =    0.0179
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight length
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
         one |         1           0           1    |
-----------------------------------------------------+


. matrix b_civ = e(b)

. 
. * Manually compute predictions using civreghdfe coefficients
. gen double yhat_civ_manual = b_civ[1,1] * mpg

. 
. * Compare coefficients
. di _n "Coefficient comparison:"

Coefficient comparison:

. di "                  ivreghdfe      civreghdfe       Diff"
                  ivreghdfe      civreghdfe       Diff

. di "{hline 60}"
------------------------------------------------------------

. local b_iv_mpg = b_iv[1,1]

. local b_civ_mpg = b_civ[1,1]

. local diff_mpg = `b_civ_mpg' - `b_iv_mpg'

. di "mpg:          " %14.8f `b_iv_mpg' "  " %14.8f `b_civ_mpg' "  " %14.8e `di
> ff_mpg'
mpg:           -316.76701302   -316.76701302   2.8421709e-13

. 
. * Compare predictions
. gen double diff_pred1 = yhat_civ_manual - yhat_iv

. sum diff_pred1, detail

                         diff_pred1
-------------------------------------------------------------
      Percentiles      Smallest
 1%     4.55e-12       4.55e-12
 5%     4.55e-12       4.55e-12
10%     4.55e-12       4.55e-12       Obs                  74
25%     6.37e-12       4.55e-12       Sum of wgt.          74

50%     6.37e-12                      Mean           7.30e-12
                        Largest       Std. dev.      2.07e-12
75%     8.19e-12       1.27e-11
90%     9.09e-12       1.27e-11       Variance       4.28e-24
95%     1.27e-11       1.27e-11       Skewness       1.146598
99%     1.46e-11       1.46e-11       Kurtosis        4.79014

. 
. * ===========================================================================
> =
. * Test 2: With actual fixed effects
. * ===========================================================================
> =
. di _n _n "Test 2: With actual fixed effects (absorb(foreign))"


Test 2: With actual fixed effects (absorb(foreign))

. di "{hline 40}"
----------------------------------------

. 
. drop yhat_iv yhat_civ_manual diff_pred1

. 
. * Run ivreghdfe
. ivreghdfe price (mpg = weight length), absorb(foreign) vce(robust) resid
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =       74
                                                      F(  1,    71) =    31.13
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1802
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1802
Residual SS             =  519411935.2                Root MSE      =     2705

------------------------------------------------------------------------------
             |               Robust
       price | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -471.0645   84.43456    -5.58   0.000    -639.4223   -302.7068
------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             22.986
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               55.564
                         (Kleibergen-Paap rk Wald F statistic):         74.869
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         3.969
                                                   Chi-sq(1) P-val =    0.0463
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight length
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+

. matrix b_iv2 = e(b)

. predict double yhat_iv, xb

. 
. * Run civreghdfe
. civreghdfe price (mpg = weight length), absorb(foreign) vce(robust)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =       74
                                                      F(  1,    71) =    31.13
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1802
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1802
Residual SS             =  519411935.2                Root MSE      =     2705

------------------------------------------------------------------------------
             |               Robust
       price | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -471.0645   84.43456    -5.58   0.000    -639.4223   -302.7068
------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             22.986
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               55.564
                         (Kleibergen-Paap rk Wald F statistic):         75.939
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         5.204
                                                   Chi-sq(1) P-val =    0.0225
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight length
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2    |
-----------------------------------------------------+


. matrix b_civ2 = e(b)

. 
. * Manually compute predictions using civreghdfe coefficients
. gen double yhat_civ_manual = b_civ2[1,1] * mpg

. 
. * Compare coefficients
. di _n "Coefficient comparison:"

Coefficient comparison:

. di "                  ivreghdfe      civreghdfe       Diff"
                  ivreghdfe      civreghdfe       Diff

. di "{hline 60}"
------------------------------------------------------------

. local b_iv_mpg2 = b_iv2[1,1]

. local b_civ_mpg2 = b_civ2[1,1]

. local diff_mpg2 = `b_civ_mpg2' - `b_iv_mpg2'

. di "mpg:          " %14.8f `b_iv_mpg2' "  " %14.8f `b_civ_mpg2' "  " %14.8e `
> diff_mpg2'
mpg:           -471.06454922   -471.06454922  -1.1368684e-13

. 
. * Compare predictions
. gen double diff_pred2 = yhat_civ_manual - yhat_iv

. sum diff_pred2, detail

                         diff_pred2
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -3.64e-12      -3.64e-12
 5%    -3.64e-12      -3.64e-12
10%    -3.64e-12      -3.64e-12       Obs                  74
25%    -1.82e-12      -3.64e-12       Sum of wgt.          74

50%    -1.82e-12                      Mean          -2.06e-12
                        Largest       Std. dev.      6.78e-13
75%    -1.82e-12      -1.82e-12
90%    -1.82e-12      -1.82e-12       Variance       4.60e-25
95%    -1.82e-12      -9.09e-13       Skewness      -1.716998
99%    -9.09e-13      -9.09e-13       Kurtosis        4.67027

. 
. * ===========================================================================
> =
. * Test 3: Multiple regressors
. * ===========================================================================
> =
. di _n _n "Test 3: Multiple regressors"


Test 3: Multiple regressors

. di "{hline 40}"
----------------------------------------

. 
. drop yhat_iv yhat_civ_manual diff_pred2

. 
. * Run ivreghdfe
. ivreghdfe price (mpg = weight length) trunk, absorb(foreign) vce(robust) resi
> d
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =       74
                                                      F(  2,    70) =    16.39
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1112
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1112
Residual SS             =    563082834                Root MSE      =     2836

------------------------------------------------------------------------------
             |               Robust
       price | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -536.0346   143.8806    -3.73   0.000    -822.9954   -249.0738
       trunk |   -103.722   127.5301    -0.81   0.419    -358.0728    150.6288
------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             18.105
                                                   Chi-sq(2) P-val =    0.0001
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               31.280
                         (Kleibergen-Paap rk Wald F statistic):         25.482
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         3.863
                                                   Chi-sq(1) P-val =    0.0494
------------------------------------------------------------------------------
Instrumented:         mpg
Included instruments: trunk
Excluded instruments: weight length
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+

. matrix b_iv3 = e(b)

. local names3 : colnames b_iv3

. predict double yhat_iv, xb

. 
. * Run civreghdfe
. civreghdfe price (mpg = weight length) trunk, absorb(foreign) vce(robust)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =       74
                                                      F(  2,    70) =    16.39
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1112
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1112
Residual SS             =  563082834.0                Root MSE      =     2836

------------------------------------------------------------------------------
             |               Robust
       price | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -536.0346   143.8806    -3.73   0.000    -822.9954   -249.0738
       trunk |   -103.722   127.5301    -0.81   0.419    -358.0728    150.6288
------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             24.102
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               54.784
                         (Kleibergen-Paap rk Wald F statistic):         85.248
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         4.607
                                                   Chi-sq(1) P-val =    0.0318
------------------------------------------------------------------------------
Instrumented:         mpg
Included instruments: trunk
Excluded instruments: weight length
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2    |
-----------------------------------------------------+


. matrix b_civ3 = e(b)

. 
. * Compare coefficients
. di _n "Coefficient comparison:"

Coefficient comparison:

. di "                  ivreghdfe      civreghdfe       Diff"
                  ivreghdfe      civreghdfe       Diff

. di "{hline 60}"
------------------------------------------------------------

. 
. local k = colsof(b_iv3)

. forval i = 1/`k' {
  2.     local vname : word `i' of `names3'
  3.     local b_iv_i = b_iv3[1,`i']
  4.     local b_civ_i = b_civ3[1,`i']
  5.     local diff_i = `b_civ_i' - `b_iv_i'
  6.     di "%-12s" "`vname'" "  " %14.8f `b_iv_i' "  " %14.8f `b_civ_i' "  " %
> 14.8e `diff_i'
  7. }
%-12smpg   -536.03456012   -536.03456012  -1.4779289e-12
%-12strunk   -103.72199754   -103.72199754  -2.9842795e-13

. 
. * Manually compute predicted values using civreghdfe coefficients
. * Note: civreghdfe returns coefficients in [endog, exog] order
. gen double yhat_civ_manual = b_civ3[1,1] * mpg + b_civ3[1,2] * trunk

. 
. * Compare predictions
. di _n "Prediction comparison (raw X * beta):"

Prediction comparison (raw X * beta):

. sum yhat_iv yhat_civ_manual

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     yhat_iv |         74   -12842.97    2866.018  -23533.25  -8299.411
yhat_civ_m~l |         74   -12842.97    2866.018  -23533.25  -8299.411

. 
. gen double diff_pred3 = yhat_civ_manual - yhat_iv

. sum diff_pred3, detail

                         diff_pred3
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -6.91e-11      -6.91e-11
 5%    -5.46e-11      -5.46e-11
10%    -4.73e-11      -5.46e-11       Obs                  74
25%    -4.00e-11      -5.46e-11       Sum of wgt.          74

50%    -3.46e-11                      Mean          -3.62e-11
                        Largest       Std. dev.      8.10e-12
75%    -3.09e-11      -2.73e-11
90%    -2.73e-11      -2.55e-11       Variance       6.56e-23
95%    -2.73e-11      -2.55e-11       Skewness      -1.418882
99%    -2.36e-11      -2.36e-11       Kurtosis       5.737967

. 
. * ===========================================================================
> =
. * Test 4: Verify both work on demeaned data
. * ===========================================================================
> =
. di _n _n "Test 4: Verify demeaning approach"


Test 4: Verify demeaning approach

. di "{hline 40}"
----------------------------------------

. 
. * Compute means by foreign
. bysort foreign: egen double mean_price = mean(price)

. bysort foreign: egen double mean_mpg = mean(mpg)

. bysort foreign: egen double mean_trunk = mean(trunk)

. 
. * Create demeaned variables
. gen double price_dem = price - mean_price

. gen double mpg_dem = mpg - mean_mpg

. gen double trunk_dem = trunk - mean_trunk

. 
. * Compute fitted values using demeaned X and ivreghdfe coefficients
. gen double yhat_dem_iv = b_iv3[1,1] * mpg_dem + b_iv3[1,2] * trunk_dem

. 
. * Compare with ivreghdfe xb prediction
. di _n "ivreghdfe xb prediction vs demeaned X * beta_iv:"

ivreghdfe xb prediction vs demeaned X * beta_iv:

. sum yhat_iv yhat_dem_iv

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     yhat_iv |         74   -12842.97    2866.018  -23533.25  -8299.411
 yhat_dem_iv |         74   -2.36e-14    2662.574  -9070.835    5505.82

. gen double diff_iv_dem = yhat_iv - yhat_dem_iv

. sum diff_iv_dem, detail

                         diff_iv_dem
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -14462.41      -14462.41
 5%    -14462.41      -14462.41
10%    -14462.41      -14462.41       Obs                  74
25%    -14462.41      -14462.41       Sum of wgt.          74

50%    -12157.82                      Mean          -12842.97
                        Largest       Std. dev.      1060.549
75%    -12157.82      -12157.82
90%    -12157.82      -12157.82       Variance        1124763
95%    -12157.82      -12157.82       Skewness      -.8869686
99%    -12157.82      -12157.82       Kurtosis       1.786713

. 
. * Now compute using civreghdfe coefficients
. gen double yhat_dem_civ = b_civ3[1,1] * mpg_dem + b_civ3[1,2] * trunk_dem

. 
. * Compare the two demeaned predictions
. di _n "Demeaned predictions comparison:"

Demeaned predictions comparison:

. sum yhat_dem_iv yhat_dem_civ

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 yhat_dem_iv |         74   -2.36e-14    2662.574  -9070.835    5505.82
yhat_dem_civ |         74    5.55e-14    2662.574  -9070.835    5505.82

. gen double diff_dem = yhat_dem_civ - yhat_dem_iv

. sum diff_dem, detail

                          diff_dem
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -2.36e-11      -2.36e-11
 5%    -1.36e-11      -1.91e-11
10%    -1.00e-11      -1.46e-11       Obs                  74
25%    -3.18e-12      -1.36e-11       Sum of wgt.          74

50%     7.39e-13                      Mean           7.91e-14
                        Largest       Std. dev.      7.10e-12
75%     5.00e-12       1.00e-11
90%     8.64e-12       1.00e-11       Variance       5.03e-23
95%     1.00e-11       1.09e-11       Skewness      -.8107055
99%     1.55e-11       1.55e-11       Kurtosis       4.123815

. local max_diff = r(max)

. local min_diff = r(min)

. 
. di _n "Max diff in demeaned predictions: " %12.8e `max_diff'

Max diff in demeaned predictions:  1.54614e-11

. di "Min diff in demeaned predictions: " %12.8e `min_diff'
Min diff in demeaned predictions: -2.36469e-11

. 
. * ===========================================================================
> =
. * Test 5: Examine coefficient precision
. * ===========================================================================
> =
. di _n _n "Test 5: Detailed coefficient examination"


Test 5: Detailed coefficient examination

. di "{hline 40}"
----------------------------------------

. 
. * Show more decimal places
. di _n "ivreghdfe coefficients (18 decimals):"

ivreghdfe coefficients (18 decimals):

. matrix list b_iv3, format(%20.15f)

b_iv3[1,2]
                     mpg                 trunk
y1  -536.034560121008894  -103.721997539305974

. 
. di _n "civreghdfe coefficients (18 decimals):"

civreghdfe coefficients (18 decimals):

. matrix list b_civ3, format(%20.15f)

b_civ3[1,2]
                     mpg                 trunk
y1  -536.034560121010372  -103.721997539306344

. 
. * Compute relative error
. local rel_err_mpg = abs(`diff_mpg2') / abs(`b_iv_mpg2')

. di _n "Relative coefficient error (mpg): " %12.8e `rel_err_mpg'

Relative coefficient error (mpg):  2.41340e-16

. 
. * ===========================================================================
> =
. * Summary
. * ===========================================================================
> =
. di _n _n "{hline 78}"


------------------------------------------------------------------------------

. di "SUMMARY"
SUMMARY

. di "{hline 78}"
------------------------------------------------------------------------------

. di "1. Coefficient differences are typically in the range of 1e-10 to 1e-8"
1. Coefficient differences are typically in the range of 1e-10 to 1e-8

. di "2. These are due to numerical precision in CG solver vs Stata's solver"
2. These are due to numerical precision in CG solver vs Stata's solver

. di "3. Predictions using X * beta differ by similar small amounts"
3. Predictions using X * beta differ by similar small amounts

. di ""


. di "Both commands use demeaned (FE-absorbed) data for prediction."
Both commands use demeaned (FE-absorbed) data for prediction.

. di "The 'xb' prediction = X_demeaned * beta, NOT X_original * beta."
The 'xb' prediction = X_demeaned * beta, NOT X_original * beta.

. di "{hline 78}"
------------------------------------------------------------------------------

. 
end of do-file
