
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_string_key.do 

. * Test cmerge with string key (auto dataset)
. clear all

. set more off

. adopath + build
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "build"

. 
. * Load auto dataset and save master
. sysuse auto, clear
(1978 automobile data)

. keep make price mpg

. sort make

. tempfile master

. save `master'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St07141.000001 saved
    as .dta format

. 
. * Create using dataset with different variables
. sysuse auto, clear
(1978 automobile data)

. keep make weight length

. sort make

. tempfile using

. save `using'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St07141.000002 saved
    as .dta format

. 
. * Load master and merge
. use `master', clear
(1978 automobile data)

. di "Master observations: " _N
Master observations: 74

. list make in 1/10

     +---------------+
     | make          |
     |---------------|
  1. | AMC Concord   |
  2. | AMC Pacer     |
  3. | AMC Spirit    |
  4. | Audi 5000     |
  5. | Audi Fox      |
     |---------------|
  6. | BMW 320i      |
  7. | Buick Century |
  8. | Buick Electra |
  9. | Buick LeSabre |
 10. | Buick Opel    |
     +---------------+

. 
. * Merge
. cmerge 1:1 make using `using', verbose

------------------------------------------------------------
cmerge: Optimized C-Accelerated Merge
------------------------------------------------------------
Merge type:  1:1
Key vars:    make
Using file:  /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St07141.000002
Master obs:  74
Master vars: 3
------------------------------------------------------------

Phase 1: Loading using dataset (keys + keepusing only)...
  Using: 74 obs, keeping 1 keys + 2 keepusing vars

Phase 2: Executing merge with streaming...

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
        from master                         0  (_merge==1)
        from using                          0  (_merge==2)

    Matched                                74  (_merge==3)
    -----------------------------------------

cmerge timing breakdown:

  [Phase 1: Load using data into C]
    Load keys:              0.0000 sec
    Load keepusing:         0.0000 sec
    Sort using:             0.0009 sec
    Apply permutation:      0.0000 sec
    --------------------------------
    Phase 1 C total:        0.0009 sec

  [Phase 2: Execute merge]
    Load master keys:       0.0000 sec
    Sort master:            0.0002 sec
    Merge join:             0.0000 sec
    Reorder output:         0.0000 sec
    Write keepusing:        0.0000 sec
    Stream master (3 vars):  0.0000 sec
    Cleanup:                0.0000 sec
    --------------------------------
    Phase 2 C total:        0.0003 sec

  [Outside C code]
    Pre-plugin1 ado:        0.2170 sec  (load using.dta, parse)
    Plugin1 overhead:       0.0001 sec  (Stata's plugin framework)
    Inter-plugin ado:       0.0020 sec  (breakdown below)
      - restore:            0.0000 sec
      - append vars:        0.0020 sec  (create placeholders, _merge)
      - st_store row:       0.0000 sec  (fill _orig_row)
      - set obs:            0.0000 sec  (expand to max output)
    Plugin2 overhead:       0.0007 sec  (Stata's plugin framework)
    Post-plugin ado:        0.0000 sec  (labels, cleanup)
    --------------------------------
    Non-C total:            0.2198 sec

  [Summary]
    Wall clock total:       0.2210 sec
    C code:                    0.6%%
    Plugin overhead:           0.4%%
    Ado-file overhead:        99.1%%

. 
. * Check results
. di ""


. di "After merge observations: " _N
After merge observations: 74

. di ""


. di "Checking make variable for duplicates/corruption:"
Checking make variable for duplicates/corruption:

. tab _merge

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |         74      100.00      100.00
------------+-----------------------------------
      Total |         74      100.00

. di ""


. di "First 20 observations:"
First 20 observations:

. list make price mpg weight length _merge in 1/20

     +-------------------------------------------------------------+
     | make                 price   mpg   weight   length   _merge |
     |-------------------------------------------------------------|
  1. | AMC Concord          4,099    22     2930      186        3 |
  2. | AMC Pacer            4,749    17     3350      173        3 |
  3. | AMC Spirit           3,799    22     2640      168        3 |
  4. | Audi 5000            9,690    17     2830      189        3 |
  5. | Audi Fox             6,295    23     2070      174        3 |
     |-------------------------------------------------------------|
  6. | BMW 320i             9,735    25     2650      177        3 |
  7. | Buick Century        4,816    20     3250      196        3 |
  8. | Buick Electra        7,827    15     4080      222        3 |
  9. | Buick LeSabre        5,788    18     3670      218        3 |
 10. | Buick Opel           4,453    26     2230      170        3 |
     |-------------------------------------------------------------|
 11. | Buick Regal          5,189    20     3280      200        3 |
 12. | Buick Riviera       10,372    16     3880      207        3 |
 13. | Buick Skylark        4,082    19     3400      200        3 |
 14. | Cad. Deville        11,385    14     4330      221        3 |
 15. | Cad. Eldorado       14,500    14     3900      204        3 |
     |-------------------------------------------------------------|
 16. | Cad. Seville        15,906    21     4290      204        3 |
 17. | Chev. Chevette       3,299    29     2110      163        3 |
 18. | Chev. Impala         5,705    16     3690      212        3 |
 19. | Chev. Malibu         4,504    22     3180      193        3 |
 20. | Chev. Monte Carlo    5,104    22     3220      200        3 |
     +-------------------------------------------------------------+

. 
. * Verify no duplicates in make
. duplicates report make

Duplicates in terms of make

--------------------------------------
   Copies | Observations       Surplus
----------+---------------------------
        1 |           74             0
--------------------------------------

. 
end of do-file
