
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do /tmp/test_nolabel.do 

. clear all

. adopath ++ "./build"
  [1]              "./build"
  [2]  (BASE)      "/Applications/Stata/ado/base/"
  [3]  (SITE)      "/Applications/Stata/ado/site/"
  [4]              "."
  [5]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [6]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [7]  (OLDPLACE)  "~/ado/"

. sysuse auto, clear
(1978 automobile data)

. 
. * Test default (with value labels)
. cexport delimited using "/tmp/test_labels.csv", replace

file /tmp/test_labels.csv saved
(          74 observations written)

. di "With labels:"
With labels:

. shell head -3 /tmp/test_labels.csv

make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,
> foreign
AMC Concord,4099,22,3,2.5,11,2930,186,40,121,3.57999992370605,Domestic
AMC Pacer,4749,17,3,3,11,3350,173,40,258,2.52999997138977,Domestic

. 
. * Test nolabel option
. cexport delimited using "/tmp/test_nolabel.csv", replace nolabel  

file /tmp/test_nolabel.csv saved
(          74 observations written)

. di _n "Without labels (nolabel option):"

Without labels (nolabel option):

. shell head -3 /tmp/test_nolabel.csv

make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,
> foreign
AMC Concord,4099,22,3,2.5,11,2930,186,40,121,3.57999992370605,0
AMC Pacer,4749,17,3,3,11,3350,173,40,258,2.52999997138977,0

. 
end of do-file
