
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do /tmp/test_cmerge.do 

. adopath + "./build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "./build"

. webuse autosize, clear
(1978 automobile data)

. di "Master data loaded:"
Master data loaded:

. desc, short

Contains data from https://www.stata-press.com/data/r18/autosize.dta
 Observations:             6                  1978 automobile data
    Variables:             3                  3 Apr 2022 17:53
Sorted by: 

. list make in 1/6

     +------------------+
     | make             |
     |------------------|
  1. | Toyota Celica    |
  2. | BMW 320i         |
  3. | Cad. Seville     |
  4. | Pont. Grand Prix |
  5. | Datsun 210       |
     |------------------|
  6. | Plym. Arrow      |
     +------------------+

. di "Now calling cmerge..."
Now calling cmerge...

. cmerge 1:1 make using https://www.stata-press.com/data/r18/autoexpense, verbo
> se

------------------------------------------------------------
cmerge: Optimized C-Accelerated Merge
------------------------------------------------------------
Merge type:  1:1
Key vars:    make
Using file:  https://www.stata-press.com/data/r18/autoexpense
Master obs:  6
Master vars: 3
------------------------------------------------------------

Phase 1: Loading using dataset (keys + keepusing only)...
  Using: 5 obs, keeping 1 keys + 2 keepusing vars
cmerge: Loading using keys...
cmerge: Loading keepusing variables...
cmerge: Sorting using data...
  Loaded 5 obs (1 keys, 2 keepusing) in 0.0 ms, sorted in 0.0 ms

Phase 2: Executing merge with streaming...
