
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_multi_endog.do 

. * Test multi-endogenous case with verbose
. clear all

. set more off

. adopath ++ "build"
  [1]              "build"
  [2]  (BASE)      "/Applications/Stata/ado/base/"
  [3]  (SITE)      "/Applications/Stata/ado/site/"
  [4]              "."
  [5]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [6]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [7]  (OLDPLACE)  "~/ado/"

. 
. sysuse auto, clear
(1978 automobile data)

. civreghdfe price (mpg weight = length turn displacement), absorb(foreign) ver
> bose

------------------------------------------------------------
civreghdfe: C-Accelerated IV Regression with HDFE
------------------------------------------------------------
Dependent variable:    price
Endogenous variables:  mpg weight (2)
Exogenous variables:    (0)
Excluded instruments:  length turn displacement (3)
Absorbed FE:           foreign (1)
Observations:          74
VCE:                   Unadjusted
------------------------------------------------------------
Estimation method:     2SLS
civreghdfe: N=74, K_endog=2, K_exog=0, K_iv=3, G=1
civreghdfe: 74 valid observations (dropped 0)
civreghdfe: No singletons found
civreghdfe: Partialling out fixed effects...
civreghdfe: Fixed effects partialled out
civreghdfe: Computing 2SLS estimation
  N=74, K_exog=0, K_endog=2, K_iv=3
  beta[0] = 1540.25
  beta[1] = 13.6994
  First-stage F[0] = 33.4699 (R^2 = 0.592703)
  First-stage F[1] = 199.88 (R^2 = 0.896805)
  Multiple endog: K_endog=2, L=3, K_exog=0
  YtY[0,0]=2065.31, ZeZe[0,0]=24425.5, ZeY[0,0]=-5374.06
  yy_ok=1, zz_ok=1
  M[0,0]=0.0210984, M[0,1]=-0.0523095, M[1,0]=-0.0523095, M[1,1]=0.896157
  eigenvalue[0] = 0.0179826
  eigenvalue[1] = 0.899273
civreghdfe: Done

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =       74
                                                      F(  2,    70) =     4.50
                                                      Prob > F      =   0.0145
Total (centered) SS     =  633558013.5                Centered R2   =  -2.5032
Total (uncentered) SS   =  633558013.5                Uncentered R2 =  -2.5032
Residual SS             =  2219486457.9               Root MSE      =     5631

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |   1540.245   1460.649     1.05   0.295    -1372.927    4453.417
      weight |   13.69941   10.09124     1.36   0.179    -6.426925    33.82574
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):         171.198
                                                   Chi-sq(4) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                0.623
Stock-Yogo weak ID test critical values: 10% maximal IV size             13.43
                                         15% maximal IV size              8.18
                                         20% maximal IV size              6.40
                                         25% maximal IV size              5.45
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.071
                                                 Chi-sq(1) P-val =   0.7905
------------------------------------------------------------------------------
Instrumented:         mpg weight
Excluded instruments: length turn displacement
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+


. di as text "underid_stat = " e(idstat)
underid_stat = 171.1983

. di as text "cd_f = " e(cd_f)
cd_f = .62260318

. 
end of do-file
