
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do benchmark/test_hansen_j_ratio.do 

. * Investigate the Hansen J ratio between ivreghdfe and civreghdfe
. 
. clear all

. set more off

. adopath + "build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "build"

. 
. sysuse auto, clear
(1978 automobile data)

. 
. * Get values
. ivreghdfe price (mpg = weight length), absorb(foreign) vce(robust)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =       74
                                                      F(  1,    71) =    31.13
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1802
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1802
Residual SS             =  519411935.2                Root MSE      =     2705

------------------------------------------------------------------------------
             |               Robust
       price | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -471.0645   84.43456    -5.58   0.000    -639.4223   -302.7068
------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             22.986
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               55.564
                         (Kleibergen-Paap rk Wald F statistic):         74.869
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         3.969
                                                   Chi-sq(1) P-val =    0.0463
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight length
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+

. local j_iv = e(j)

. local N = e(N)

. local df_r = e(df_r)

. local df_a = e(df_a)

. 
. civreghdfe price (mpg = weight length), absorb(foreign) vce(robust)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =       74
                                                      F(  1,    71) =    31.13
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1802
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1802
Residual SS             =  519411935.2                Root MSE      =     2705

------------------------------------------------------------------------------
             |               Robust
       price | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -471.0645   84.43456    -5.58   0.000    -639.4223   -302.7068
------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             22.986
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               55.564
                         (Kleibergen-Paap rk Wald F statistic):         75.939
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         5.204
                                                   Chi-sq(1) P-val =    0.0225
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight length
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2    |
-----------------------------------------------------+


. local j_civ = e(sargan)

. 
. * Compute ratio
. local ratio = `j_iv' / `j_civ'

. 
. di _n "{hline 78}"

------------------------------------------------------------------------------

. di "Hansen J Analysis"
Hansen J Analysis

. di "{hline 78}" _n
------------------------------------------------------------------------------


. 
. di "ivreghdfe J:   " %10.6f `j_iv'
ivreghdfe J:     3.969203

. di "civreghdfe J:  " %10.6f `j_civ'
civreghdfe J:    5.203660

. di "Ratio (iv/civ):" %10.6f `ratio'
Ratio (iv/civ):  0.762771

. 
. di _n "Sample info:"

Sample info:

. di "  N:    " `N'
  N:    74

. di "  df_r: " `df_r'
  df_r: 71

. di "  df_a: " `df_a'
  df_a: 2

. 
. * Check if ratio matches any DOF adjustment
. di _n "Possible DOF adjustments:"

Possible DOF adjustments:

. di "  df_r / N = " %10.6f (`df_r' / `N')
  df_r / N =   0.959459

. di "  (N-1) / N = " %10.6f ((`N'-1) / `N')
  (N-1) / N =   0.986486

. di "  N / (N-1) = " %10.6f (`N' / (`N'-1))
  N / (N-1) =   1.013699

. di "  df_r / (df_r + 1) = " %10.6f (`df_r' / (`df_r' + 1))
  df_r / (df_r + 1) =   0.986111

. 
. * The ratio 3.969/5.204 = 0.763 ≈ something?
. di _n "Ratio analysis:"

Ratio analysis:

. di "  Actual ratio:     " %10.6f `ratio'
  Actual ratio:       0.762771

. di "  df_r / N (71/74): " %10.6f (71/74)
  df_r / N (71/74):   0.959459

. di "  df_r / (df_r+df_a) (71/73): " %10.6f (71/73)
  df_r / (df_r+df_a) (71/73):   0.972603

. 
. * What if ivreghdfe divides by something extra?
. * Check if civreghdfe's J * ratio = ivreghdfe's J
. local implied_adj = `j_iv' / `j_civ'

. di _n "To get ivreghdfe J from civreghdfe J, multiply by: " %10.6f `implied_a
> dj'

To get ivreghdfe J from civreghdfe J, multiply by:   0.762771

. 
. * Check what scaling would give this
. * If ivreghdfe uses J * (N-K-df_a)/N as DOF correction:
. local K = 1

. local dof_adj = (`N' - `K' - `df_a') / `N'

. di "DOF adjustment (N-K-df_a)/N = " %10.6f `dof_adj'
DOF adjustment (N-K-df_a)/N =   0.959459

. di "J_civ * this adjustment = " %10.6f (`j_civ' * `dof_adj')
J_civ * this adjustment =   4.992701

. 
. * Or if it's a different formula for robust VCE
. * Hansen J for robust might use: (N-K)/(N-K-df_a) * adjusted_quadform
. local adj2 = (`N' - `K') / (`N' - `K' - `df_a')

. di _n "Alternative: (N-K)/(N-K-df_a) = " %10.6f `adj2'

Alternative: (N-K)/(N-K-df_a) =   1.028169

. di "J_civ / this = " %10.6f (`j_civ' / `adj2')
J_civ / this =   5.061094

. 
. * Check e(W) and e(S) matrices from ivreghdfe
. ivreghdfe price (mpg = weight length), absorb(foreign) vce(robust)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =       74
                                                      F(  1,    71) =    31.13
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1802
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1802
Residual SS             =  519411935.2                Root MSE      =     2705

------------------------------------------------------------------------------
             |               Robust
       price | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -471.0645   84.43456    -5.58   0.000    -639.4223   -302.7068
------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             22.986
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               55.564
                         (Kleibergen-Paap rk Wald F statistic):         74.869
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         3.969
                                                   Chi-sq(1) P-val =    0.0463
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight length
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+

. di _n "ivreghdfe e(W) matrix:"

ivreghdfe e(W) matrix:

. matrix list e(W)

symmetric e(W)[2,2]
            weight      length
weight   2.371e-12
length  -7.456e-11   2.776e-09

. di _n "ivreghdfe e(S) matrix:"

ivreghdfe e(S) matrix:

. matrix list e(S)

symmetric e(S)[2,2]
           weight     length
weight  4.053e+12
length  7.888e+10  2.073e+09

. 
. di _n "{hline 78}"

------------------------------------------------------------------------------

. di "Conclusion: The ratio " %10.6f `ratio' " doesn't match simple DOF adjustm
> ents."
Conclusion: The ratio   0.762771 doesn't match simple DOF adjustments.

. di "ivreghdfe may use a different robust Hansen J formula than the standard."
ivreghdfe may use a different robust Hansen J formula than the standard.

. di "civreghdfe uses the textbook formula J = (Z'e)' (Z'ΩZ)^{-1} (Z'e)."
civreghdfe uses the textbook formula J = (Z'e)' (Z'ΩZ)^{-1} (Z'e).

. di "{hline 78}"
------------------------------------------------------------------------------

. 
end of do-file
