
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do /tmp/test_diag_debug.do 

. * Debug diagnostic test options
. clear all

. set more off

. adopath + "/Users/Mike/Documents/GitHub/stata-ctools/build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/Users/Mike/Documents/GitHub/stata-ctools/build"

. 
. * Create test data
. clear

. set seed 12345

. set obs 500
Number of observations (_N) was 0, now 500.

. gen firm = ceil(_n / 10)

. gen z1 = runiform()

. gen z2 = rnormal()

. gen z3 = runiform() + 0.1*rnormal()

. gen x_endog = 0.5*z1 + 0.3*z2 + 0.2*z3 + rnormal()

. gen x_exog = runiform()

. gen y = 2*x_endog + 1.5*x_exog + rnormal()

. 
. di as text _n "Test 1: Without orthog (should work)"

Test 1: Without orthog (should work)

. civreghdfe y (x_endog = z1 z2 z3) x_exog, absorb(firm) nofooter

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =      500
                                                      F(  2,   448) =   198.78
                                                      Prob > F      =   0.0000
Total (centered) SS     =  2458.1                     Centered R2   =   0.8158
Total (uncentered) SS   =  2458.1                     Uncentered R2 =   0.8158
Residual SS             =  452.8                      Root MSE      =        1

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     x_endog |    2.19302   .1211151    18.11   0.000     1.954996    2.431044
      x_exog |   1.750793   .1623991    10.78   0.000     1.431634    2.069952
------------------------------------------------------------------------------

. di as text "Test 1 passed"
Test 1 passed

. 
. di as text _n "Test 2: With orthog (failing?)"

Test 2: With orthog (failing?)

. capture civreghdfe y (x_endog = z1 z2 z3) x_exog, absorb(firm) orthog(z3) nof
> ooter

. di as text "Return code: " _rc
Return code: 0

. 
. di as text _n "Test 3: Just noid option"

Test 3: Just noid option

. civreghdfe y (x_endog = z1 z2 z3) x_exog, absorb(firm) noid nofooter

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =      500
                                                      F(  2,   448) =   198.78
                                                      Prob > F      =   0.0000
Total (centered) SS     =  2458.1                     Centered R2   =   0.8158
Total (uncentered) SS   =  2458.1                     Uncentered R2 =   0.8158
Residual SS             =  452.8                      Root MSE      =        1

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     x_endog |    2.19302   .1211151    18.11   0.000     1.954996    2.431044
      x_exog |   1.750793   .1623991    10.78   0.000     1.431634    2.069952
------------------------------------------------------------------------------

. di as text "Test 3 passed"
Test 3 passed

. 
end of do-file
