
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do benchmark/test_hansen_j_debug.do 

. * Debug Hansen J computation difference
. * Manually compute components to identify where discrepancy arises
. 
. clear all

. set more off

. adopath + "build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "build"

. 
. sysuse auto, clear
(1978 automobile data)

. 
. di _n "{hline 78}"

------------------------------------------------------------------------------

. di "Hansen J Diagnostic Test"
Hansen J Diagnostic Test

. di "{hline 78}" _n
------------------------------------------------------------------------------


. 
. * Run both commands and compare J statistics
. ivreghdfe price (mpg = weight length), absorb(foreign) vce(robust)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =       74
                                                      F(  1,    71) =    31.13
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1802
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1802
Residual SS             =  519411935.2                Root MSE      =     2705

------------------------------------------------------------------------------
             |               Robust
       price | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -471.0645   84.43456    -5.58   0.000    -639.4223   -302.7068
------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             22.986
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               55.564
                         (Kleibergen-Paap rk Wald F statistic):         74.869
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         3.969
                                                   Chi-sq(1) P-val =    0.0463
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight length
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+

. local j_iv = e(sargan)

. local j_iv_df = e(sargan_df)

. local j_iv_p = e(sargan_p)

. 
. di "ivreghdfe Hansen J: " %10.6f `j_iv' " (df=" `j_iv_df' ", p=" %6.4f `j_iv_
> p' ")"
ivreghdfe Hansen J:          . (df=., p=     .)

. 
. civreghdfe price (mpg = weight length), absorb(foreign) vce(robust)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =       74
                                                      F(  1,    71) =    31.13
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1802
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1802
Residual SS             =  519411935.2                Root MSE      =     2705

------------------------------------------------------------------------------
             |               Robust
       price | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -471.0645   84.43456    -5.58   0.000    -639.4223   -302.7068
------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             22.986
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               55.564
                         (Kleibergen-Paap rk Wald F statistic):         75.939
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         5.204
                                                   Chi-sq(1) P-val =    0.0225
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight length
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2    |
-----------------------------------------------------+


. local j_civ = e(sargan)

. local j_civ_df = e(sargan_df)

. local j_civ_p = e(sargan_p)

. 
. di "civreghdfe Hansen J: " %10.6f `j_civ' " (df=" `j_civ_df' ", p=" %6.4f `j_
> civ_p' ")"
civreghdfe Hansen J:   5.203660 (df=1, p=0.0225)

. 
. di _n "Difference: " %10.6f (`j_civ' - `j_iv')

Difference:          .

. di "Ratio: " %10.6f (`j_civ' / `j_iv')
Ratio:          .

. 
. * ===========================================================================
> =
. * Now let's manually compute the components
. * ===========================================================================
> =
. di _n _n "{hline 78}"


------------------------------------------------------------------------------

. di "Manual Computation of Hansen J"
Manual Computation of Hansen J

. di "{hline 78}" _n
------------------------------------------------------------------------------


. 
. * Manually demean data by foreign
. bysort foreign: egen double mean_price = mean(price)

. bysort foreign: egen double mean_mpg = mean(mpg)

. bysort foreign: egen double mean_weight = mean(weight)

. bysort foreign: egen double mean_length = mean(length)

. 
. gen double price_dem = price - mean_price

. gen double mpg_dem = mpg - mean_mpg

. gen double weight_dem = weight - mean_weight

. gen double length_dem = length - mean_length

. 
. * Get coefficients from civreghdfe
. civreghdfe price (mpg = weight length), absorb(foreign) vce(robust)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =       74
                                                      F(  1,    71) =    31.13
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1802
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1802
Residual SS             =  519411935.2                Root MSE      =     2705

------------------------------------------------------------------------------
             |               Robust
       price | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -471.0645   84.43456    -5.58   0.000    -639.4223   -302.7068
------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             22.986
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               55.564
                         (Kleibergen-Paap rk Wald F statistic):         75.939
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         5.204
                                                   Chi-sq(1) P-val =    0.0225
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight length
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2    |
-----------------------------------------------------+


. matrix b_civ = e(b)

. local beta_mpg = b_civ[1,1]

. 
. * Compute 2SLS residuals using demeaned data
. gen double resid = price_dem - mpg_dem * `beta_mpg'

. 
. * Compute Z'e
. * Z = [weight_dem, length_dem] (excluded instruments only for overid test)
. egen double Ztr_weight = total(weight_dem * resid)

. egen double Ztr_length = total(length_dem * resid)

. 
. di "Z'e components:"
Z'e components:

. di "  weight: " Ztr_weight[1]
  weight: 6217562

. di "  length: " Ztr_length[1]
  length: -328045.85

. 
. * Compute Z'ΩZ (robust weighting)
. * Z'ΩZ = sum_i (Z_i Z_i' e_i^2)
. gen double e2 = resid^2

. 
. gen double ww_e2 = weight_dem^2 * e2

. gen double wl_e2 = weight_dem * length_dem * e2

. gen double ll_e2 = length_dem^2 * e2

. 
. egen double ZOmegaZ_11 = total(ww_e2)

. egen double ZOmegaZ_12 = total(wl_e2)

. egen double ZOmegaZ_22 = total(ll_e2)

. 
. di _n "Z'ΩZ matrix:"

Z'ΩZ matrix:

. di "  [" ZOmegaZ_11[1] ", " ZOmegaZ_12[1] "]"
  [2.999e+14, 5.837e+12]

. di "  [" ZOmegaZ_12[1] ", " ZOmegaZ_22[1] "]"
  [5.837e+12, 1.534e+11]

. 
. * Invert 2x2 matrix
. local a = ZOmegaZ_11[1]

. local b = ZOmegaZ_12[1]

. local c = ZOmegaZ_12[1]

. local d = ZOmegaZ_22[1]

. local det = `a' * `d' - `b' * `c'

. 
. local inv_11 = `d' / `det'

. local inv_12 = -`b' / `det'

. local inv_22 = `a' / `det'

. 
. di _n "(Z'ΩZ)^{-1} matrix:"

(Z'ΩZ)^{-1} matrix:

. di "  [" %14.10e `inv_11' ", " %14.10e `inv_12' "]"
  [ 1.2869415e-14, -4.8983040e-13]

. di "  [" %14.10e `inv_12' ", " %14.10e `inv_22' "]"
  [-4.8983040e-13,  2.5163926e-11]

. 
. * Compute quadratic form: (Z'e)' (Z'ΩZ)^{-1} (Z'e)
. local g1 = Ztr_weight[1]

. local g2 = Ztr_length[1]

. 
. local quad = `g1' * (`inv_11' * `g1' + `inv_12' * `g2') + `g2' * (`inv_12' * 
> `g1' + `inv_22' * `g2')

. 
. di _n "Manual Hansen J (using excluded Z only): " %10.6f `quad'

Manual Hansen J (using excluded Z only):   5.203660

. 
. * ===========================================================================
> =
. * Now try with FULL Z = [exog, excluded] = [nothing, weight, length]
. * Since we have no exogenous regressors, full Z = excluded instruments
. * ===========================================================================
> =
. 
. di _n "{hline 78}"

------------------------------------------------------------------------------

. di "Checking with different Z definitions"
Checking with different Z definitions

. di "{hline 78}"
------------------------------------------------------------------------------

. 
. * Note: In this example, there are no exogenous regressors besides the consta
> nt
. * (which is absorbed by FE). So Z should just be [weight, length].
. 
. * The overidentification df is K_iv - K_total = 2 - 1 = 1
. * This means we have 1 overidentifying restriction.
. 
. di _n "K_iv (instruments) = 2 (weight, length)"

K_iv (instruments) = 2 (weight, length)

. di "K_total (regressors) = 1 (mpg)"
K_total (regressors) = 1 (mpg)

. di "Overid df = K_iv - K_total = 1"
Overid df = K_iv - K_total = 1

. 
. * ===========================================================================
> =
. * Compare with homoskedastic Sargan
. * ===========================================================================
> =
. di _n _n "{hline 78}"


------------------------------------------------------------------------------

. di "Homoskedastic Sargan comparison"
Homoskedastic Sargan comparison

. di "{hline 78}"
------------------------------------------------------------------------------

. 
. * Run with non-robust VCE
. ivreghdfe price (mpg = weight length), absorb(foreign)
(MWFE estimator converged in 1 iterations)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =       74
                                                      F(  1,    71) =    38.44
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1802
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1802
Residual SS             =  519411935.2                Root MSE      =     2705

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -471.0645    75.9828    -6.20   0.000    -622.5699   -319.5592
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          45.402
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               55.564
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           9.386
                                                   Chi-sq(1) P-val =    0.0022
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight length
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+

. local sargan_iv = e(sargan)

. local sargan_iv_df = e(sargan_df)

. local sargan_iv_p = e(sargan_p)

. 
. di "ivreghdfe Sargan (homosked): " %10.6f `sargan_iv' " (df=" `sargan_iv_df' 
> ", p=" %6.4f `sargan_iv_p' ")"
ivreghdfe Sargan (homosked):   9.385624 (df=., p=     .)

. 
. civreghdfe price (mpg = weight length), absorb(foreign)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =       74
                                                      F(  1,    71) =    38.44
                                                      Prob > F      =   0.0000
Total (centered) SS     =  633558013.5                Centered R2   =   0.1802
Total (uncentered) SS   =  633558013.5                Uncentered R2 =   0.1802
Residual SS             =  519411935.2                Root MSE      =     2705

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -471.0645    75.9828    -6.20   0.000    -622.5699   -319.5592
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          45.402
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               55.564
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           9.386
                                                   Chi-sq(1) P-val =    0.0022
------------------------------------------------------------------------------
Instrumented:         mpg
Excluded instruments: weight length
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2    |
-----------------------------------------------------+


. local sargan_civ = e(sargan)

. local sargan_civ_df = e(sargan_df)

. local sargan_civ_p = e(sargan_p)

. 
. di "civreghdfe Sargan (homosked): " %10.6f `sargan_civ' " (df=" `sargan_civ_d
> f' ", p=" %6.4f `sargan_civ_p' ")"
civreghdfe Sargan (homosked):   9.385624 (df=1, p=0.0022)

. 
. di _n "Difference: " %10.6f (`sargan_civ' - `sargan_iv')

Difference:  -0.000000

. 
. * Compute manual homoskedastic Sargan
. * Sargan = N * (Z'e)' (Z'Z)^{-1} (Z'e) / RSS
. 
. egen double ZtZ_11 = total(weight_dem^2)

. egen double ZtZ_12 = total(weight_dem * length_dem)

. egen double ZtZ_22 = total(length_dem^2)

. 
. local a = ZtZ_11[1]

. local b = ZtZ_12[1]

. local c = ZtZ_12[1]

. local d = ZtZ_22[1]

. local det = `a' * `d' - `b' * `c'

. 
. local invZZ_11 = `d' / `det'

. local invZZ_12 = -`b' / `det'

. local invZZ_22 = `a' / `det'

. 
. local N = _N

. egen double rss = total(resid^2)

. local rss_val = rss[1]

. 
. local quad_homosked = `g1' * (`invZZ_11' * `g1' + `invZZ_12' * `g2') + `g2' *
>  (`invZZ_12' * `g1' + `invZZ_22' * `g2')

. local sargan_manual = `N' * `quad_homosked' / `rss_val'

. 
. di _n "Manual Sargan (homosked): " %10.6f `sargan_manual'

Manual Sargan (homosked):   9.385624

. di "RSS: " %14.6f `rss_val'
RSS:   5.194119e+08

. 
. * ===========================================================================
> =
. * Summary
. * ===========================================================================
> =
. di _n _n "{hline 78}"


------------------------------------------------------------------------------

. di "SUMMARY"
SUMMARY

. di "{hline 78}"
------------------------------------------------------------------------------

. di "Homoskedastic Sargan:"
Homoskedastic Sargan:

. di "  ivreghdfe:  " %10.6f `sargan_iv'
  ivreghdfe:    9.385624

. di "  civreghdfe: " %10.6f `sargan_civ'
  civreghdfe:   9.385624

. di "  manual:     " %10.6f `sargan_manual'
  manual:       9.385624

. 
. di _n "Robust Hansen J:"

Robust Hansen J:

. di "  ivreghdfe:  " %10.6f `j_iv'
  ivreghdfe:           .

. di "  civreghdfe: " %10.6f `j_civ'
  civreghdfe:   5.203660

. di "  manual:     " %10.6f `quad'
  manual:       5.203660

. 
. di _n "Key observation:"

Key observation:

. di "If homoskedastic Sargan matches but robust J differs,"
If homoskedastic Sargan matches but robust J differs,

. di "the issue is likely in the Z'ΩZ computation."
the issue is likely in the Z'ΩZ computation.

. di "{hline 78}"
------------------------------------------------------------------------------

. 
end of do-file
