
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do /tmp/test_tab_import.do 

. clear all

. set more off

. adopath ++ build
  [1]              "build"
  [2]  (BASE)      "/Applications/Stata/ado/base/"
  [3]  (SITE)      "/Applications/Stata/ado/site/"
  [4]              "."
  [5]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [6]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [7]  (OLDPLACE)  "~/ado/"

. 
. * Create tab file
. capture mkdir temp

. file open fh using "temp/tabfile_test.tsv", write replace
(file temp/tabfile_test.tsv not found)

. file write fh `"id      name    score   group"' _n

. file write fh `"1       John    85.5    X"' _n

. file write fh `"2       Jane    92.3    Y"' _n

. file close fh

. 
. * Verify file has tabs
. di "File contents:"
File contents:

. type "temp/tabfile_test.tsv"
id      name    score   group
1       John    85.5    X
2       Jane    92.3    Y

. 
. * Stata import
. import delimited using "temp/tabfile_test.tsv", delimiters(tab) clear
(encoding automatically selected: ISO-8859-2)
(1 var, 3 obs)

. di "Stata: N=`=_N' K=`=c(k)'"
Stata: N=3 K=1

. list

     +-------------------------------+
     |                            v1 |
     |-------------------------------|
  1. | id      name    score   group |
  2. |     1       John    85.5    X |
  3. |     2       Jane    92.3    Y |
     +-------------------------------+

. 
. * cimport
. cimport delimited using "temp/tabfile_test.tsv", delimiters(tab) clear
Scanned 2 rows, 1 columns
Loaded 2 observations
(           2 observations read)

. di "cimport: N=`=_N' K=`=c(k)'"
cimport: N=2 K=1

. list

     +----------+
     | idname~p |
     |----------|
  1. |        . |
  2. |        . |
     +----------+

. 
end of do-file
