
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do benchmark/test_memeff_debug.do 

. /*
>     test_memeff_debug.do
>     Debug test with small dataset to trace the issue
> */
. 
. clear all

. set more off

. 
. adopath + "`c(pwd)'/../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/Users/Mike/Documents/GitHub/stata-ctools/../build"

. 
. * Create very small dataset
. set obs 10
Number of observations (_N) was 0, now 10.

. gen id = _n

. gen sort_key = 11 - _n  /* 10, 9, 8, ..., 1 - so sorted order should reverse 
> */

. gen data1 = _n * 100    /* 100, 200, 300, ..., 1000 */

. gen data2 = _n * 10     /* 10, 20, 30, ..., 100 */

. 
. di "=== ORIGINAL DATA ==="
=== ORIGINAL DATA ===

. list, noobs

  +-------------------------------+
  | id   sort_key   data1   data2 |
  |-------------------------------|
  |  1         10     100      10 |
  |  2          9     200      20 |
  |  3          8     300      30 |
  |  4          7     400      40 |
  |  5          6     500      50 |
  |-------------------------------|
  |  6          5     600      60 |
  |  7          4     700      70 |
  |  8          3     800      80 |
  |  9          2     900      90 |
  | 10          1    1000     100 |
  +-------------------------------+

. 
. * Save original
. tempfile original

. save "`original'"
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St02690.000001 saved
    as .dta format

. 
. * Test 1: Standard sort
. di ""


. di "=== STANDARD CSORT ==="
=== STANDARD CSORT ===

. use "`original'", clear

. csort sort_key, verbose
command csort is unrecognized
r(199);

end of do-file
r(199);
