
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do benchmark/test_graph_format.do 

. * Test cbinscatter graph format
. * Compare visual output to verify binscatter-style formatting
. 
. clear all

. set more off

. 
. cd "/Users/Mike/Documents/GitHub/stata-ctools"
/Users/Mike/Documents/GitHub/stata-ctools

. adopath + "build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "build"

. 
. * Load test data
. sysuse auto, clear
(1978 automobile data)

. 
. * Test 1: Basic plot (single group, with linear fit)
. di "Test 1: Basic plot with linear fit"
Test 1: Basic plot with linear fit

. cbinscatter price mpg, nquantiles(10) linetype(linear)

. graph export "benchmark/graph_test1_basic.png", replace
(file benchmark/graph_test1_basic.png not found)
file benchmark/graph_test1_basic.png written in PNG format

. 
. * Test 2: No fit line
. di "Test 2: No fit line"
Test 2: No fit line

. cbinscatter price mpg, nquantiles(10) linetype(none)

. graph export "benchmark/graph_test2_nofit.png", replace
(file benchmark/graph_test2_nofit.png not found)
file benchmark/graph_test2_nofit.png written in PNG format

. 
. * Test 3: Quadratic fit
. di "Test 3: Quadratic fit"
Test 3: Quadratic fit

. cbinscatter price mpg, nquantiles(10) linetype(qfit)

. graph export "benchmark/graph_test3_qfit.png", replace
(file benchmark/graph_test3_qfit.png not found)
file benchmark/graph_test3_qfit.png written in PNG format

. 
. * Test 4: By groups
. di "Test 4: By groups"
Test 4: By groups

. cbinscatter price mpg, by(foreign) nquantiles(10) linetype(linear)

. graph export "benchmark/graph_test4_by.png", replace
(file benchmark/graph_test4_by.png not found)
file benchmark/graph_test4_by.png written in PNG format

. 
. * Test 5: Custom titles
. di "Test 5: Custom titles"
Test 5: Custom titles

. cbinscatter price mpg, nquantiles(10) linetype(linear) ///
>     title("Price vs MPG") ytitle("Price (USD)") xtitle("Miles per Gallon")

. graph export "benchmark/graph_test5_titles.png", replace
(file benchmark/graph_test5_titles.png not found)
file benchmark/graph_test5_titles.png written in PNG format

. 
. di "Graph format tests complete!"
Graph format tests complete!

. 
end of do-file
