
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_output_format.do 

. * Test cmerge output table formatting
. clear all

. set more off

. adopath + build
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "build"

. 
. di _n "=============================================="

==============================================

. di "TEST 1: All matched - should NOT show detail rows"
TEST 1: All matched - should NOT show detail rows

. di "=============================================="
==============================================

. 
. sysuse auto, clear
(1978 automobile data)

. gen id = _n

. keep id make price

. tempfile master

. save `master'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St11148.000001 saved
    as .dta format

. 
. sysuse auto, clear
(1978 automobile data)

. gen id = _n

. keep id weight length

. tempfile using_data

. save `using_data'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St11148.000002 saved
    as .dta format

. 
. use `master', clear
(1978 automobile data)

. cmerge 1:1 id using `using_data'

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0

    Matched                                74  (_merge==3)
    -----------------------------------------

. 
. di _n "=============================================="

==============================================

. di "TEST 2: keep(using) - should show 0 for master and matched"
TEST 2: keep(using) - should show 0 for master and matched

. di "=============================================="
==============================================

. 
. * Create partial overlap
. clear

. set obs 100
Number of observations (_N) was 0, now 100.

. gen id = _n

. gen x = runiform()

. tempfile master2

. save `master2'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St11148.000003 saved
    as .dta format

. 
. clear

. set obs 100
Number of observations (_N) was 0, now 100.

. gen id = _n + 50  // IDs 51-150

. gen y = runiform()

. tempfile using2

. save `using2'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St11148.000004 saved
    as .dta format

. 
. use `master2', clear

. di "Before merge: should show partial overlap"
Before merge: should show partial overlap

. cmerge 1:1 id using `using2'

    Result                      Number of obs
    -----------------------------------------
    Not matched                           100
        from master                        50  (_merge==1)
        from using                         50  (_merge==2)

    Matched                                50  (_merge==3)
    -----------------------------------------

. 
. use `master2', clear

. di _n "With keep(using): should show 0 for master and matched"

With keep(using): should show 0 for master and matched

. cmerge 1:1 id using `using2', keep(using)

    Result                      Number of obs
    -----------------------------------------
    Not matched                            50
        from master                         0  (_merge==1)
        from using                         50  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------

. 
. use `master2', clear

. di _n "With keep(match): should show 0 for master and using (detail rows hidd
> en)"

With keep(match): should show 0 for master and using (detail rows hidden)

. cmerge 1:1 id using `using2', keep(match)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0

    Matched                                50  (_merge==3)
    -----------------------------------------

. 
. use `master2', clear

. di _n "With keep(master using): should show 0 for matched"

With keep(master using): should show 0 for matched

. cmerge 1:1 id using `using2', keep(master using)

    Result                      Number of obs
    -----------------------------------------
    Not matched                           100
        from master                        50  (_merge==1)
        from using                         50  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------

. 
. di _n "=============================================="

==============================================

. di "TEST 3: Compare with Stata merge output"
TEST 3: Compare with Stata merge output

. di "=============================================="
==============================================

. 
. use `master2', clear

. di _n "Stata merge with keep(using):"

Stata merge with keep(using):

. merge 1:1 id using `using2', keep(using)

    Result                      Number of obs
    -----------------------------------------
    Not matched                            50
        from master                         0  (_merge==1)
        from using                         50  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------

. 
end of do-file
