
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do /tmp/test_ffirst.do 

. * Test ffirst option
. clear all

. scalar drop _all

. matrix drop _all

. set more off

. adopath + "/Users/Mike/Documents/GitHub/stata-ctools/build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/Users/Mike/Documents/GitHub/stata-ctools/build"

. 
. * Create test data
. clear

. set seed 12345

. set obs 500
Number of observations (_N) was 0, now 500.

. gen firm = ceil(_n / 10)

. gen z1 = runiform()

. gen z2 = rnormal()

. gen z3 = runiform()

. gen x_endog = 0.5*z1 + 0.3*z2 + 0.2*z3 + rnormal()

. gen x_exog = runiform()

. gen y = 2*x_endog + 1.0*x_exog + rnormal()

. 
. di _n "=== Test 1: ffirst with one endogenous variable ==="

=== Test 1: ffirst with one endogenous variable ===

. civreghdfe y (x_endog = z1 z2 z3) x_exog, absorb(firm) ffirst

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =      500
                                                      F(  2,   448) =   118.42
                                                      Prob > F      =   0.0000
Total (centered) SS     =  2778.2                     Centered R2   =   0.8406
Total (uncentered) SS   =  2778.2                     Uncentered R2 =   0.8406
Residual SS             =  442.7                      Root MSE      =        1

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     x_endog |    2.21284   .1639046    13.50   0.000     1.890723    2.534957
      x_exog |   .8251148   .1635317     5.05   0.000     .5037302    1.146499
------------------------------------------------------------------------------

------------------------------------------------------------------------------
First-stage regression summary statistics
------------------------------------------------------------------------------
                   Partial     F(3,448)            Prob > F
x_endog              0.0707           11.30            0.0000
------------------------------------------------------------------------------

Underidentification test (Anderson canon. corr. LM statistic):          35.331
                                                   Chi-sq(3) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               11.304
Stock-Yogo weak ID test critical values: 10% maximal IV size             22.30
                                         15% maximal IV size             12.83
                                         20% maximal IV size              9.54
                                         25% maximal IV size              7.80
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           1.922
                                                   Chi-sq(2) P-val =    0.3825
------------------------------------------------------------------------------
Instrumented:         x_endog
Included instruments: x_exog
Excluded instruments: z1 z2 z3
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        firm |        50           0          50     |
-----------------------------------------------------+


. 
. di _n "=== Test 2: ffirst with two endogenous variables ==="

=== Test 2: ffirst with two endogenous variables ===

. gen x_endog2 = 0.4*z2 + 0.3*z3 + rnormal()

. replace y = 2*x_endog + 1.5*x_endog2 + 1.0*x_exog + rnormal()
(500 real changes made)

. civreghdfe y (x_endog x_endog2 = z1 z2 z3) x_exog, absorb(firm) ffirst

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =      500
                                                      F(  3,   447) =   200.23
                                                      Prob > F      =   0.0000
Total (centered) SS     =  4001.4                     Centered R2   =   0.8906
Total (uncentered) SS   =  4001.4                     Uncentered R2 =   0.8906
Residual SS             =  437.7                      Root MSE      =        1

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     x_endog |   2.008593   .4099618     4.90   0.000     1.202902    2.814285
    x_endog2 |   1.331197   .2971014     4.48   0.000     .7473076    1.915086
      x_exog |   .8566627   .1659277     5.16   0.000     .5305676    1.182758
------------------------------------------------------------------------------

------------------------------------------------------------------------------
First-stage regression summary statistics
------------------------------------------------------------------------------
                   Partial     F(3,447)            Prob > F
x_endog              0.0707           11.30            0.0000
x_endog2             0.1403           24.27            0.0000
------------------------------------------------------------------------------

Underidentification test (Anderson canon. corr. LM statistic):           4.219
                                                   Chi-sq(2) P-val =    0.1213
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                1.265
Stock-Yogo weak ID test critical values: 10% maximal IV size             13.43
                                         15% maximal IV size              8.18
                                         20% maximal IV size              6.40
                                         25% maximal IV size              5.45
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.003
                                                   Chi-sq(1) P-val =    0.9574
------------------------------------------------------------------------------
Instrumented:         x_endog x_endog2
Included instruments: x_exog
Excluded instruments: z1 z2 z3
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        firm |        50           0          50     |
-----------------------------------------------------+


. 
. di _n "=== Test 3: Check stored results ==="

=== Test 3: Check stored results ===

. di "e(partial_r2_1) = " e(partial_r2_1)
e(partial_r2_1) = .07066171

. di "e(partial_r2_2) = " e(partial_r2_2)
e(partial_r2_2) = .14032244

. di "e(F_first1) = " e(F_first1)
e(F_first1) = 11.303786

. di "e(F_first2) = " e(F_first2)
e(F_first2) = 24.266389

. 
end of do-file
