
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do /tmp/test_display_options.do 

. * Test display options
. clear all

. set more off

. adopath + "/Users/Mike/Documents/GitHub/stata-ctools/build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/Users/Mike/Documents/GitHub/stata-ctools/build"

. 
. set seed 12345

. set obs 500
Number of observations (_N) was 0, now 500.

. gen firm = ceil(_n/10)

. gen z1 = rnormal()

. gen z2 = rnormal()

. gen x = rnormal()

. gen u = rnormal()

. gen endog_x = 0.5*z1 + 0.3*z2 + 0.2*u

. gen y = 1 + 2*endog_x + 1.5*x + 0.5*u + rnormal()

. 
. di _n "=== Test 1: level(90) ==="

=== Test 1: level(90) ===

. civreghdfe y (endog_x = z1 z2) x, absorb(firm) level(90)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =      500
                                                      F(  2,   448) =   669.93
                                                      Prob > F      =   0.0000
Total (centered) SS     =  2308.9                     Centered R2   =   0.7747
Total (uncentered) SS   =  2308.9                     Uncentered R2 =   0.7747
Residual SS             =  520.1                      Root MSE      =        1

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [90% conf. interval]
-------------+----------------------------------------------------------------
     endog_x |     2.0905   .0852746    24.51   0.000     1.949945    2.231055
           x |   1.484181   .0498034    29.80   0.000     1.402092     1.56627
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):         451.991
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):             2104.192
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.001
                                                   Chi-sq(1) P-val =    0.9814
------------------------------------------------------------------------------
Instrumented:         endog_x
Included instruments: x
Excluded instruments: z1 z2
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        firm |        50           0          50     |
-----------------------------------------------------+


. di "e(level) = " e(level)
e(level) = 90

. assert e(level) == 90

. 
. di _n "=== Test 2: noheader ==="

=== Test 2: noheader ===

. civreghdfe y (endog_x = z1 z2) x, absorb(firm) noheader
------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     endog_x |     2.0905   .0852746    24.51   0.000     1.922912    2.258088
           x |   1.484181   .0498034    29.80   0.000     1.386304    1.582058
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):         451.991
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):             2104.192
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.001
                                                   Chi-sq(1) P-val =    0.9814
------------------------------------------------------------------------------
Instrumented:         endog_x
Included instruments: x
Excluded instruments: z1 z2
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        firm |        50           0          50     |
-----------------------------------------------------+


. 
. di _n "=== Test 3: nofooter ==="

=== Test 3: nofooter ===

. civreghdfe y (endog_x = z1 z2) x, absorb(firm) nofooter

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =      500
                                                      F(  2,   448) =   669.93
                                                      Prob > F      =   0.0000
Total (centered) SS     =  2308.9                     Centered R2   =   0.7747
Total (uncentered) SS   =  2308.9                     Uncentered R2 =   0.7747
Residual SS             =  520.1                      Root MSE      =        1

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     endog_x |     2.0905   .0852746    24.51   0.000     1.922912    2.258088
           x |   1.484181   .0498034    29.80   0.000     1.386304    1.582058
------------------------------------------------------------------------------

. 
. di _n "=== Test 4: nooutput ==="

=== Test 4: nooutput ===

. civreghdfe y (endog_x = z1 z2) x, absorb(firm) nooutput

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =      500
                                                      F(  2,   448) =   669.93
                                                      Prob > F      =   0.0000
Total (centered) SS     =  2308.9                     Centered R2   =   0.7747
Total (uncentered) SS   =  2308.9                     Uncentered R2 =   0.7747
Residual SS             =  520.1                      Root MSE      =        1

Underidentification test (Anderson canon. corr. LM statistic):         451.991
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):             2104.192
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.001
                                                   Chi-sq(1) P-val =    0.9814
------------------------------------------------------------------------------
Instrumented:         endog_x
Included instruments: x
Excluded instruments: z1 z2
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        firm |        50           0          50     |
-----------------------------------------------------+


. 
. di _n "=== Test 5: title() ==="

=== Test 5: title() ===

. civreghdfe y (endog_x = z1 z2) x, absorb(firm) title("My Custom Title")

My Custom Title
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =      500
                                                      F(  2,   448) =   669.93
                                                      Prob > F      =   0.0000
Total (centered) SS     =  2308.9                     Centered R2   =   0.7747
Total (uncentered) SS   =  2308.9                     Uncentered R2 =   0.7747
Residual SS             =  520.1                      Root MSE      =        1

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     endog_x |     2.0905   .0852746    24.51   0.000     1.922912    2.258088
           x |   1.484181   .0498034    29.80   0.000     1.386304    1.582058
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):         451.991
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):             2104.192
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.001
                                                   Chi-sq(1) P-val =    0.9814
------------------------------------------------------------------------------
Instrumented:         endog_x
Included instruments: x
Excluded instruments: z1 z2
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        firm |        50           0          50     |
-----------------------------------------------------+


. 
. di _n "=== Test 6: depname() ==="

=== Test 6: depname() ===

. civreghdfe y (endog_x = z1 z2) x, absorb(firm) depname("outcome")

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =      500
                                                      F(  2,   448) =   669.93
                                                      Prob > F      =   0.0000
Total (centered) SS     =  2308.9                     Centered R2   =   0.7747
Total (uncentered) SS   =  2308.9                     Uncentered R2 =   0.7747
Residual SS             =  520.1                      Root MSE      =        1

option depname() not allowed
r(198);

end of do-file
r(198);
