
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do /tmp/test_verbose.do 

. * Test verbose timing output
. clear all

. adopath + "build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "build"

. cap program drop ctools_plugin

. program ctools_plugin, plugin using("build/ctools_mac_arm.plugin")

. 
. di "Testing verbose option..."
Testing verbose option...

. di "======================================================================"
======================================================================

. 
. set seed 12345

. set obs 1000000
Number of observations (_N) was 0, now 1,000,000.

. gen double x = rnormal()

. gen double y = runiform()

. 
. di _n "Test 1: csort with verbose option"

Test 1: csort with verbose option

. csort x, verbose algorithm(ips4o)
csort: Sorting on variables: x
       All variables: x y __000000
       Sort key indices:  1
       Algorithm: ips4o

csort timing breakdown:
  Data load:    0.0048 sec
  Sort:         0.0096 sec
  Data store:   0.0029 sec
  Total:        0.0172 sec

. 
. di _n "Test 2: csort with timeit option"

Test 2: csort with timeit option

. csort y, timeit algorithm(lsd)

csort timing breakdown:
  Data load:    0.0048 sec
  Sort:         0.0100 sec
  Data store:   0.0028 sec
  Total:        0.0176 sec

. 
. di _n "Test 3: csort without options (no timing shown)"

Test 3: csort without options (no timing shown)

. csort x

. 
. di _n "======================================================================
> "

======================================================================

. di "Tests complete"
Tests complete

. 
end of do-file
