
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_small.do 

. adopath + "./build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "./build"

. 
. * Use small dataset like webuse autosize
. webuse autosize, clear
(1978 automobile data)

. desc, short

Contains data from https://www.stata-press.com/data/r18/autosize.dta
 Observations:             6                  1978 automobile data
    Variables:             3                  3 Apr 2022 17:53
Sorted by: 

. tempfile master

. save `master'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St54932.000001 saved
    as .dta format

. 
. webuse autoexpense, clear
(1978 automobile data)

. desc, short

Contains data from https://www.stata-press.com/data/r18/autoexpense.dta
 Observations:             5                  1978 automobile data
    Variables:             3                  3 Apr 2022 17:53
Sorted by: 

. tempfile using_file

. save `using_file'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St54932.000002 saved
    as .dta format

. 
. use `master', clear
(1978 automobile data)

. di "Master loaded: " _N " obs"
Master loaded: 6 obs

. 
. di "Calling cmerge..."
Calling cmerge...

. cmerge 1:1 make using `using_file', verbose

------------------------------------------------------------
cmerge: Optimized C-Accelerated Merge
------------------------------------------------------------
Merge type:  1:1
Key vars:    make
Using file:  /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St54932.000002
Master obs:  6
Master vars: 3
------------------------------------------------------------

Phase 1: Loading using dataset (keys + keepusing only)...
  Using: 5 obs, keeping 1 keys + 2 keepusing vars
cmerge: Loading using keys...
cmerge: Loading keepusing variables...
cmerge: Sorting using data...
  Loaded 5 obs (1 keys, 2 keepusing) in 0.0 ms, sorted in 0.0 ms

Phase 2: Executing merge with streaming...
cmerge: Loading master keys only...
  Loaded 6 obs, 2 vars in 0.0 ms
cmerge: Sorting master keys...
  Sorted in 0.0 ms
cmerge: Performing merge join...
  Merge produced 6 rows in 0.0 ms
cmerge: Writing output...
cmerge: Streaming master variables...
  Wrote keepusing in 0.0 ms, streamed 3 master vars in 0.0 ms

Total C time: 0.1 ms
  Load: 0.0 ms, Sort: 0.0 ms, Merge: 0.0 ms

    Result                      Number of obs
    -----------------------------------------
    Not matched                             1
        from master                         1  (_merge==1)

    Matched                                 5  (_merge==3)
    -----------------------------------------

Total time:     0.002 seconds

. di "cmerge completed!"
cmerge completed!

. list

     +-----------------------------------------------------------+
     | make               weight   length   price   mpg   _merge |
     |-----------------------------------------------------------|
  1. | BMW 320i            2,650      177    9735    25        3 |
  2. | Cad. Seville        4,290      204   15906    21        3 |
  3. | Datsun 210          2,020      165    4589    35        3 |
  4. | Plym. Arrow         3,260      170       .     .        1 |
  5. | Pont. Grand Prix    3,210      201    5222    19        3 |
     |-----------------------------------------------------------|
  6. | Toyota Celica       2,410      174    5899    18        3 |
     +-----------------------------------------------------------+

. 
end of do-file
