
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_string_key2.do 

. * Test cmerge with string key - partial match case
. clear all

. set more off

. adopath + build
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "build"

. 
. * Create master dataset (fewer cars)
. sysuse auto, clear
(1978 automobile data)

. keep if foreign == 0   // Domestic only = 52 cars
(22 observations deleted)

. keep make price mpg

. sort make

. tempfile master

. save `master'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St07364.000001 saved
    as .dta format

. 
. * Create using dataset (all cars)
. sysuse auto, clear
(1978 automobile data)

. keep make weight length

. sort make

. tempfile using

. save `using'
file /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St07364.000002 saved
    as .dta format

. 
. * Load master and merge
. use `master', clear
(1978 automobile data)

. di "Master observations (domestic only): " _N
Master observations (domestic only): 52

. 
. * Merge with keep(match using)
. cmerge 1:1 make using `using', verbose keep(match using)

------------------------------------------------------------
cmerge: Optimized C-Accelerated Merge
------------------------------------------------------------
Merge type:  1:1
Key vars:    make
Using file:  /var/folders/5l/0w9hn2t9637147hqnm7bgk000000gn/T//St07364.000002
Master obs:  52
Master vars: 3
------------------------------------------------------------

Phase 1: Loading using dataset (keys + keepusing only)...
  Using: 74 obs, keeping 1 keys + 2 keepusing vars

Phase 2: Executing merge with streaming...

    Result                      Number of obs
    -----------------------------------------
    Not matched                            22
        from master                         0  (_merge==1)
        from using                         22  (_merge==2)

    Matched                                52  (_merge==3)
    -----------------------------------------

cmerge timing breakdown:

  [Phase 1: Load using data into C]
    Load keys:              0.0000 sec
    Load keepusing:         0.0000 sec
    Sort using:             0.0011 sec
    Apply permutation:      0.0000 sec
    --------------------------------
    Phase 1 C total:        0.0011 sec

  [Phase 2: Execute merge]
    Load master keys:       0.0000 sec
    Sort master:            0.0001 sec
    Merge join:             0.0000 sec
    Reorder output:         0.0000 sec
    Write keepusing:        0.0000 sec
    Stream master (3 vars):  0.0000 sec
    Cleanup:                0.0000 sec
    --------------------------------
    Phase 2 C total:        0.0002 sec

  [Outside C code]
    Pre-plugin1 ado:        0.0010 sec  (load using.dta, parse)
    Plugin1 overhead:      -0.0001 sec  (Stata's plugin framework)
    Inter-plugin ado:       0.0010 sec  (breakdown below)
      - restore:            0.0000 sec
      - append vars:        0.0000 sec  (create placeholders, _merge)
      - st_store row:       0.0000 sec  (fill _orig_row)
      - set obs:            0.0000 sec  (expand to max output)
    Plugin2 overhead:      -0.0002 sec  (Stata's plugin framework)
    Post-plugin ado:        0.0000 sec  (labels, cleanup)
    --------------------------------
    Non-C total:            0.0016 sec

  [Summary]
    Wall clock total:       0.0030 sec
    C code:                   46.0%%
    Plugin overhead:         -12.6%%
    Ado-file overhead:        66.7%%

. 
. * Check results
. di ""


. di "After merge observations: " _N
After merge observations: 74

. di ""


. tab _merge

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |         22       29.73       29.73
          3 |         52       70.27      100.00
------------+-----------------------------------
      Total |         74      100.00

. 
. di ""


. di "First 10 observations:"
First 10 observations:

. list make price mpg weight length _merge in 1/10

     +--------------------------------------------------------+
     | make            price   mpg   weight   length   _merge |
     |--------------------------------------------------------|
  1. | AMC Concord     4,099    22     2930      186        3 |
  2. | AMC Pacer       4,749    17     3350      173        3 |
  3. | AMC Spirit      3,799    22     2640      168        3 |
  4. | Audi 5000           .     .     2830      189        2 |
  5. | Audi Fox            .     .     2070      174        2 |
     |--------------------------------------------------------|
  6. | BMW 320i            .     .     2650      177        2 |
  7. | Buick Century   4,816    20     3250      196        3 |
  8. | Buick Electra   7,827    15     4080      222        3 |
  9. | Buick LeSabre   5,788    18     3670      218        3 |
 10. | Buick Opel      4,453    26     2230      170        3 |
     +--------------------------------------------------------+

. 
. di ""


. di "Observations from using only (should be foreign cars):"
Observations from using only (should be foreign cars):

. list make weight length _merge if _merge == 2

     +-------------------------------------------+
     | make             weight   length   _merge |
     |-------------------------------------------|
  4. | Audi 5000          2830      189        2 |
  5. | Audi Fox           2070      174        2 |
  6. | BMW 320i           2650      177        2 |
 23. | Datsun 200         2370      170        2 |
 24. | Datsun 210         2020      165        2 |
     |-------------------------------------------|
 25. | Datsun 510         2280      170        2 |
 26. | Datsun 810         2750      184        2 |
 31. | Fiat Strada        2130      161        2 |
 34. | Honda Accord       2240      172        2 |
 35. | Honda Civic        1760      149        2 |
     |-------------------------------------------|
 39. | Mazda GLC          1980      154        2 |
 53. | Peugeot 604        3420      192        2 |
 65. | Renault Le Car     1830      142        2 |
 66. | Subaru             2050      164        2 |
 67. | Toyota Celica      2410      174        2 |
     |-------------------------------------------|
 68. | Toyota Corolla     2200      165        2 |
 69. | Toyota Corona      2670      175        2 |
 70. | VW Dasher          2160      172        2 |
 71. | VW Diesel          2040      155        2 |
 72. | VW Rabbit          1930      155        2 |
     |-------------------------------------------|
 73. | VW Scirocco        1990      156        2 |
 74. | Volvo 260          3170      193        2 |
     +-------------------------------------------+

. 
. * Verify no duplicates in make
. duplicates report make

Duplicates in terms of make

--------------------------------------
   Copies | Observations       Surplus
----------+---------------------------
        1 |           74             0
--------------------------------------

. 
end of do-file
