
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do benchmark/test_permute_50vars.do 

. * Benchmark permutation with 10M obs, 50 variables
. 
. clear all

. set more off

. adopath + "build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "build"

. 
. local size = 10000000

. local nvars = 50

. 
. di as text ""


. di as text "========================================"
========================================

. di as text "Dataset size: " `size' " observations"
Dataset size: 10000000 observations

. di as text "Variables:    " `nvars' " numeric variables"
Variables:    50 numeric variables

. di as text "========================================"
========================================

. 
. clear

. set seed 12345

. quietly set obs `size'

. 
. forval i = 1/`nvars' {
  2.     quietly gen x`i' = runiform()
  3. }

. 
. di as text ""


. di as text "Sorting with IPS4O (default):"
Sorting with IPS4O (default):

. csort x1, verbose
csort: Sorting on variables: x1
       All variables: x1 x2 x3 x4 x5 x6 x7 x8 x9 x10 x11 x12 x13 x14 x15 x16 x1
> 7 x18 x19 x20 x21 x22 x23 x24 x25 x26 x27 x28 x29 x30 x31 x32 x33 x34 x35 x36
>  x37 x38 x39 x40 x41 x42 x43 x44 x45 x46 x47 x48 x49 x50 __000000
       Sort key indices:  1
       Algorithm: ips4o (default)

-------------------------------------------------------
csort timing breakdown:
-------------------------------------------------------
  C plugin internals:
    Data load:                1.0079 sec
    Sort (compute order):     0.0726 sec
    Sort (apply permute):     0.5040 sec
    Data store:               0.6410 sec
    Memory cleanup:           0.0266 sec
  -----------------------------------------------------
    C plugin total:           2.2521 sec
  -----------------------------------------------------
  Stata overhead:
    Pre-plugin parsing:       0.0160 sec
    Plugin call overhead:    -0.0001 sec
    Post-plugin sort:         0.1900 sec
  -----------------------------------------------------
    Stata overhead total:     0.2059 sec
-------------------------------------------------------
    Wall clock total:         2.4580 sec
-------------------------------------------------------

. 
. di as text ""


. di as text "Sort time:    " %8.4f _csort_time_sort " sec"
Sort time:      0.0726 sec

. di as text "Permute time: " %8.4f _csort_time_permute " sec"
Permute time:   0.5040 sec

. di as text "Ratio (permute/sort): " %5.2f (_csort_time_permute / _csort_time_
> sort)
Ratio (permute/sort):  6.95

. 
. di as text ""


. di as text "========================================"
========================================

. di as text "Benchmark complete!"
Benchmark complete!

. di as text "========================================"
========================================

. 
end of do-file
