
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do /tmp/test_ips4o_debug.do 

. * Debug IPS4o issue
. adopath + "build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "build"

. cap program drop ctools_plugin

. program ctools_plugin, plugin using("build/ctools_mac_arm.plugin")

. 
. di "=== Testing IPS4o with small dataset ==="
=== Testing IPS4o with small dataset ===

. sysuse auto, clear
(1978 automobile data)

. csort price, algorithm(ips4o)
IPS4o DEBUG: Entry nobs=74 nsort=1 nvars=13
IPS4o DEBUG: Sorting var_idx=1 (k=0)
IPS4o DEBUG: Calling ips4o_sort_by_numeric_var
IPS4o DEBUG: Sort returned rc=0
IPS4o DEBUG: Calling ips4o_apply_permutation
IPS4o DEBUG: Permutation returned rc=0
IPS4o DEBUG: Success!

. di "Small dataset (74 obs): PASSED"
Small dataset (74 obs): PASSED

. 
. di _n "=== Testing IPS4o with 1000 obs ==="

=== Testing IPS4o with 1000 obs ===

. clear

. set seed 12345

. set obs 1000
Number of observations (_N) was 0, now 1,000.

. gen value = rnormal()

. csort value, algorithm(ips4o)
IPS4o DEBUG: Entry nobs=1000 nsort=1 nvars=2
IPS4o DEBUG: Sorting var_idx=0 (k=0)
IPS4o DEBUG: Calling ips4o_sort_by_numeric_var
IPS4o DEBUG: Sort returned rc=0
IPS4o DEBUG: Calling ips4o_apply_permutation
IPS4o DEBUG: Permutation returned rc=0
IPS4o DEBUG: Success!

. di "1000 obs: PASSED"
1000 obs: PASSED

. 
. di _n "=== Testing IPS4o with 5000 obs ==="

=== Testing IPS4o with 5000 obs ===

. clear

. set seed 12345

. set obs 5000
Number of observations (_N) was 0, now 5,000.

. gen value = rnormal()

. csort value, algorithm(ips4o)
IPS4o DEBUG: Entry nobs=5000 nsort=1 nvars=2
IPS4o DEBUG: Sorting var_idx=0 (k=0)
IPS4o DEBUG: Calling ips4o_sort_by_numeric_var
IPS4o DEBUG: Sort returned rc=0
IPS4o DEBUG: Calling ips4o_apply_permutation
IPS4o DEBUG: Permutation returned rc=0
IPS4o DEBUG: Success!

. di "5000 obs: PASSED"
5000 obs: PASSED

. 
. di _n "=== Testing IPS4o with 10000 obs ==="

=== Testing IPS4o with 10000 obs ===

. clear

. set seed 12345

. set obs 10000
Number of observations (_N) was 0, now 10,000.

. gen value = rnormal()

. di "Created 10K observations, now sorting..."
Created 10K observations, now sorting...

. csort value, algorithm(ips4o)
IPS4o DEBUG: Entry nobs=10000 nsort=1 nvars=2
IPS4o DEBUG: Sorting var_idx=0 (k=0)
IPS4o DEBUG: Calling ips4o_sort_by_numeric_var
IPS4o DEBUG: Sort returned rc=0
IPS4o DEBUG: Calling ips4o_apply_permutation
IPS4o DEBUG: Permutation returned rc=0
IPS4o DEBUG: Success!

. di "10000 obs: PASSED"
10000 obs: PASSED

. 
. di _n "=== ALL TESTS PASSED ==="

=== ALL TESTS PASSED ===

. 
end of do-file
