
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do /tmp/test_save.do 

. * Test savefirst and saverf options
. clear all

. scalar drop _all

. matrix drop _all

. set more off

. adopath + "/Users/Mike/Documents/GitHub/stata-ctools/build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "/Users/Mike/Documents/GitHub/stata-ctools/build"

. 
. * Create test data
. clear

. set seed 12345

. set obs 500
Number of observations (_N) was 0, now 500.

. gen firm = ceil(_n / 10)

. gen z1 = runiform()

. gen z2 = rnormal()

. gen x_endog = 0.5*z1 + 0.3*z2 + rnormal()

. gen x_exog = runiform()

. gen y = 2*x_endog + 1.0*x_exog + rnormal()

. 
. di _n "=== Test 1: savefirst option ==="

=== Test 1: savefirst option ===

. civreghdfe y (x_endog = z1 z2) x_exog, absorb(firm) savefirst

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =      500
                                                      F(  2,   448) =   119.70
                                                      Prob > F      =   0.0000
Total (centered) SS     =  2248.4                     Centered R2   =   0.8200
Total (uncentered) SS   =  2248.4                     Uncentered R2 =   0.8200
Residual SS             =  404.8                      Root MSE      =        1

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     x_endog |   2.038134   .1482234    13.75   0.000     1.746834    2.329433
      x_exog |   .7617465     .16139     4.72   0.000      .444571    1.078922
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          44.064
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               21.600
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.687
                                                   Chi-sq(1) P-val =    0.4072
------------------------------------------------------------------------------
Instrumented:         x_endog
Included instruments: x_exog
Excluded instruments: z1 z2
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        firm |        50           0          50     |
-----------------------------------------------------+


Estimation stored as: _civreghdfe_main
First-stage F-statistics available in e(F_first1), e(F_first2), etc.

. estimates dir

-----------------------------------------------------------------------------
             |           Dependent  Number of        
        Name | Command    variable     param.  Title 
-------------+---------------------------------------------------------------
_civreghdf~n | civreghdfe        y          2  IV (2SLS) regression with HDFE
-----------------------------------------------------------------------------

. 
. di _n "=== Test 2: savefirst with custom prefix ==="

=== Test 2: savefirst with custom prefix ===

. civreghdfe y (x_endog = z1 z2) x_exog, absorb(firm) savefirst savefprefix(mye
> st_)

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =      500
                                                      F(  2,   448) =   119.70
                                                      Prob > F      =   0.0000
Total (centered) SS     =  2248.4                     Centered R2   =   0.8200
Total (uncentered) SS   =  2248.4                     Uncentered R2 =   0.8200
Residual SS             =  404.8                      Root MSE      =        1

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     x_endog |   2.038134   .1482234    13.75   0.000     1.746834    2.329433
      x_exog |   .7617465     .16139     4.72   0.000      .444571    1.078922
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          44.064
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               21.600
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.687
                                                   Chi-sq(1) P-val =    0.4072
------------------------------------------------------------------------------
Instrumented:         x_endog
Included instruments: x_exog
Excluded instruments: z1 z2
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        firm |        50           0          50     |
-----------------------------------------------------+


Estimation stored as: myest_main
First-stage F-statistics available in e(F_first1), e(F_first2), etc.

. estimates dir

-----------------------------------------------------------------------------
             |           Dependent  Number of        
        Name | Command    variable     param.  Title 
-------------+---------------------------------------------------------------
_civreghdf~n | civreghdfe        y          2  IV (2SLS) regression with HDFE
  myest_main | civreghdfe        y          2  IV (2SLS) regression with HDFE
-----------------------------------------------------------------------------

. 
. di _n "=== Test 3: saverf option ==="

=== Test 3: saverf option ===

. civreghdfe y (x_endog = z1 z2) x_exog, absorb(firm) saverf

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =      500
                                                      F(  2,   448) =   119.70
                                                      Prob > F      =   0.0000
Total (centered) SS     =  2248.4                     Centered R2   =   0.8200
Total (uncentered) SS   =  2248.4                     Uncentered R2 =   0.8200
Residual SS             =  404.8                      Root MSE      =        1

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     x_endog |   2.038134   .1482234    13.75   0.000     1.746834    2.329433
      x_exog |   .7617465     .16139     4.72   0.000      .444571    1.078922
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          44.064
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               21.600
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.687
                                                   Chi-sq(1) P-val =    0.4072
------------------------------------------------------------------------------
Instrumented:         x_endog
Included instruments: x_exog
Excluded instruments: z1 z2
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        firm |        50           0          50     |
-----------------------------------------------------+


Estimation stored as: _civreghdfe_rf_main

. estimates dir

-----------------------------------------------------------------------------
             |           Dependent  Number of        
        Name | Command    variable     param.  Title 
-------------+---------------------------------------------------------------
_civreghdf~n | civreghdfe        y          2  IV (2SLS) regression with HDFE
  myest_main | civreghdfe        y          2  IV (2SLS) regression with HDFE
_civreghdf~n | civreghdfe        y          2  IV (2SLS) regression with HDFE
-----------------------------------------------------------------------------

. 
. di _n "=== Test 4: Both savefirst and saverf ==="

=== Test 4: Both savefirst and saverf ===

. civreghdfe y (x_endog = z1 z2) x_exog, absorb(firm) savefirst saverf

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =      500
                                                      F(  2,   448) =   119.70
                                                      Prob > F      =   0.0000
Total (centered) SS     =  2248.4                     Centered R2   =   0.8200
Total (uncentered) SS   =  2248.4                     Uncentered R2 =   0.8200
Residual SS             =  404.8                      Root MSE      =        1

------------------------------------------------------------------------------
           y | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     x_endog |   2.038134   .1482234    13.75   0.000     1.746834    2.329433
      x_exog |   .7617465     .16139     4.72   0.000      .444571    1.078922
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          44.064
                                                   Chi-sq(2) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               21.600
Stock-Yogo weak ID test critical values: 10% maximal IV size             19.93
                                         15% maximal IV size             11.59
                                         20% maximal IV size              8.75
                                         25% maximal IV size              7.25
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.687
                                                   Chi-sq(1) P-val =    0.4072
------------------------------------------------------------------------------
Instrumented:         x_endog
Included instruments: x_exog
Excluded instruments: z1 z2
Partialled-out:       _cons
                      nb: total SS, model F and R2s are after partialling-out;
                          any small-sample adjustments include partialled-out
                          variables in regressor count K
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
        firm |        50           0          50     |
-----------------------------------------------------+


Estimation stored as: _civreghdfe_main
First-stage F-statistics available in e(F_first1), e(F_first2), etc.

Estimation stored as: _civreghdfe_rf_main

. estimates dir

-----------------------------------------------------------------------------
             |           Dependent  Number of        
        Name | Command    variable     param.  Title 
-------------+---------------------------------------------------------------
_civreghdf~n | civreghdfe        y          2  IV (2SLS) regression with HDFE
  myest_main | civreghdfe        y          2  IV (2SLS) regression with HDFE
_civreghdf~n | civreghdfe        y          2  IV (2SLS) regression with HDFE
-----------------------------------------------------------------------------

. 
. di _n "=== Test 5: Restore saved estimates ==="

=== Test 5: Restore saved estimates ===

. estimates restore _civreghdfe_main
(results _civreghdfe_main are active now)

. ereturn list

scalars:
           e(sargan_p) =  .4071802021198854
               e(cd_f) =  21.60024692340332
            e(widstat) =  21.60024692340332
         e(endog_chi2) =  5.571754311899332
            e(endog_f) =  5.571754311899332
           e(endog_df) =  1
            e(endog_p) =  .0182524648317024
                  e(N) =  500
               e(df_r) =  448
               e(df_a) =  50
                  e(K) =  2
              e(level) =  95
            e(K_endog) =  1
             e(K_exog) =  1
               e(K_iv) =  3
                  e(G) =  1
           e(F_first1) =  21.60024692340332
                e(rss) =  404.8103798973298
                e(tss) =  2248.356734908787
                 e(r2) =  .8199527799071652
               e(rmse) =  .9505759296264087
                  e(F) =  119.7004715110176
             e(idstat) =  44.0641068186146
               e(iddf) =  2
                e(idp) =  2.70147392074e-10
             e(sargan) =  .6870189464615104
          e(sargan_df) =  1

macros:
         e(properties) : "b V"
                e(cmd) : "civreghdfe"
            e(cmdline) : "civreghdfe y (x_endog = z1 z2) x_exog"
             e(depvar) : "y"
          e(endogvars) : "x_endog"
           e(exogvars) : "x_exog"
        e(instruments) : "z1 z2"
             e(absorb) : "firm"
              e(title) : "IV (2SLS) regression with HDFE"
              e(model) : "2sls"

matrices:
                  e(b) :  1 x 2
                  e(V) :  2 x 2

functions:
             e(sample)   

. 
end of do-file
