
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_addvar.do 

. clear all

. set obs 100
Number of observations (_N) was 0, now 100.

. 
. di "Before javacall:"
Before javacall:

. desc

Contains data
 Observations:           100                  
    Variables:             0                  
Sorted by: 
     Note: Dataset has changed since last saved.

. 
. javacall AddVar3 create, classpath(/Users/Mike/Documents/GitHub/stata-ctools)
>  args(double testvar)
AddVar3 called
About to call Data.addVarDouble...
Result: 0

. 
. di "After javacall:"
After javacall:

. desc

Contains data
 Observations:           100                  
    Variables:             1                  
-------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------
testvar         double  %10.0g                
-------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. 
end of do-file
