
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do benchmark/test_missing_handling.do 

. * Test that cbinscatter correctly handles missing values
. * This verifies the C plugin's missing value validation
. 
. clear all

. set more off

. 
. cd "/Users/Mike/Documents/GitHub/stata-ctools"
/Users/Mike/Documents/GitHub/stata-ctools

. adopath + "build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "build"

. 
. di "========================================"
========================================

. di "Missing Value Handling Test"
Missing Value Handling Test

. di "========================================"
========================================

. 
. * Create data with missing values
. clear

. set obs 1000
Number of observations (_N) was 0, now 1,000.

. gen x = rnormal()

. gen y = 2*x + rnormal()

. gen control1 = rnormal()

. gen wt = runiform() + 0.5

. 
. * Introduce missing values
. replace y = . in 1/50
(50 real changes made, 50 to missing)

. replace x = . in 51/100
(50 real changes made, 50 to missing)

. replace control1 = . in 101/150
(50 real changes made, 50 to missing)

. replace wt = . in 151/175
(25 real changes made, 25 to missing)

. 
. di _n "Data summary:"

Data summary:

. di "Total obs: " _N
Total obs: 1000

. count if missing(y)
  50

. di "Missing y: " r(N)
Missing y: 50

. count if missing(x)
  50

. di "Missing x: " r(N)
Missing x: 50

. count if missing(control1)
  50

. di "Missing control1: " r(N)
Missing control1: 50

. count if missing(wt)
  25

. di "Missing wt: " r(N)
Missing wt: 25

. 
. * Test 1: Basic - should drop missing y and x
. di _n "Test 1: Basic (should use 900 obs)"

Test 1: Basic (should use 900 obs)

. cbinscatter y x, nquantiles(10) nograph verbose

------------------------------------------------------------
cbinscatter: C-Accelerated Binned Scatter
------------------------------------------------------------
Y variable: y
X variable: x
Bins:       10
Obs:        1000
------------------------------------------------------------

cbinscatter: starting computation
cbinscatter: loaded 900 observations (100 dropped)
cbinscatter: bin computation complete (0.000 sec)
cbinscatter: line fitting complete (0.000 sec)
cbinscatter: total time 0.000 sec

Timing breakdown:
  Load:         0.0000 sec
  Residualize:  0.0000 sec
  Bin comp:     0.0000 sec
  Line fit:     0.0000 sec
  Total:        0.0001 sec
(dropped 100 observations due to missing values)

. di "N used: " e(N)
N used: 900

. assert e(N) == 900

. 
. * Test 2: With controls - should drop missing controls too
. di _n "Test 2: With controls (should use 850 obs)"

Test 2: With controls (should use 850 obs)

. cbinscatter y x, controls(control1) nquantiles(10) nograph verbose

------------------------------------------------------------
cbinscatter: C-Accelerated Binned Scatter
------------------------------------------------------------
Y variable: y
X variable: x
Controls:   control1
Bins:       10
Obs:        1000
------------------------------------------------------------

cbinscatter: starting computation
cbinscatter: loaded 850 observations (150 dropped)
cbinscatter: residualization complete (0.000 sec)
cbinscatter: bin computation complete (0.000 sec)
cbinscatter: line fitting complete (0.000 sec)
cbinscatter: total time 0.000 sec

Timing breakdown:
  Load:         0.0000 sec
  Residualize:  0.0000 sec
  Bin comp:     0.0000 sec
  Line fit:     0.0000 sec
  Total:        0.0001 sec
(dropped 150 observations due to missing values)

. di "N used: " e(N)
N used: 850

. assert e(N) == 850

. 
. * Test 3: With weights - should drop missing weights too
. di _n "Test 3: With weights (should use 875 obs)"

Test 3: With weights (should use 875 obs)

. cbinscatter y x [aw=wt], nquantiles(10) nograph verbose

------------------------------------------------------------
cbinscatter: C-Accelerated Binned Scatter
------------------------------------------------------------
Y variable: y
X variable: x
Bins:       10
Obs:        975
------------------------------------------------------------

cbinscatter: starting computation
cbinscatter: loaded 875 observations (125 dropped)
cbinscatter: bin computation complete (0.000 sec)
cbinscatter: line fitting complete (0.000 sec)
cbinscatter: total time 0.000 sec

Timing breakdown:
  Load:         0.0000 sec
  Residualize:  0.0000 sec
  Bin comp:     0.0000 sec
  Line fit:     0.0000 sec
  Total:        0.0001 sec
(dropped 125 observations due to missing values)

. di "N used: " e(N)
N used: 875

. assert e(N) == 875

. 
. di _n "========================================"

========================================

. di "All missing value tests passed!"
All missing value tests passed!

. di "========================================"
========================================

. 
end of do-file
