
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do /tmp/test_global3.do 

. clear all

. sysuse auto, clear
(1978 automobile data)

. qui ds

. local varlist `r(varlist)'

. 
. * Test without underscore prefix
. di "Test with CEXPORT_VARNAMES:"
Test with CEXPORT_VARNAMES:

. capture noisily global CEXPORT_VARNAMES `varlist'

. di "Result: " _rc
Result: 0

. di "Value: ${CEXPORT_VARNAMES}"
Value: make price mpg rep78 headroom trunk weight length turn displacement gear
> _ratio foreign

. 
. * Test using c_local instead
. program define test_prog
  1.     args varlist
  2.     c_local result `varlist'
  3. end

. test_prog `varlist'

. di "c_local result: `result'"
c_local result: make

. 
end of do-file
