
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_predict_precision.do 

. * Check precision issue in predictions
. clear all

. set more off

. 
. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. 
. sysuse auto, clear
(1978 automobile data)

. 
. di _n "=== Precision investigation ===" _n

=== Precision investigation ===


. 
. * First check the mpg variable storage type
. describe mpg

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------
mpg             int     %8.0g                 Mileage (mpg)

. di "mpg[1] = " %20.15f mpg[1]
mpg[1] =   22.000000000000000

. 
. * Run creghdfe
. creghdfe price mpg, absorb(foreign)
(HDFE estimator converged in 2 iterations)

HDFE Linear regression                          Number of obs     =         74
Absorbing 1 HDFE group                          F(  1,      71)   =      27.91
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2838
                                                Adj R-squared     =     0.2637
                                                Within R-sq.      =     0.2821
                                                Root MSE          =  2530.9456

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -294.1955   55.69172    -5.28   0.000    -405.2417   -183.1494
       _cons |   12430.83    1222.03    10.17   0.000     9994.169    14867.48
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+

. 
. * Check what type _predict creates
. predict yhat_c, xb

. describe yhat_c

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------
yhat_c          float   %9.0g                 Linear prediction

. di "yhat_c[1] = " %20.15f yhat_c[1]
yhat_c[1] = 5958.524902343750000

. 
. * Now run reghdfe and check its predict type
. reghdfe price mpg, absorb(foreign) resid
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =         74
Absorbing 1 HDFE group                            F(   1,     71) =      27.91
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.2838
                                                  Adj R-squared   =     0.2637
                                                  Within R-sq.    =     0.2821
                                                  Root MSE        =  2530.9456

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -294.1955   55.69172    -5.28   0.000    -405.2417   -183.1494
       _cons |   12430.83    1222.03    10.17   0.000     9994.169    14867.48
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+

. predict yhat_r, xb

. describe yhat_r

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------
yhat_r          double  %10.0g                Linear prediction

. di "yhat_r[1] = " %20.15f yhat_r[1]
yhat_r[1] = 5958.524760527507169

. 
. * Generate manual predictions as double
. gen double manual_double = _b[mpg] * mpg + _b[_cons]

. describe manual_double

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------
manual_double   double  %10.0g                

. 
. * Compare yhat_c to yhat_r
. gen diff = yhat_r - yhat_c

. summarize diff

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        diff |         74   -.0000173    .0001485  -.0003773   .0002052

. di "Max diff: " %12.6e max(abs(diff))
Max diff: invalid syntax
r(198);

end of do-file
r(198);
