
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_predict_matrix.do 

. * Check matrix storage issue
. clear all

. set more off

. 
. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. 
. sysuse auto, clear
(1978 automobile data)

. 
. di _n "=== Check e(b) matrix after creghdfe ===" _n

=== Check e(b) matrix after creghdfe ===


. 
. creghdfe price mpg, absorb(foreign)
(HDFE estimator converged in 2 iterations)

HDFE Linear regression                          Number of obs     =         74
Absorbing 1 HDFE group                          F(  1,      71)   =      27.91
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2838
                                                Adj R-squared     =     0.2637
                                                Within R-sq.      =     0.2821
                                                Root MSE          =  2530.9456

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -294.1955   55.69172    -5.28   0.000    -405.2417   -183.1494
       _cons |   12430.83    1222.03    10.17   0.000     9994.169    14867.48
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+

. 
. di "Immediately after creghdfe:"
Immediately after creghdfe:

. di "_b[mpg] = " %20.15f _b[mpg]
_b[mpg] = -294.195533095470864

. di "_b[_cons] = " %20.15f _b[_cons]
_b[_cons] =  1.2430826488628e+04

. 
. matrix list e(b), format(%20.15f)

e(b)[1,2]
                     mpg                 _cons
y1  -294.195533095470864   1.2430826488628e+04

. 
. * Check what _predict sees
. predict yhat_c, xb

. 
. * Manual calculation
. local mpg1 = mpg[1]

. local manual = _b[mpg] * `mpg1' + _b[_cons]

. 
. di _n "For obs 1 (mpg=" `mpg1' "):"

For obs 1 (mpg=22):

. di "  Manual calc: " %20.15f `manual'
  Manual calc: 5958.524760527510807

. di "  predict xb:  " %20.15f yhat_c[1]
  predict xb:  5958.524902343750000

. di "  Difference:  " %12.6e (yhat_c[1] - `manual')
  Difference:   1.41816e-04

. 
. * Try manually computing for all obs
. gen manual_pred = _b[mpg] * mpg + _b[_cons]

. gen diff = yhat_c - manual_pred

. 
. summarize diff

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        diff |         74           0           0          0          0

. di _n "Max abs difference: " %12.6e max(abs(diff), abs(diff))

Max abs difference:  0.00000e+00

. 
. * Check e(V) matrix
. di _n "e(V) matrix:"

e(V) matrix:

. matrix list e(V), format(%12.6f)

symmetric e(V)[2,2]
                mpg         _cons
  mpg   3101.567522
_cons  -6.60550e+04   1.49336e+06

. 
. * Check variable names in e(b)
. local names : colfullnames e(b)

. di _n "Column names in e(b): `names'"

Column names in e(b): mpg _cons

. 
. * Check if there's an issue with how _predict works
. * Create our own xb manually using matrix operations
. matrix b = e(b)

. di _n "Direct matrix access:"

Direct matrix access:

. di "  b[1,1] (mpg coef) = " %20.15f b[1,1]
  b[1,1] (mpg coef) = -294.195533095470864

. di "  b[1,2] (_cons) = " %20.15f b[1,2]
  b[1,2] (_cons) =  1.2430826488628e+04

. 
. gen manual2 = b[1,1] * mpg + b[1,2]

. gen diff2 = yhat_c - manual2

. summarize diff2

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       diff2 |         74           0           0          0          0

. 
. di _n "Test complete."

Test complete.

. 
end of do-file
