
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_predict2.do 

. * Test predict functionality - xbd option
. * Compare reghdfe vs creghdfe predictions including fixed effects
. 
. clear all

. set more off

. 
. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. 
. sysuse auto, clear
(1978 automobile data)

. 
. di _n "=== Test: XBD (fitted values including fixed effects) ===" _n

=== Test: XBD (fitted values including fixed effects) ===


. 
. * Run reghdfe with resid option to enable xbd
. reghdfe price mpg, absorb(foreign trunk) resid
(dropped 5 singleton observations)
(MWFE estimator converged in 3 iterations)

HDFE Linear regression                            Number of obs   =         69
Absorbing 2 HDFE groups                           F(   1,     54) =       8.42
                                                  Prob > F        =     0.0054
                                                  R-squared       =     0.3233
                                                  Adj R-squared   =     0.1479
                                                  Within R-sq.    =     0.1348
                                                  Root MSE        =  2617.7464

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -221.2027   76.25112    -2.90   0.005     -374.077   -68.32844
       _cons |   10767.42   1672.127     6.44   0.000     7415.012    14119.84
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
       trunk |        13           1          12     |
-----------------------------------------------------+

. predict yhat_reghdfe_xbd, xbd
(5 missing values generated)

. predict yhat_reghdfe_xb, xb

. predict yhat_reghdfe_d, d
(5 missing values generated)

. predict yhat_reghdfe_resid, residuals
(5 missing values generated)

. 
. di "reghdfe predictions created:"
reghdfe predictions created:

. summarize yhat_reghdfe_*

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
yhat_regh~bd |         69    6003.551    1612.573   2245.742   9766.288
yhat_reghd~b |         74    6056.404    1279.769   1698.112   8112.991
yhat_regh~_d |         69    1.13e-12    1109.898  -1643.297   2411.727
yhat_regh~id |         69   -6.15e-13     2332.76  -3335.781   9146.054

. 
. * Now run creghdfe
. creghdfe price mpg, absorb(foreign trunk)
(dropped 5 singleton observations)
(HDFE estimator converged in 3 iterations)

HDFE Linear regression                          Number of obs     =         69
Absorbing 2 HDFE groups                         F(  1,      54)   =       8.42
                                                Prob > F          =     0.0054
                                                R-squared         =     0.3233
                                                Adj R-squared     =     0.1479
                                                Within R-sq.      =     0.1348
                                                Root MSE          =  2617.7464

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -221.2027   76.25112    -2.90   0.005     -374.077   -68.32844
       _cons |   10767.42   1672.127     6.44   0.000     7415.012    14119.84
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
       trunk |        13           1          12     |
-----------------------------------------------------+

. 
. * Try predict with xbd option - likely will fail
. capture predict yhat_creghdfe_xbd, xbd

. if _rc {
.     di as error "xbd option not available for creghdfe (rc=" _rc ")"
xbd option not available for creghdfe (rc=198)
.     di as text "This is expected - creghdfe does not store fixed effects"
This is expected - creghdfe does not store fixed effects
. }

. else {
.     di "creghdfe xbd prediction created"
. }

. 
. * xb should work
. predict yhat_creghdfe_xb, xb

. 
. * Compare the xb predictions
. gen diff_xb = yhat_reghdfe_xb - yhat_creghdfe_xb

. 
. di _n "XB prediction comparison:"

XB prediction comparison:

. summarize diff_xb

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     diff_xb |         74   -2.88e-06    .0001346  -.0002323   .0002252

. qui sum diff_xb

. local max_diff = max(abs(r(min)), abs(r(max)))

. di "Max abs diff in xb: " %12.6e `max_diff'
Max abs diff in xb:  2.32264e-04

. 
. * Show what reghdfe's xbd gives vs xb
. di _n "reghdfe xbd vs xb comparison:"

reghdfe xbd vs xb comparison:

. gen diff_xbd_xb = yhat_reghdfe_xbd - yhat_reghdfe_xb
(5 missing values generated)

. summarize diff_xbd_xb

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 diff_xbd_xb |         69   -9.51e-06    1109.898  -1643.297   2411.727

. di "This difference represents the absorbed fixed effects"
This difference represents the absorbed fixed effects

. 
. * Check: xbd should equal y - residuals
. gen check = price - yhat_reghdfe_resid - yhat_reghdfe_xbd
(5 missing values generated)

. di _n "Verification: y - resid - xbd should be 0:"

Verification: y - resid - xbd should be 0:

. summarize check

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       check |         69           0           0          0          0

. 
. di _n "Test complete."

Test complete.

. 
end of do-file
