
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do test_predict_eb.do 

. * Check e(b) matrix structure
. clear all

. set more off

. 
. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. 
. sysuse auto, clear
(1978 automobile data)

. 
. di _n "=== Check e(b) matrix structure ===" _n

=== Check e(b) matrix structure ===


. 
. * Run reghdfe
. reghdfe price mpg, absorb(foreign) resid
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =         74
Absorbing 1 HDFE group                            F(   1,     71) =      27.91
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.2838
                                                  Adj R-squared   =     0.2637
                                                  Within R-sq.    =     0.2821
                                                  Root MSE        =  2530.9456

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -294.1955   55.69172    -5.28   0.000    -405.2417   -183.1494
       _cons |   12430.83    1222.03    10.17   0.000     9994.169    14867.48
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+

. 
. di "reghdfe e(b) matrix:"
reghdfe e(b) matrix:

. matrix list e(b), format(%20.15f)

e(b)[1,2]
                     mpg                 _cons
y1  -294.195533095470807   1.2430826488628e+04

. 
. di _n "reghdfe coefficients from _b[]:"

reghdfe coefficients from _b[]:

. di "_b[mpg] = " %20.15f _b[mpg]
_b[mpg] = -294.195533095470807

. di "_b[_cons] = " %20.15f _b[_cons]
_b[_cons] =  1.2430826488628e+04

. 
. predict yhat_r, xb

. 
. * Now run creghdfe
. creghdfe price mpg, absorb(foreign)
(HDFE estimator converged in 2 iterations)

HDFE Linear regression                          Number of obs     =         74
Absorbing 1 HDFE group                          F(  1,      71)   =      27.91
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2838
                                                Adj R-squared     =     0.2637
                                                Within R-sq.      =     0.2821
                                                Root MSE          =  2530.9456

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -294.1955   55.69172    -5.28   0.000    -405.2417   -183.1494
       _cons |   12430.83    1222.03    10.17   0.000     9994.169    14867.48
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+

. 
. di _n "creghdfe e(b) matrix:"

creghdfe e(b) matrix:

. matrix list e(b), format(%20.15f)

e(b)[1,2]
                     mpg                 _cons
y1  -294.195533095470864   1.2430826488628e+04

. 
. di _n "creghdfe coefficients from _b[]:"

creghdfe coefficients from _b[]:

. di "_b[mpg] = " %20.15f _b[mpg]
_b[mpg] = -294.195533095470864

. di "_b[_cons] = " %20.15f _b[_cons]
_b[_cons] =  1.2430826488628e+04

. 
. predict yhat_c, xb

. 
. * Compare predictions
. gen diff = yhat_r - yhat_c

. qui sum diff

. di _n "Prediction difference:"

Prediction difference:

. di "  Mean: " %12.6e r(mean)
  Mean: -1.73208e-05

. di "  Min:  " %12.6e r(min)
  Min:  -3.77268e-04

. di "  Max:  " %12.6e r(max)
  Max:   2.05194e-04

. 
. * Manual check
. di _n "=== Manual calculation check ==="

=== Manual calculation check ===

. * For first observation (mpg = 22)
. local mpg1 = mpg[1]

. di "First obs mpg = " `mpg1'
First obs mpg = 22

. 
. * reghdfe prediction for first obs
. di "reghdfe yhat[1] = " %20.15f yhat_r[1]
reghdfe yhat[1] = 5958.524760527507169

. * creghdfe prediction for first obs
. di "creghdfe yhat[1] = " %20.15f yhat_c[1]
creghdfe yhat[1] = 5958.524902343750000

. 
. * Manual using creghdfe coefficients
. local manual_c = _b[mpg] * `mpg1' + _b[_cons]

. di "Manual (creghdfe coefs): " %20.15f `manual_c'
Manual (creghdfe coefs): 5958.524760527510807

. 
. * Run reghdfe again to get its coefficients for manual calc
. reghdfe price mpg, absorb(foreign) resid
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =         74
Absorbing 1 HDFE group                            F(   1,     71) =      27.91
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.2838
                                                  Adj R-squared   =     0.2637
                                                  Within R-sq.    =     0.2821
                                                  Root MSE        =  2530.9456

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -294.1955   55.69172    -5.28   0.000    -405.2417   -183.1494
       _cons |   12430.83    1222.03    10.17   0.000     9994.169    14867.48
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
     foreign |         2           0           2     |
-----------------------------------------------------+

. local manual_r = _b[mpg] * `mpg1' + _b[_cons]

. di "Manual (reghdfe coefs): " %20.15f `manual_r'
Manual (reghdfe coefs): 5958.524760527507169

. 
. di _n "yhat_r[1] - manual_r = " %12.6e (yhat_r[1] - `manual_r')

yhat_r[1] - manual_r =  0.00000e+00

. 
. di _n "Test complete."

Test complete.

. 
end of do-file
