
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 18.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 16-core network, expiring  2 Jul 2026
Serial number: 501909320077
  Licensed to: Michael Droste
               Stanford University GSB

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running /Users/Mike/Documents/Stata/profile.do ...

. do /Users/Mike/Documents/GitHub/stata-ctools/benchmark/test_fix.do 

. clear all

. set more off

. adopath + "../build"
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/Mike/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/Mike/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../build"

. sysuse auto, clear
(1978 automobile data)

. drop if missing(price, mpg, weight, rep78)
(5 observations deleted)

. 
. display "============================================="
=============================================

. display "TESTING CQREG VCE FIX"
TESTING CQREG VCE FIX

. display "============================================="
=============================================

. 
. * Run qreg with residual method (what we're matching)
. qreg price mpg weight, quantile(0.5) vce(iid, residual)

Iteration 1:  WLS sum of weighted deviations =  63341.574

Iteration 1:  Sum of abs. weighted deviations =  63536.156
Iteration 2:  Sum of abs. weighted deviations =  58812.858
Iteration 3:  Sum of abs. weighted deviations =  58491.205
Iteration 4:  Sum of abs. weighted deviations =  58480.736
Iteration 5:  Sum of abs. weighted deviations =  58477.095
Iteration 6:  Sum of abs. weighted deviations =  58466.957

Median regression                                   Number of obs =         69
  Raw sum of deviations    65163 (about 5079)
  Min sum of deviations 58466.96                    Pseudo R2     =     0.1028

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -64.08696   85.17614    -0.75   0.454    -234.1466    105.9727
      weight |   .5782609   .6302291     0.92   0.362    -.6800321    1.836554
       _cons |       4812   3550.875     1.36   0.180     -2277.55    11901.55
------------------------------------------------------------------------------

. matrix V_qreg_resid = e(V)

. local se_mpg_qreg_resid = _se[mpg]

. local se_wt_qreg_resid = _se[weight]

. local sparsity_qreg = e(sparsity)

. local bw_qreg = e(bwidth)

. 
. display _n "=== QREG VCE(IID, RESIDUAL) ==="

=== QREG VCE(IID, RESIDUAL) ===

. display "SE[mpg]: " %12.6f `se_mpg_qreg_resid'
SE[mpg]:    85.176144

. display "SE[weight]: " %12.6f `se_wt_qreg_resid'
SE[weight]:     0.630229

. display "Sparsity: " %12.4f `sparsity_qreg'
Sparsity:    4883.3016

. display "Bandwidth: " %12.8f `bw_qreg'
Bandwidth:   0.24041112

. 
. * Run qreg with default (fitted) method
. quietly qreg price mpg weight, quantile(0.5)

. local se_mpg_qreg_fitted = _se[mpg]

. local se_wt_qreg_fitted = _se[weight]

. 
. display _n "=== QREG VCE(IID, FITTED) [default] ==="

=== QREG VCE(IID, FITTED) [default] ===

. display "SE[mpg]: " %12.6f `se_mpg_qreg_fitted'
SE[mpg]:   121.175244

. display "SE[weight]: " %12.6f `se_wt_qreg_fitted'
SE[weight]:     0.896591

. 
. * Run cqreg
. cqreg price mpg weight, quantile(0.5) verbose

------------------------------------------------------------
cqreg: C-Accelerated Quantile Regression
------------------------------------------------------------
Quantile:   .5
Depvar:     price
Indepvars:   mpg weight
Obs:        69
VCE type:   iid
Bandwidth:  Hall-Sheather
------------------------------------------------------------

cqreg: N=69, K=3, G=0, quantile=0.500
cqreg: IPM: iterations=12, converged=1, objective=58466.9565, time=0.000s
cqreg: Sparsity: 4922.5597, bandwidth: 0.240411
cqreg: Total time: 0.001s (load: 0.001, hdfe: 0.000, ipm: 0.000, vce: 0.000)

Median regression                                  Number of obs =         69
  Raw sum of deviations 65163    (about 5079     )
  Min sum of deviations 58467                      Pseudo R2     =     0.1028

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |  -64.08696    85.8609    -0.75   0.458    -235.5138    107.3399
      weight |   .5782609   .6352956     0.91   0.366    -.6901478     1.84667
       _cons |       4812   3579.421     1.34   0.183    -2334.545    11958.54
------------------------------------------------------------------------------

Iterations: 12, converged: yes
Total time:     0.001 seconds

. local se_mpg_cqreg = _se[mpg]

. local se_wt_cqreg = _se[weight]

. 
. display _n "=== CQREG ==="

=== CQREG ===

. display "SE[mpg]: " %12.6f `se_mpg_cqreg'
SE[mpg]:    85.860897

. display "SE[weight]: " %12.6f `se_wt_cqreg'
SE[weight]:     0.635296

. 
. display _n "============================================="

=============================================

. display "COMPARISON (cqreg vs qreg residual method)"
COMPARISON (cqreg vs qreg residual method)

. display "============================================="
=============================================

. display "SE[mpg] ratio: " %8.6f (`se_mpg_cqreg' / `se_mpg_qreg_resid')
SE[mpg] ratio: 1.008039

. display "SE[weight] ratio: " %8.6f (`se_wt_cqreg' / `se_wt_qreg_resid')
SE[weight] ratio: 1.008039

. 
. local diff_mpg = abs(`se_mpg_cqreg' - `se_mpg_qreg_resid')

. local diff_wt = abs(`se_wt_cqreg' - `se_wt_qreg_resid')

. 
. display _n "Absolute differences:"

Absolute differences:

. display "  SE[mpg]: " %12.8f `diff_mpg'
  SE[mpg]:   0.68475219

. display "  SE[weight]: " %12.10f `diff_wt'
  SE[weight]: 0.0050665682

. 
. if `diff_mpg' < 0.001 & `diff_wt' < 0.00001 {
.     display _n "{result}SUCCESS: cqreg matches qreg vce(iid, residual)!{txt}"
. } 

. else {
.     display _n "{error}MISMATCH: cqreg differs from qreg{txt}"

MISMATCH: cqreg differs from qreg
. }

. 
. display _n "============================================="

=============================================

. display "NOTE: cqreg matches qreg vce(iid, residual)."
NOTE: cqreg matches qreg vce(iid, residual).

. display "For qreg's default (fitted) method, ratio is:"
For qreg's default (fitted) method, ratio is:

. display "  cqreg/fitted = " %8.4f (`se_mpg_cqreg' / `se_mpg_qreg_fitted')
  cqreg/fitted =   0.7086

. display "============================================="
=============================================

. 
end of do-file
